podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV44F15.h
#define ADC_STAT_EOSI0_SHIFT                     11                                                  /*!< ADC0_STAT: EOSI0 Position               */
#define ADC_STAT_EOSI1_MASK                      (0x01UL << ADC_STAT_EOSI1_SHIFT)                    /*!< ADC0_STAT: EOSI1 Mask                   */
#define ADC_STAT_EOSI1_SHIFT                     12                                                  /*!< ADC0_STAT: EOSI1 Position               */
#define ADC_STAT_CIP1_MASK                       (0x01UL << ADC_STAT_CIP1_SHIFT)                     /*!< ADC0_STAT: CIP1 Mask                    */
#define ADC_STAT_CIP1_SHIFT                      14                                                  /*!< ADC0_STAT: CIP1 Position                */
#define ADC_STAT_CIP0_MASK                       (0x01UL << ADC_STAT_CIP0_SHIFT)                     /*!< ADC0_STAT: CIP0 Mask                    */
#define ADC_STAT_CIP0_SHIFT                      15                                                  /*!< ADC0_STAT: CIP0 Position                */
/* ------- RDY Bit Fields                           ------ */
#define ADC_RDY_RDY_MASK                         (0xFFFFUL << ADC_RDY_RDY_SHIFT)                     /*!< ADC0_RDY: RDY Mask                      */
#define ADC_RDY_RDY_SHIFT                        0                                                   /*!< ADC0_RDY: RDY Position                  */
#define ADC_RDY_RDY(x)                           (((uint16_t)(((uint16_t)(x))<<ADC_RDY_RDY_SHIFT))&ADC_RDY_RDY_MASK) /*!< ADC0_RDY                                */
/* ------- LOLIMSTAT Bit Fields                     ------ */
#define ADC_LOLIMSTAT_LLS_MASK                   (0xFFFFUL << ADC_LOLIMSTAT_LLS_SHIFT)               /*!< ADC0_LOLIMSTAT: LLS Mask                */
#define ADC_LOLIMSTAT_LLS_SHIFT                  0                                                   /*!< ADC0_LOLIMSTAT: LLS Position            */
#define ADC_LOLIMSTAT_LLS(x)                     (((uint16_t)(((uint16_t)(x))<<ADC_LOLIMSTAT_LLS_SHIFT))&ADC_LOLIMSTAT_LLS_MASK) /*!< ADC0_LOLIMSTAT                          */
/* ------- HILIMSTAT Bit Fields                     ------ */
#define ADC_HILIMSTAT_HLS_MASK                   (0xFFFFUL << ADC_HILIMSTAT_HLS_SHIFT)               /*!< ADC0_HILIMSTAT: HLS Mask                */
#define ADC_HILIMSTAT_HLS_SHIFT                  0                                                   /*!< ADC0_HILIMSTAT: HLS Position            */
#define ADC_HILIMSTAT_HLS(x)                     (((uint16_t)(((uint16_t)(x))<<ADC_HILIMSTAT_HLS_SHIFT))&ADC_HILIMSTAT_HLS_MASK) /*!< ADC0_HILIMSTAT                          */
/* ------- ZXSTAT Bit Fields                        ------ */
#define ADC_ZXSTAT_ZCS_MASK                      (0xFFFFUL << ADC_ZXSTAT_ZCS_SHIFT)                  /*!< ADC0_ZXSTAT: ZCS Mask                   */
#define ADC_ZXSTAT_ZCS_SHIFT                     0                                                   /*!< ADC0_ZXSTAT: ZCS Position               */
#define ADC_ZXSTAT_ZCS(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_ZXSTAT_ZCS_SHIFT))&ADC_ZXSTAT_ZCS_MASK) /*!< ADC0_ZXSTAT                             */
/* ------- RSLT Bit Fields                          ------ */
#define ADC_RSLT_RSLT_MASK                       (0xFFFUL << ADC_RSLT_RSLT_SHIFT)                    /*!< ADC0_RSLT: RSLT Mask                    */
#define ADC_RSLT_RSLT_SHIFT                      3                                                   /*!< ADC0_RSLT: RSLT Position                */
#define ADC_RSLT_RSLT(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_RSLT_RSLT_SHIFT))&ADC_RSLT_RSLT_MASK) /*!< ADC0_RSLT                               */
#define ADC_RSLT_SEXT_MASK                       (0x01UL << ADC_RSLT_SEXT_SHIFT)                     /*!< ADC0_RSLT: SEXT Mask                    */
#define ADC_RSLT_SEXT_SHIFT                      15                                                  /*!< ADC0_RSLT: SEXT Position                */
/* ------- LOLIM Bit Fields                         ------ */
#define ADC_LOLIM_LLMT_MASK                      (0xFFFUL << ADC_LOLIM_LLMT_SHIFT)                   /*!< ADC0_LOLIM: LLMT Mask                   */
#define ADC_LOLIM_LLMT_SHIFT                     3                                                   /*!< ADC0_LOLIM: LLMT Position               */
#define ADC_LOLIM_LLMT(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_LOLIM_LLMT_SHIFT))&ADC_LOLIM_LLMT_MASK) /*!< ADC0_LOLIM                              */
/* ------- HILIM Bit Fields                         ------ */
#define ADC_HILIM_HLMT_MASK                      (0xFFFUL << ADC_HILIM_HLMT_SHIFT)                   /*!< ADC0_HILIM: HLMT Mask                   */
#define ADC_HILIM_HLMT_SHIFT                     3                                                   /*!< ADC0_HILIM: HLMT Position               */
#define ADC_HILIM_HLMT(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_HILIM_HLMT_SHIFT))&ADC_HILIM_HLMT_MASK) /*!< ADC0_HILIM                              */
/* ------- OFFST Bit Fields                         ------ */
#define ADC_OFFST_OFFSET_MASK                    (0xFFFUL << ADC_OFFST_OFFSET_SHIFT)                 /*!< ADC0_OFFST: OFFSET Mask                 */
#define ADC_OFFST_OFFSET_SHIFT                   3                                                   /*!< ADC0_OFFST: OFFSET Position             */
#define ADC_OFFST_OFFSET(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_OFFST_OFFSET_SHIFT))&ADC_OFFST_OFFSET_MASK) /*!< ADC0_OFFST                              */
/* ------- PWR Bit Fields                           ------ */
#define ADC_PWR_PD0_MASK                         (0x01UL << ADC_PWR_PD0_SHIFT)                       /*!< ADC0_PWR: PD0 Mask                      */
#define ADC_PWR_PD0_SHIFT                        0                                                   /*!< ADC0_PWR: PD0 Position                  */
#define ADC_PWR_PD1_MASK                         (0x01UL << ADC_PWR_PD1_SHIFT)                       /*!< ADC0_PWR: PD1 Mask                      */
#define ADC_PWR_PD1_SHIFT                        1                                                   /*!< ADC0_PWR: PD1 Position                  */
#define ADC_PWR_APD_MASK                         (0x01UL << ADC_PWR_APD_SHIFT)                       /*!< ADC0_PWR: APD Mask                      */
#define ADC_PWR_APD_SHIFT                        3                                                   /*!< ADC0_PWR: APD Position                  */
#define ADC_PWR_PUDELAY_MASK                     (0x3FUL << ADC_PWR_PUDELAY_SHIFT)                   /*!< ADC0_PWR: PUDELAY Mask                  */
#define ADC_PWR_PUDELAY_SHIFT                    4                                                   /*!< ADC0_PWR: PUDELAY Position              */
#define ADC_PWR_PUDELAY(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_PWR_PUDELAY_SHIFT))&ADC_PWR_PUDELAY_MASK) /*!< ADC0_PWR                                */
#define ADC_PWR_PSTS0_MASK                       (0x01UL << ADC_PWR_PSTS0_SHIFT)                     /*!< ADC0_PWR: PSTS0 Mask                    */
#define ADC_PWR_PSTS0_SHIFT                      10                                                  /*!< ADC0_PWR: PSTS0 Position                */
#define ADC_PWR_PSTS1_MASK                       (0x01UL << ADC_PWR_PSTS1_SHIFT)                     /*!< ADC0_PWR: PSTS1 Mask                    */
#define ADC_PWR_PSTS1_SHIFT                      11                                                  /*!< ADC0_PWR: PSTS1 Position                */
#define ADC_PWR_ASB_MASK                         (0x01UL << ADC_PWR_ASB_SHIFT)                       /*!< ADC0_PWR: ASB Mask                      */
#define ADC_PWR_ASB_SHIFT                        15                                                  /*!< ADC0_PWR: ASB Position                  */
/* ------- CAL Bit Fields                           ------ */
#define ADC_CAL_SEL_VREFLO_A_MASK                (0x01UL << ADC_CAL_SEL_VREFLO_A_SHIFT)              /*!< ADC0_CAL: SEL_VREFLO_A Mask             */
#define ADC_CAL_SEL_VREFLO_A_SHIFT               12                                                  /*!< ADC0_CAL: SEL_VREFLO_A Position         */
#define ADC_CAL_SEL_VREFH_A_MASK                 (0x01UL << ADC_CAL_SEL_VREFH_A_SHIFT)               /*!< ADC0_CAL: SEL_VREFH_A Mask              */
#define ADC_CAL_SEL_VREFH_A_SHIFT                13                                                  /*!< ADC0_CAL: SEL_VREFH_A Position          */
#define ADC_CAL_SEL_VREFLO_B_MASK                (0x01UL << ADC_CAL_SEL_VREFLO_B_SHIFT)              /*!< ADC0_CAL: SEL_VREFLO_B Mask             */
#define ADC_CAL_SEL_VREFLO_B_SHIFT               14                                                  /*!< ADC0_CAL: SEL_VREFLO_B Position         */
#define ADC_CAL_SEL_VREFH_B_MASK                 (0x01UL << ADC_CAL_SEL_VREFH_B_SHIFT)               /*!< ADC0_CAL: SEL_VREFH_B Mask              */
#define ADC_CAL_SEL_VREFH_B_SHIFT                15                                                  /*!< ADC0_CAL: SEL_VREFH_B Position          */
/* ------- GC1 Bit Fields                           ------ */
#define ADC_GC1_GAIN0_MASK                       (0x03UL << ADC_GC1_GAIN0_SHIFT)                     /*!< ADC0_GC1: GAIN0 Mask                    */
#define ADC_GC1_GAIN0_SHIFT                      0                                                   /*!< ADC0_GC1: GAIN0 Position                */
#define ADC_GC1_GAIN0(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_GC1_GAIN0_SHIFT))&ADC_GC1_GAIN0_MASK) /*!< ADC0_GC1                                */
#define ADC_GC1_GAIN1_MASK                       (0x03UL << ADC_GC1_GAIN1_SHIFT)                     /*!< ADC0_GC1: GAIN1 Mask                    */
#define ADC_GC1_GAIN1_SHIFT                      2                                                   /*!< ADC0_GC1: GAIN1 Position                */
#define ADC_GC1_GAIN1(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_GC1_GAIN1_SHIFT))&ADC_GC1_GAIN1_MASK) /*!< ADC0_GC1                                */
#define ADC_GC1_GAIN2_MASK                       (0x03UL << ADC_GC1_GAIN2_SHIFT)                     /*!< ADC0_GC1: GAIN2 Mask                    */
#define ADC_GC1_GAIN2_SHIFT                      4                                                   /*!< ADC0_GC1: GAIN2 Position                */
#define ADC_GC1_GAIN2(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_GC1_GAIN2_SHIFT))&ADC_GC1_GAIN2_MASK) /*!< ADC0_GC1                                */
#define ADC_GC1_GAIN3_MASK                       (0x03UL << ADC_GC1_GAIN3_SHIFT)                     /*!< ADC0_GC1: GAIN3 Mask                    */
#define ADC_GC1_GAIN3_SHIFT                      6                                                   /*!< ADC0_GC1: GAIN3 Position                */
#define ADC_GC1_GAIN3(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_GC1_GAIN3_SHIFT))&ADC_GC1_GAIN3_MASK) /*!< ADC0_GC1                                */
#define ADC_GC1_GAIN4_MASK                       (0x03UL << ADC_GC1_GAIN4_SHIFT)                     /*!< ADC0_GC1: GAIN4 Mask                    */
#define ADC_GC1_GAIN4_SHIFT                      8                                                   /*!< ADC0_GC1: GAIN4 Position                */
#define ADC_GC1_GAIN4(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_GC1_GAIN4_SHIFT))&ADC_GC1_GAIN4_MASK) /*!< ADC0_GC1                                */
#define ADC_GC1_GAIN5_MASK                       (0x03UL << ADC_GC1_GAIN5_SHIFT)                     /*!< ADC0_GC1: GAIN5 Mask                    */
#define ADC_GC1_GAIN5_SHIFT                      10                                                  /*!< ADC0_GC1: GAIN5 Position                */
#define ADC_GC1_GAIN5(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_GC1_GAIN5_SHIFT))&ADC_GC1_GAIN5_MASK) /*!< ADC0_GC1                                */
#define ADC_GC1_GAIN6_MASK                       (0x03UL << ADC_GC1_GAIN6_SHIFT)                     /*!< ADC0_GC1: GAIN6 Mask                    */
#define ADC_GC1_GAIN6_SHIFT                      12                                                  /*!< ADC0_GC1: GAIN6 Position                */
#define ADC_GC1_GAIN6(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_GC1_GAIN6_SHIFT))&ADC_GC1_GAIN6_MASK) /*!< ADC0_GC1                                */
#define ADC_GC1_GAIN7_MASK                       (0x03UL << ADC_GC1_GAIN7_SHIFT)                     /*!< ADC0_GC1: GAIN7 Mask                    */
#define ADC_GC1_GAIN7_SHIFT                      14                                                  /*!< ADC0_GC1: GAIN7 Position                */
#define ADC_GC1_GAIN7(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_GC1_GAIN7_SHIFT))&ADC_GC1_GAIN7_MASK) /*!< ADC0_GC1                                */
/* ------- GC2 Bit Fields                           ------ */
#define ADC_GC2_GAIN8_MASK                       (0x03UL << ADC_GC2_GAIN8_SHIFT)                     /*!< ADC0_GC2: GAIN8 Mask                    */
#define ADC_GC2_GAIN8_SHIFT                      0                                                   /*!< ADC0_GC2: GAIN8 Position                */
#define ADC_GC2_GAIN8(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_GC2_GAIN8_SHIFT))&ADC_GC2_GAIN8_MASK) /*!< ADC0_GC2                                */
#define ADC_GC2_GAIN9_MASK                       (0x03UL << ADC_GC2_GAIN9_SHIFT)                     /*!< ADC0_GC2: GAIN9 Mask                    */
#define ADC_GC2_GAIN9_SHIFT                      2                                                   /*!< ADC0_GC2: GAIN9 Position                */
#define ADC_GC2_GAIN9(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_GC2_GAIN9_SHIFT))&ADC_GC2_GAIN9_MASK) /*!< ADC0_GC2                                */
#define ADC_GC2_GAIN10_MASK                      (0x03UL << ADC_GC2_GAIN10_SHIFT)                    /*!< ADC0_GC2: GAIN10 Mask                   */
#define ADC_GC2_GAIN10_SHIFT                     4                                                   /*!< ADC0_GC2: GAIN10 Position               */
#define ADC_GC2_GAIN10(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_GC2_GAIN10_SHIFT))&ADC_GC2_GAIN10_MASK) /*!< ADC0_GC2                                */
#define ADC_GC2_GAIN11_MASK                      (0x03UL << ADC_GC2_GAIN11_SHIFT)                    /*!< ADC0_GC2: GAIN11 Mask                   */
#define ADC_GC2_GAIN11_SHIFT                     6                                                   /*!< ADC0_GC2: GAIN11 Position               */
#define ADC_GC2_GAIN11(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_GC2_GAIN11_SHIFT))&ADC_GC2_GAIN11_MASK) /*!< ADC0_GC2                                */
#define ADC_GC2_GAIN12_MASK                      (0x03UL << ADC_GC2_GAIN12_SHIFT)                    /*!< ADC0_GC2: GAIN12 Mask                   */
#define ADC_GC2_GAIN12_SHIFT                     8                                                   /*!< ADC0_GC2: GAIN12 Position               */
#define ADC_GC2_GAIN12(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_GC2_GAIN12_SHIFT))&ADC_GC2_GAIN12_MASK) /*!< ADC0_GC2                                */
#define ADC_GC2_GAIN13_MASK                      (0x03UL << ADC_GC2_GAIN13_SHIFT)                    /*!< ADC0_GC2: GAIN13 Mask                   */
#define ADC_GC2_GAIN13_SHIFT                     10                                                  /*!< ADC0_GC2: GAIN13 Position               */
#define ADC_GC2_GAIN13(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_GC2_GAIN13_SHIFT))&ADC_GC2_GAIN13_MASK) /*!< ADC0_GC2                                */
#define ADC_GC2_GAIN14_MASK                      (0x03UL << ADC_GC2_GAIN14_SHIFT)                    /*!< ADC0_GC2: GAIN14 Mask                   */
#define ADC_GC2_GAIN14_SHIFT                     12                                                  /*!< ADC0_GC2: GAIN14 Position               */
#define ADC_GC2_GAIN14(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_GC2_GAIN14_SHIFT))&ADC_GC2_GAIN14_MASK) /*!< ADC0_GC2                                */
#define ADC_GC2_GAIN15_MASK                      (0x03UL << ADC_GC2_GAIN15_SHIFT)                    /*!< ADC0_GC2: GAIN15 Mask                   */
#define ADC_GC2_GAIN15_SHIFT                     14                                                  /*!< ADC0_GC2: GAIN15 Position               */
#define ADC_GC2_GAIN15(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_GC2_GAIN15_SHIFT))&ADC_GC2_GAIN15_MASK) /*!< ADC0_GC2                                */
/* ------- SCTRL Bit Fields                         ------ */
#define ADC_SCTRL_SC_MASK                        (0xFFFFUL << ADC_SCTRL_SC_SHIFT)                    /*!< ADC0_SCTRL: SC Mask                     */
#define ADC_SCTRL_SC_SHIFT                       0                                                   /*!< ADC0_SCTRL: SC Position                 */
#define ADC_SCTRL_SC(x)                          (((uint16_t)(((uint16_t)(x))<<ADC_SCTRL_SC_SHIFT))&ADC_SCTRL_SC_MASK) /*!< ADC0_SCTRL                              */
/* ------- PWR2 Bit Fields                          ------ */
#define ADC_PWR2_SPEEDA_MASK                     (0x03UL << ADC_PWR2_SPEEDA_SHIFT)                   /*!< ADC0_PWR2: SPEEDA Mask                  */
#define ADC_PWR2_SPEEDA_SHIFT                    0                                                   /*!< ADC0_PWR2: SPEEDA Position              */
#define ADC_PWR2_SPEEDA(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_PWR2_SPEEDA_SHIFT))&ADC_PWR2_SPEEDA_MASK) /*!< ADC0_PWR2                               */
#define ADC_PWR2_SPEEDB_MASK                     (0x03UL << ADC_PWR2_SPEEDB_SHIFT)                   /*!< ADC0_PWR2: SPEEDB Mask                  */
#define ADC_PWR2_SPEEDB_SHIFT                    2                                                   /*!< ADC0_PWR2: SPEEDB Position              */
#define ADC_PWR2_SPEEDB(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_PWR2_SPEEDB_SHIFT))&ADC_PWR2_SPEEDB_MASK) /*!< ADC0_PWR2                               */
#define ADC_PWR2_DIV1_MASK                       (0x3FUL << ADC_PWR2_DIV1_SHIFT)                     /*!< ADC0_PWR2: DIV1 Mask                    */
#define ADC_PWR2_DIV1_SHIFT                      8                                                   /*!< ADC0_PWR2: DIV1 Position                */
#define ADC_PWR2_DIV1(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_PWR2_DIV1_SHIFT))&ADC_PWR2_DIV1_MASK) /*!< ADC0_PWR2                               */
/* ------- CTRL3 Bit Fields                         ------ */
#define ADC_CTRL3_SCNT0_MASK                     (0x07UL << ADC_CTRL3_SCNT0_SHIFT)                   /*!< ADC0_CTRL3: SCNT0 Mask                  */
#define ADC_CTRL3_SCNT0_SHIFT                    0                                                   /*!< ADC0_CTRL3: SCNT0 Position              */
#define ADC_CTRL3_SCNT0(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_CTRL3_SCNT0_SHIFT))&ADC_CTRL3_SCNT0_MASK) /*!< ADC0_CTRL3                              */
#define ADC_CTRL3_SCNT1_MASK                     (0x07UL << ADC_CTRL3_SCNT1_SHIFT)                   /*!< ADC0_CTRL3: SCNT1 Mask                  */
#define ADC_CTRL3_SCNT1_SHIFT                    3                                                   /*!< ADC0_CTRL3: SCNT1 Position              */
#define ADC_CTRL3_SCNT1(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_CTRL3_SCNT1_SHIFT))&ADC_CTRL3_SCNT1_MASK) /*!< ADC0_CTRL3                              */
#define ADC_CTRL3_DMASRC_MASK                    (0x01UL << ADC_CTRL3_DMASRC_SHIFT)                  /*!< ADC0_CTRL3: DMASRC Mask                 */
#define ADC_CTRL3_DMASRC_SHIFT                   6                                                   /*!< ADC0_CTRL3: DMASRC Position             */
/* ------- SCHLTEN Bit Fields                       ------ */
#define ADC_SCHLTEN_SCHLTEN_MASK                 (0xFFFFUL << ADC_SCHLTEN_SCHLTEN_SHIFT)             /*!< ADC0_SCHLTEN: SCHLTEN Mask              */
#define ADC_SCHLTEN_SCHLTEN_SHIFT                0                                                   /*!< ADC0_SCHLTEN: SCHLTEN Position          */
#define ADC_SCHLTEN_SCHLTEN(x)                   (((uint16_t)(((uint16_t)(x))<<ADC_SCHLTEN_SCHLTEN_SHIFT))&ADC_SCHLTEN_SCHLTEN_MASK) /*!< ADC0_SCHLTEN                            */
/**
 * @} */ /* End group ADC_Register_Masks_GROUP 
 */

