podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV44F15.h
#define AOI_BFCRT232_PT2_DC_MASK                 (0x03UL << AOI_BFCRT232_PT2_DC_SHIFT)               /*!< AOI_BFCRT232: PT2_DC Mask               */
#define AOI_BFCRT232_PT2_DC_SHIFT                8                                                   /*!< AOI_BFCRT232: PT2_DC Position           */
#define AOI_BFCRT232_PT2_DC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT232_PT2_DC_SHIFT))&AOI_BFCRT232_PT2_DC_MASK) /*!< AOI_BFCRT232                            */
#define AOI_BFCRT232_PT2_CC_MASK                 (0x03UL << AOI_BFCRT232_PT2_CC_SHIFT)               /*!< AOI_BFCRT232: PT2_CC Mask               */
#define AOI_BFCRT232_PT2_CC_SHIFT                10                                                  /*!< AOI_BFCRT232: PT2_CC Position           */
#define AOI_BFCRT232_PT2_CC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT232_PT2_CC_SHIFT))&AOI_BFCRT232_PT2_CC_MASK) /*!< AOI_BFCRT232                            */
#define AOI_BFCRT232_PT2_BC_MASK                 (0x03UL << AOI_BFCRT232_PT2_BC_SHIFT)               /*!< AOI_BFCRT232: PT2_BC Mask               */
#define AOI_BFCRT232_PT2_BC_SHIFT                12                                                  /*!< AOI_BFCRT232: PT2_BC Position           */
#define AOI_BFCRT232_PT2_BC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT232_PT2_BC_SHIFT))&AOI_BFCRT232_PT2_BC_MASK) /*!< AOI_BFCRT232                            */
#define AOI_BFCRT232_PT2_AC_MASK                 (0x03UL << AOI_BFCRT232_PT2_AC_SHIFT)               /*!< AOI_BFCRT232: PT2_AC Mask               */
#define AOI_BFCRT232_PT2_AC_SHIFT                14                                                  /*!< AOI_BFCRT232: PT2_AC Position           */
#define AOI_BFCRT232_PT2_AC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT232_PT2_AC_SHIFT))&AOI_BFCRT232_PT2_AC_MASK) /*!< AOI_BFCRT232                            */
/* ------- BFCRT013 Bit Fields                      ------ */
#define AOI_BFCRT013_PT1_DC_MASK                 (0x03UL << AOI_BFCRT013_PT1_DC_SHIFT)               /*!< AOI_BFCRT013: PT1_DC Mask               */
#define AOI_BFCRT013_PT1_DC_SHIFT                0                                                   /*!< AOI_BFCRT013: PT1_DC Position           */
#define AOI_BFCRT013_PT1_DC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT013_PT1_DC_SHIFT))&AOI_BFCRT013_PT1_DC_MASK) /*!< AOI_BFCRT013                            */
#define AOI_BFCRT013_PT1_CC_MASK                 (0x03UL << AOI_BFCRT013_PT1_CC_SHIFT)               /*!< AOI_BFCRT013: PT1_CC Mask               */
#define AOI_BFCRT013_PT1_CC_SHIFT                2                                                   /*!< AOI_BFCRT013: PT1_CC Position           */
#define AOI_BFCRT013_PT1_CC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT013_PT1_CC_SHIFT))&AOI_BFCRT013_PT1_CC_MASK) /*!< AOI_BFCRT013                            */
#define AOI_BFCRT013_PT1_BC_MASK                 (0x03UL << AOI_BFCRT013_PT1_BC_SHIFT)               /*!< AOI_BFCRT013: PT1_BC Mask               */
#define AOI_BFCRT013_PT1_BC_SHIFT                4                                                   /*!< AOI_BFCRT013: PT1_BC Position           */
#define AOI_BFCRT013_PT1_BC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT013_PT1_BC_SHIFT))&AOI_BFCRT013_PT1_BC_MASK) /*!< AOI_BFCRT013                            */
#define AOI_BFCRT013_PT1_AC_MASK                 (0x03UL << AOI_BFCRT013_PT1_AC_SHIFT)               /*!< AOI_BFCRT013: PT1_AC Mask               */
#define AOI_BFCRT013_PT1_AC_SHIFT                6                                                   /*!< AOI_BFCRT013: PT1_AC Position           */
#define AOI_BFCRT013_PT1_AC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT013_PT1_AC_SHIFT))&AOI_BFCRT013_PT1_AC_MASK) /*!< AOI_BFCRT013                            */
#define AOI_BFCRT013_PT0_DC_MASK                 (0x03UL << AOI_BFCRT013_PT0_DC_SHIFT)               /*!< AOI_BFCRT013: PT0_DC Mask               */
#define AOI_BFCRT013_PT0_DC_SHIFT                8                                                   /*!< AOI_BFCRT013: PT0_DC Position           */
#define AOI_BFCRT013_PT0_DC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT013_PT0_DC_SHIFT))&AOI_BFCRT013_PT0_DC_MASK) /*!< AOI_BFCRT013                            */
#define AOI_BFCRT013_PT0_CC_MASK                 (0x03UL << AOI_BFCRT013_PT0_CC_SHIFT)               /*!< AOI_BFCRT013: PT0_CC Mask               */
#define AOI_BFCRT013_PT0_CC_SHIFT                10                                                  /*!< AOI_BFCRT013: PT0_CC Position           */
#define AOI_BFCRT013_PT0_CC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT013_PT0_CC_SHIFT))&AOI_BFCRT013_PT0_CC_MASK) /*!< AOI_BFCRT013                            */
#define AOI_BFCRT013_PT0_BC_MASK                 (0x03UL << AOI_BFCRT013_PT0_BC_SHIFT)               /*!< AOI_BFCRT013: PT0_BC Mask               */
#define AOI_BFCRT013_PT0_BC_SHIFT                12                                                  /*!< AOI_BFCRT013: PT0_BC Position           */
#define AOI_BFCRT013_PT0_BC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT013_PT0_BC_SHIFT))&AOI_BFCRT013_PT0_BC_MASK) /*!< AOI_BFCRT013                            */
#define AOI_BFCRT013_PT0_AC_MASK                 (0x03UL << AOI_BFCRT013_PT0_AC_SHIFT)               /*!< AOI_BFCRT013: PT0_AC Mask               */
#define AOI_BFCRT013_PT0_AC_SHIFT                14                                                  /*!< AOI_BFCRT013: PT0_AC Position           */
#define AOI_BFCRT013_PT0_AC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT013_PT0_AC_SHIFT))&AOI_BFCRT013_PT0_AC_MASK) /*!< AOI_BFCRT013                            */
/* ------- BFCRT233 Bit Fields                      ------ */
#define AOI_BFCRT233_PT3_DC_MASK                 (0x03UL << AOI_BFCRT233_PT3_DC_SHIFT)               /*!< AOI_BFCRT233: PT3_DC Mask               */
#define AOI_BFCRT233_PT3_DC_SHIFT                0                                                   /*!< AOI_BFCRT233: PT3_DC Position           */
#define AOI_BFCRT233_PT3_DC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT233_PT3_DC_SHIFT))&AOI_BFCRT233_PT3_DC_MASK) /*!< AOI_BFCRT233                            */
#define AOI_BFCRT233_PT3_CC_MASK                 (0x03UL << AOI_BFCRT233_PT3_CC_SHIFT)               /*!< AOI_BFCRT233: PT3_CC Mask               */
#define AOI_BFCRT233_PT3_CC_SHIFT                2                                                   /*!< AOI_BFCRT233: PT3_CC Position           */
#define AOI_BFCRT233_PT3_CC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT233_PT3_CC_SHIFT))&AOI_BFCRT233_PT3_CC_MASK) /*!< AOI_BFCRT233                            */
#define AOI_BFCRT233_PT3_BC_MASK                 (0x03UL << AOI_BFCRT233_PT3_BC_SHIFT)               /*!< AOI_BFCRT233: PT3_BC Mask               */
#define AOI_BFCRT233_PT3_BC_SHIFT                4                                                   /*!< AOI_BFCRT233: PT3_BC Position           */
#define AOI_BFCRT233_PT3_BC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT233_PT3_BC_SHIFT))&AOI_BFCRT233_PT3_BC_MASK) /*!< AOI_BFCRT233                            */
#define AOI_BFCRT233_PT3_AC_MASK                 (0x03UL << AOI_BFCRT233_PT3_AC_SHIFT)               /*!< AOI_BFCRT233: PT3_AC Mask               */
#define AOI_BFCRT233_PT3_AC_SHIFT                6                                                   /*!< AOI_BFCRT233: PT3_AC Position           */
#define AOI_BFCRT233_PT3_AC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT233_PT3_AC_SHIFT))&AOI_BFCRT233_PT3_AC_MASK) /*!< AOI_BFCRT233                            */
#define AOI_BFCRT233_PT2_DC_MASK                 (0x03UL << AOI_BFCRT233_PT2_DC_SHIFT)               /*!< AOI_BFCRT233: PT2_DC Mask               */
#define AOI_BFCRT233_PT2_DC_SHIFT                8                                                   /*!< AOI_BFCRT233: PT2_DC Position           */
#define AOI_BFCRT233_PT2_DC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT233_PT2_DC_SHIFT))&AOI_BFCRT233_PT2_DC_MASK) /*!< AOI_BFCRT233                            */
#define AOI_BFCRT233_PT2_CC_MASK                 (0x03UL << AOI_BFCRT233_PT2_CC_SHIFT)               /*!< AOI_BFCRT233: PT2_CC Mask               */
#define AOI_BFCRT233_PT2_CC_SHIFT                10                                                  /*!< AOI_BFCRT233: PT2_CC Position           */
#define AOI_BFCRT233_PT2_CC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT233_PT2_CC_SHIFT))&AOI_BFCRT233_PT2_CC_MASK) /*!< AOI_BFCRT233                            */
#define AOI_BFCRT233_PT2_BC_MASK                 (0x03UL << AOI_BFCRT233_PT2_BC_SHIFT)               /*!< AOI_BFCRT233: PT2_BC Mask               */
#define AOI_BFCRT233_PT2_BC_SHIFT                12                                                  /*!< AOI_BFCRT233: PT2_BC Position           */
#define AOI_BFCRT233_PT2_BC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT233_PT2_BC_SHIFT))&AOI_BFCRT233_PT2_BC_MASK) /*!< AOI_BFCRT233                            */
#define AOI_BFCRT233_PT2_AC_MASK                 (0x03UL << AOI_BFCRT233_PT2_AC_SHIFT)               /*!< AOI_BFCRT233: PT2_AC Mask               */
#define AOI_BFCRT233_PT2_AC_SHIFT                14                                                  /*!< AOI_BFCRT233: PT2_AC Position           */
#define AOI_BFCRT233_PT2_AC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT233_PT2_AC_SHIFT))&AOI_BFCRT233_PT2_AC_MASK) /*!< AOI_BFCRT233                            */
/**
 * @} */ /* End group AOI_Register_Masks_GROUP 
 */

/* AOI - Peripheral instance base addresses */
#define AOI_BasePtr                    0x4005B000UL //!< Peripheral base address
#define AOI                            ((AOI_Type *) AOI_BasePtr) //!< Freescale base pointer
#define AOI_BASE_PTR                   (AOI) //!< Freescale style base pointer
/**
 * @} */ /* End group AOI_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup CAN_Peripheral_access_layer_GROUP CAN Peripheral Access Layer
* @brief C Struct for CAN
* @{
*/

/* ================================================================================ */
/* ================           CAN0 (file:CAN0_MKV)                 ================ */
/* ================================================================================ */

/**
 * @brief Flex Controller Area Network module
 */
/**
* @addtogroup CAN_structs_GROUP CAN struct
* @brief Struct for CAN
* @{
*/
typedef struct {                                /*       CAN0 Structure                                               */
   __IO uint32_t  MCR;                          /**< 0000: Module Configuration Register                                */
   __IO uint32_t  CTRL1;                        /**< 0004: Control 1 Register                                           */
   __IO uint32_t  TIMER;                        /**< 0008: Free Running Timer                                           */
   __I  uint32_t  RESERVED0;                   
   __IO uint32_t  RXMGMASK;                     /**< 0010: Rx Mailboxes Global Mask Register                            */
   __IO uint32_t  RX14MASK;                     /**< 0014: Rx 14 Mask register                                          */
   __IO uint32_t  RX15MASK;                     /**< 0018: Rx 15 Mask register                                          */
   __IO uint32_t  ECR;                          /**< 001C: Error Counter                                                */
   __IO uint32_t  ESR1;                         /**< 0020: Error and Status 1 register                                  */
   __IO uint32_t  IMASK2;                       /**< 0024: Interrupt Masks 2 Register                                   */
   __IO uint32_t  IMASK1;                       /**< 0028: Interrupt Masks 1 register                                   */
   __IO uint32_t  IFLAG2;                       /**< 002C: Interrupt Flags 2 Register                                   */
   __IO uint32_t  IFLAG1;                       /**< 0030: Interrupt Flags 1 register                                   */
   __IO uint32_t  CTRL2;                        /**< 0034: Control 2 Register                                           */
   __I  uint32_t  ESR2;                         /**< 0038: Error and Status 2 register                                  */
   __I  uint32_t  RESERVED1[2];                
   __I  uint32_t  CRCR;                         /**< 0044: CRC Register                                                 */
   __IO uint32_t  RXFGMASK;                     /**< 0048: Rx FIFO Global Mask register                                 */
   __I  uint32_t  RXFIR;                        /**< 004C: Rx FIFO Information Register                                 */
   __IO uint32_t  CBT;                          /**< 0050: CAN Bit Timing Register                                      */
   __I  uint32_t  RESERVED2[11];               
   struct {
      __IO uint32_t  CS;                        /**< 0080: Message Buffer 0 CS Register                                 */
      __IO uint32_t  ID;                        /**< 0084: Message Buffer 0 ID Register                                 */
      __IO uint32_t  WORD0;                     /**< 0088: Message Buffer 0 WORD0 Register                              */
      __IO uint32_t  WORD1;                     /**< 008C: Message Buffer 0 WORD1 Register                              */
   } MB[16];                                    /**< 0080: (cluster: size=0x0100, 256)                                  */
   __I  uint32_t  RESERVED3[448];              
   __IO uint32_t  RXIMR[16];                    /**< 0880: Rx Individual Mask                                           */
} CAN_Type;

/**
 * @} */ /* End group CAN_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'CAN0' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

