podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV44F15.h
/**
* @addtogroup ENC_Register_Masks_GROUP ENC Register Masks
* @brief Register Masks for ENC
* @{
*/
/* ------- CTRL Bit Fields                          ------ */
#define ENC_CTRL_CMPIE_MASK                      (0x01UL << ENC_CTRL_CMPIE_SHIFT)                    /*!< ENC_CTRL: CMPIE Mask                    */
#define ENC_CTRL_CMPIE_SHIFT                     0                                                   /*!< ENC_CTRL: CMPIE Position                */
#define ENC_CTRL_CMPIRQ_MASK                     (0x01UL << ENC_CTRL_CMPIRQ_SHIFT)                   /*!< ENC_CTRL: CMPIRQ Mask                   */
#define ENC_CTRL_CMPIRQ_SHIFT                    1                                                   /*!< ENC_CTRL: CMPIRQ Position               */
#define ENC_CTRL_WDE_MASK                        (0x01UL << ENC_CTRL_WDE_SHIFT)                      /*!< ENC_CTRL: WDE Mask                      */
#define ENC_CTRL_WDE_SHIFT                       2                                                   /*!< ENC_CTRL: WDE Position                  */
#define ENC_CTRL_DIE_MASK                        (0x01UL << ENC_CTRL_DIE_SHIFT)                      /*!< ENC_CTRL: DIE Mask                      */
#define ENC_CTRL_DIE_SHIFT                       3                                                   /*!< ENC_CTRL: DIE Position                  */
#define ENC_CTRL_DIRQ_MASK                       (0x01UL << ENC_CTRL_DIRQ_SHIFT)                     /*!< ENC_CTRL: DIRQ Mask                     */
#define ENC_CTRL_DIRQ_SHIFT                      4                                                   /*!< ENC_CTRL: DIRQ Position                 */
#define ENC_CTRL_XNE_MASK                        (0x01UL << ENC_CTRL_XNE_SHIFT)                      /*!< ENC_CTRL: XNE Mask                      */
#define ENC_CTRL_XNE_SHIFT                       5                                                   /*!< ENC_CTRL: XNE Position                  */
#define ENC_CTRL_XIP_MASK                        (0x01UL << ENC_CTRL_XIP_SHIFT)                      /*!< ENC_CTRL: XIP Mask                      */
#define ENC_CTRL_XIP_SHIFT                       6                                                   /*!< ENC_CTRL: XIP Position                  */
#define ENC_CTRL_XIE_MASK                        (0x01UL << ENC_CTRL_XIE_SHIFT)                      /*!< ENC_CTRL: XIE Mask                      */
#define ENC_CTRL_XIE_SHIFT                       7                                                   /*!< ENC_CTRL: XIE Position                  */
#define ENC_CTRL_XIRQ_MASK                       (0x01UL << ENC_CTRL_XIRQ_SHIFT)                     /*!< ENC_CTRL: XIRQ Mask                     */
#define ENC_CTRL_XIRQ_SHIFT                      8                                                   /*!< ENC_CTRL: XIRQ Position                 */
#define ENC_CTRL_PH1_MASK                        (0x01UL << ENC_CTRL_PH1_SHIFT)                      /*!< ENC_CTRL: PH1 Mask                      */
#define ENC_CTRL_PH1_SHIFT                       9                                                   /*!< ENC_CTRL: PH1 Position                  */
#define ENC_CTRL_REV_MASK                        (0x01UL << ENC_CTRL_REV_SHIFT)                      /*!< ENC_CTRL: REV Mask                      */
#define ENC_CTRL_REV_SHIFT                       10                                                  /*!< ENC_CTRL: REV Position                  */
#define ENC_CTRL_SWIP_MASK                       (0x01UL << ENC_CTRL_SWIP_SHIFT)                     /*!< ENC_CTRL: SWIP Mask                     */
#define ENC_CTRL_SWIP_SHIFT                      11                                                  /*!< ENC_CTRL: SWIP Position                 */
#define ENC_CTRL_HNE_MASK                        (0x01UL << ENC_CTRL_HNE_SHIFT)                      /*!< ENC_CTRL: HNE Mask                      */
#define ENC_CTRL_HNE_SHIFT                       12                                                  /*!< ENC_CTRL: HNE Position                  */
#define ENC_CTRL_HIP_MASK                        (0x01UL << ENC_CTRL_HIP_SHIFT)                      /*!< ENC_CTRL: HIP Mask                      */
#define ENC_CTRL_HIP_SHIFT                       13                                                  /*!< ENC_CTRL: HIP Position                  */
#define ENC_CTRL_HIE_MASK                        (0x01UL << ENC_CTRL_HIE_SHIFT)                      /*!< ENC_CTRL: HIE Mask                      */
#define ENC_CTRL_HIE_SHIFT                       14                                                  /*!< ENC_CTRL: HIE Position                  */
#define ENC_CTRL_HIRQ_MASK                       (0x01UL << ENC_CTRL_HIRQ_SHIFT)                     /*!< ENC_CTRL: HIRQ Mask                     */
#define ENC_CTRL_HIRQ_SHIFT                      15                                                  /*!< ENC_CTRL: HIRQ Position                 */
/* ------- FILT Bit Fields                          ------ */
#define ENC_FILT_FILT_PER_MASK                   (0xFFUL << ENC_FILT_FILT_PER_SHIFT)                 /*!< ENC_FILT: FILT_PER Mask                 */
#define ENC_FILT_FILT_PER_SHIFT                  0                                                   /*!< ENC_FILT: FILT_PER Position             */
#define ENC_FILT_FILT_PER(x)                     (((uint16_t)(((uint16_t)(x))<<ENC_FILT_FILT_PER_SHIFT))&ENC_FILT_FILT_PER_MASK) /*!< ENC_FILT                                */
#define ENC_FILT_FILT_CNT_MASK                   (0x07UL << ENC_FILT_FILT_CNT_SHIFT)                 /*!< ENC_FILT: FILT_CNT Mask                 */
#define ENC_FILT_FILT_CNT_SHIFT                  8                                                   /*!< ENC_FILT: FILT_CNT Position             */
#define ENC_FILT_FILT_CNT(x)                     (((uint16_t)(((uint16_t)(x))<<ENC_FILT_FILT_CNT_SHIFT))&ENC_FILT_FILT_CNT_MASK) /*!< ENC_FILT                                */
/* ------- WTR Bit Fields                           ------ */
#define ENC_WTR_WDOG_MASK                        (0xFFFFUL << ENC_WTR_WDOG_SHIFT)                    /*!< ENC_WTR: WDOG Mask                      */
#define ENC_WTR_WDOG_SHIFT                       0                                                   /*!< ENC_WTR: WDOG Position                  */
#define ENC_WTR_WDOG(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_WTR_WDOG_SHIFT))&ENC_WTR_WDOG_MASK) /*!< ENC_WTR                                 */
/* ------- POSD Bit Fields                          ------ */
#define ENC_POSD_POSD_MASK                       (0xFFFFUL << ENC_POSD_POSD_SHIFT)                   /*!< ENC_POSD: POSD Mask                     */
#define ENC_POSD_POSD_SHIFT                      0                                                   /*!< ENC_POSD: POSD Position                 */
#define ENC_POSD_POSD(x)                         (((uint16_t)(((uint16_t)(x))<<ENC_POSD_POSD_SHIFT))&ENC_POSD_POSD_MASK) /*!< ENC_POSD                                */
/* ------- POSDH Bit Fields                         ------ */
#define ENC_POSDH_POSDH_MASK                     (0xFFFFUL << ENC_POSDH_POSDH_SHIFT)                 /*!< ENC_POSDH: POSDH Mask                   */
#define ENC_POSDH_POSDH_SHIFT                    0                                                   /*!< ENC_POSDH: POSDH Position               */
#define ENC_POSDH_POSDH(x)                       (((uint16_t)(((uint16_t)(x))<<ENC_POSDH_POSDH_SHIFT))&ENC_POSDH_POSDH_MASK) /*!< ENC_POSDH                               */
/* ------- REV Bit Fields                           ------ */
#define ENC_REV_REV_MASK                         (0xFFFFUL << ENC_REV_REV_SHIFT)                     /*!< ENC_REV: REV Mask                       */
#define ENC_REV_REV_SHIFT                        0                                                   /*!< ENC_REV: REV Position                   */
#define ENC_REV_REV(x)                           (((uint16_t)(((uint16_t)(x))<<ENC_REV_REV_SHIFT))&ENC_REV_REV_MASK) /*!< ENC_REV                                 */
/* ------- REVH Bit Fields                          ------ */
#define ENC_REVH_REVH_MASK                       (0xFFFFUL << ENC_REVH_REVH_SHIFT)                   /*!< ENC_REVH: REVH Mask                     */
#define ENC_REVH_REVH_SHIFT                      0                                                   /*!< ENC_REVH: REVH Position                 */
#define ENC_REVH_REVH(x)                         (((uint16_t)(((uint16_t)(x))<<ENC_REVH_REVH_SHIFT))&ENC_REVH_REVH_MASK) /*!< ENC_REVH                                */
/* ------- UPOS Bit Fields                          ------ */
#define ENC_UPOS_POS_MASK                        (0xFFFFUL << ENC_UPOS_POS_SHIFT)                    /*!< ENC_UPOS: POS Mask                      */
#define ENC_UPOS_POS_SHIFT                       0                                                   /*!< ENC_UPOS: POS Position                  */
#define ENC_UPOS_POS(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_UPOS_POS_SHIFT))&ENC_UPOS_POS_MASK) /*!< ENC_UPOS                                */
/* ------- LPOS Bit Fields                          ------ */
#define ENC_LPOS_POS_MASK                        (0xFFFFUL << ENC_LPOS_POS_SHIFT)                    /*!< ENC_LPOS: POS Mask                      */
#define ENC_LPOS_POS_SHIFT                       0                                                   /*!< ENC_LPOS: POS Position                  */
#define ENC_LPOS_POS(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_LPOS_POS_SHIFT))&ENC_LPOS_POS_MASK) /*!< ENC_LPOS                                */
/* ------- UPOSH Bit Fields                         ------ */
#define ENC_UPOSH_POSH_MASK                      (0xFFFFUL << ENC_UPOSH_POSH_SHIFT)                  /*!< ENC_UPOSH: POSH Mask                    */
#define ENC_UPOSH_POSH_SHIFT                     0                                                   /*!< ENC_UPOSH: POSH Position                */
#define ENC_UPOSH_POSH(x)                        (((uint16_t)(((uint16_t)(x))<<ENC_UPOSH_POSH_SHIFT))&ENC_UPOSH_POSH_MASK) /*!< ENC_UPOSH                               */
/* ------- LPOSH Bit Fields                         ------ */
#define ENC_LPOSH_POSH_MASK                      (0xFFFFUL << ENC_LPOSH_POSH_SHIFT)                  /*!< ENC_LPOSH: POSH Mask                    */
#define ENC_LPOSH_POSH_SHIFT                     0                                                   /*!< ENC_LPOSH: POSH Position                */
#define ENC_LPOSH_POSH(x)                        (((uint16_t)(((uint16_t)(x))<<ENC_LPOSH_POSH_SHIFT))&ENC_LPOSH_POSH_MASK) /*!< ENC_LPOSH                               */
/* ------- UINIT Bit Fields                         ------ */
#define ENC_UINIT_INIT_MASK                      (0xFFFFUL << ENC_UINIT_INIT_SHIFT)                  /*!< ENC_UINIT: INIT Mask                    */
#define ENC_UINIT_INIT_SHIFT                     0                                                   /*!< ENC_UINIT: INIT Position                */
#define ENC_UINIT_INIT(x)                        (((uint16_t)(((uint16_t)(x))<<ENC_UINIT_INIT_SHIFT))&ENC_UINIT_INIT_MASK) /*!< ENC_UINIT                               */
/* ------- LINIT Bit Fields                         ------ */
#define ENC_LINIT_INIT_MASK                      (0xFFFFUL << ENC_LINIT_INIT_SHIFT)                  /*!< ENC_LINIT: INIT Mask                    */
#define ENC_LINIT_INIT_SHIFT                     0                                                   /*!< ENC_LINIT: INIT Position                */
#define ENC_LINIT_INIT(x)                        (((uint16_t)(((uint16_t)(x))<<ENC_LINIT_INIT_SHIFT))&ENC_LINIT_INIT_MASK) /*!< ENC_LINIT                               */
/* ------- IMR Bit Fields                           ------ */
#define ENC_IMR_HOME_MASK                        (0x01UL << ENC_IMR_HOME_SHIFT)                      /*!< ENC_IMR: HOME Mask                      */
#define ENC_IMR_HOME_SHIFT                       0                                                   /*!< ENC_IMR: HOME Position                  */
#define ENC_IMR_INDEX_MASK                       (0x01UL << ENC_IMR_INDEX_SHIFT)                     /*!< ENC_IMR: INDEX Mask                     */
#define ENC_IMR_INDEX_SHIFT                      1                                                   /*!< ENC_IMR: INDEX Position                 */
#define ENC_IMR_PHB_MASK                         (0x01UL << ENC_IMR_PHB_SHIFT)                       /*!< ENC_IMR: PHB Mask                       */
#define ENC_IMR_PHB_SHIFT                        2                                                   /*!< ENC_IMR: PHB Position                   */
#define ENC_IMR_PHA_MASK                         (0x01UL << ENC_IMR_PHA_SHIFT)                       /*!< ENC_IMR: PHA Mask                       */
#define ENC_IMR_PHA_SHIFT                        3                                                   /*!< ENC_IMR: PHA Position                   */
#define ENC_IMR_FHOM_MASK                        (0x01UL << ENC_IMR_FHOM_SHIFT)                      /*!< ENC_IMR: FHOM Mask                      */
#define ENC_IMR_FHOM_SHIFT                       4                                                   /*!< ENC_IMR: FHOM Position                  */
#define ENC_IMR_FIND_MASK                        (0x01UL << ENC_IMR_FIND_SHIFT)                      /*!< ENC_IMR: FIND Mask                      */
#define ENC_IMR_FIND_SHIFT                       5                                                   /*!< ENC_IMR: FIND Position                  */
#define ENC_IMR_FPHB_MASK                        (0x01UL << ENC_IMR_FPHB_SHIFT)                      /*!< ENC_IMR: FPHB Mask                      */
#define ENC_IMR_FPHB_SHIFT                       6                                                   /*!< ENC_IMR: FPHB Position                  */
#define ENC_IMR_FPHA_MASK                        (0x01UL << ENC_IMR_FPHA_SHIFT)                      /*!< ENC_IMR: FPHA Mask                      */
#define ENC_IMR_FPHA_SHIFT                       7                                                   /*!< ENC_IMR: FPHA Position                  */
/* ------- TST Bit Fields                           ------ */
#define ENC_TST_TEST_COUNT_MASK                  (0xFFUL << ENC_TST_TEST_COUNT_SHIFT)                /*!< ENC_TST: TEST_COUNT Mask                */
#define ENC_TST_TEST_COUNT_SHIFT                 0                                                   /*!< ENC_TST: TEST_COUNT Position            */
#define ENC_TST_TEST_COUNT(x)                    (((uint16_t)(((uint16_t)(x))<<ENC_TST_TEST_COUNT_SHIFT))&ENC_TST_TEST_COUNT_MASK) /*!< ENC_TST                                 */
#define ENC_TST_TEST_PERIOD_MASK                 (0x1FUL << ENC_TST_TEST_PERIOD_SHIFT)               /*!< ENC_TST: TEST_PERIOD Mask               */
#define ENC_TST_TEST_PERIOD_SHIFT                8                                                   /*!< ENC_TST: TEST_PERIOD Position           */
#define ENC_TST_TEST_PERIOD(x)                   (((uint16_t)(((uint16_t)(x))<<ENC_TST_TEST_PERIOD_SHIFT))&ENC_TST_TEST_PERIOD_MASK) /*!< ENC_TST                                 */
#define ENC_TST_QDN_MASK                         (0x01UL << ENC_TST_QDN_SHIFT)                       /*!< ENC_TST: QDN Mask                       */
#define ENC_TST_QDN_SHIFT                        13                                                  /*!< ENC_TST: QDN Position                   */
#define ENC_TST_TCE_MASK                         (0x01UL << ENC_TST_TCE_SHIFT)                       /*!< ENC_TST: TCE Mask                       */
#define ENC_TST_TCE_SHIFT                        14                                                  /*!< ENC_TST: TCE Position                   */
#define ENC_TST_TEN_MASK                         (0x01UL << ENC_TST_TEN_SHIFT)                       /*!< ENC_TST: TEN Mask                       */
#define ENC_TST_TEN_SHIFT                        15                                                  /*!< ENC_TST: TEN Position                   */
/* ------- CTRL2 Bit Fields                         ------ */
#define ENC_CTRL2_UPDHLD_MASK                    (0x01UL << ENC_CTRL2_UPDHLD_SHIFT)                  /*!< ENC_CTRL2: UPDHLD Mask                  */
#define ENC_CTRL2_UPDHLD_SHIFT                   0                                                   /*!< ENC_CTRL2: UPDHLD Position              */
#define ENC_CTRL2_UPDPOS_MASK                    (0x01UL << ENC_CTRL2_UPDPOS_SHIFT)                  /*!< ENC_CTRL2: UPDPOS Mask                  */
#define ENC_CTRL2_UPDPOS_SHIFT                   1                                                   /*!< ENC_CTRL2: UPDPOS Position              */
#define ENC_CTRL2_MOD_MASK                       (0x01UL << ENC_CTRL2_MOD_SHIFT)                     /*!< ENC_CTRL2: MOD Mask                     */
#define ENC_CTRL2_MOD_SHIFT                      2                                                   /*!< ENC_CTRL2: MOD Position                 */
#define ENC_CTRL2_DIR_MASK                       (0x01UL << ENC_CTRL2_DIR_SHIFT)                     /*!< ENC_CTRL2: DIR Mask                     */
#define ENC_CTRL2_DIR_SHIFT                      3                                                   /*!< ENC_CTRL2: DIR Position                 */
#define ENC_CTRL2_RUIE_MASK                      (0x01UL << ENC_CTRL2_RUIE_SHIFT)                    /*!< ENC_CTRL2: RUIE Mask                    */
#define ENC_CTRL2_RUIE_SHIFT                     4                                                   /*!< ENC_CTRL2: RUIE Position                */
#define ENC_CTRL2_RUIRQ_MASK                     (0x01UL << ENC_CTRL2_RUIRQ_SHIFT)                   /*!< ENC_CTRL2: RUIRQ Mask                   */
#define ENC_CTRL2_RUIRQ_SHIFT                    5                                                   /*!< ENC_CTRL2: RUIRQ Position               */
#define ENC_CTRL2_ROIE_MASK                      (0x01UL << ENC_CTRL2_ROIE_SHIFT)                    /*!< ENC_CTRL2: ROIE Mask                    */
#define ENC_CTRL2_ROIE_SHIFT                     6                                                   /*!< ENC_CTRL2: ROIE Position                */
#define ENC_CTRL2_ROIRQ_MASK                     (0x01UL << ENC_CTRL2_ROIRQ_SHIFT)                   /*!< ENC_CTRL2: ROIRQ Mask                   */
#define ENC_CTRL2_ROIRQ_SHIFT                    7                                                   /*!< ENC_CTRL2: ROIRQ Position               */
#define ENC_CTRL2_REVMOD_MASK                    (0x01UL << ENC_CTRL2_REVMOD_SHIFT)                  /*!< ENC_CTRL2: REVMOD Mask                  */
#define ENC_CTRL2_REVMOD_SHIFT                   8                                                   /*!< ENC_CTRL2: REVMOD Position              */
#define ENC_CTRL2_OUTCTL_MASK                    (0x01UL << ENC_CTRL2_OUTCTL_SHIFT)                  /*!< ENC_CTRL2: OUTCTL Mask                  */
#define ENC_CTRL2_OUTCTL_SHIFT                   9                                                   /*!< ENC_CTRL2: OUTCTL Position              */
#define ENC_CTRL2_SABIE_MASK                     (0x01UL << ENC_CTRL2_SABIE_SHIFT)                   /*!< ENC_CTRL2: SABIE Mask                   */
#define ENC_CTRL2_SABIE_SHIFT                    10                                                  /*!< ENC_CTRL2: SABIE Position               */
#define ENC_CTRL2_SABIRQ_MASK                    (0x01UL << ENC_CTRL2_SABIRQ_SHIFT)                  /*!< ENC_CTRL2: SABIRQ Mask                  */
#define ENC_CTRL2_SABIRQ_SHIFT                   11                                                  /*!< ENC_CTRL2: SABIRQ Position              */
/* ------- UMOD Bit Fields                          ------ */
#define ENC_UMOD_MOD_MASK                        (0xFFFFUL << ENC_UMOD_MOD_SHIFT)                    /*!< ENC_UMOD: MOD Mask                      */
#define ENC_UMOD_MOD_SHIFT                       0                                                   /*!< ENC_UMOD: MOD Position                  */
#define ENC_UMOD_MOD(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_UMOD_MOD_SHIFT))&ENC_UMOD_MOD_MASK) /*!< ENC_UMOD                                */
/* ------- LMOD Bit Fields                          ------ */
#define ENC_LMOD_MOD_MASK                        (0xFFFFUL << ENC_LMOD_MOD_SHIFT)                    /*!< ENC_LMOD: MOD Mask                      */
#define ENC_LMOD_MOD_SHIFT                       0                                                   /*!< ENC_LMOD: MOD Position                  */
#define ENC_LMOD_MOD(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_LMOD_MOD_SHIFT))&ENC_LMOD_MOD_MASK) /*!< ENC_LMOD                                */
/* ------- UCOMP Bit Fields                         ------ */
#define ENC_UCOMP_COMP_MASK                      (0xFFFFUL << ENC_UCOMP_COMP_SHIFT)                  /*!< ENC_UCOMP: COMP Mask                    */
#define ENC_UCOMP_COMP_SHIFT                     0                                                   /*!< ENC_UCOMP: COMP Position                */
#define ENC_UCOMP_COMP(x)                        (((uint16_t)(((uint16_t)(x))<<ENC_UCOMP_COMP_SHIFT))&ENC_UCOMP_COMP_MASK) /*!< ENC_UCOMP                               */
/* ------- LCOMP Bit Fields                         ------ */
#define ENC_LCOMP_COMP_MASK                      (0xFFFFUL << ENC_LCOMP_COMP_SHIFT)                  /*!< ENC_LCOMP: COMP Mask                    */
#define ENC_LCOMP_COMP_SHIFT                     0                                                   /*!< ENC_LCOMP: COMP Position                */
#define ENC_LCOMP_COMP(x)                        (((uint16_t)(((uint16_t)(x))<<ENC_LCOMP_COMP_SHIFT))&ENC_LCOMP_COMP_MASK) /*!< ENC_LCOMP                               */
/**
 * @} */ /* End group ENC_Register_Masks_GROUP 
 */

/* ENC - Peripheral instance base addresses */
#define ENC_BasePtr                    0x40055000UL //!< Peripheral base address
#define ENC                            ((ENC_Type *) ENC_BasePtr) //!< Freescale base pointer
#define ENC_BASE_PTR                   (ENC) //!< Freescale style base pointer
/**
 * @} */ /* End group ENC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup EWM_Peripheral_access_layer_GROUP EWM Peripheral Access Layer
* @brief C Struct for EWM
* @{
*/

/* ================================================================================ */
/* ================           EWM (file:EWM_2)                     ================ */
/* ================================================================================ */

/**
 * @brief External Watchdog Monitor
 */
/**
* @addtogroup EWM_structs_GROUP EWM struct
* @brief Struct for EWM
* @{
*/
typedef struct {                                /*       EWM Structure                                                */
   __IO uint8_t   CTRL;                         /**< 0000: Control Register                                             */
   __O  uint8_t   SERV;                         /**< 0001: Service Register                                             */
   __IO uint8_t   CMPL;                         /**< 0002: Compare Low Register                                         */
   __IO uint8_t   CMPH;                         /**< 0003: Compare High Register                                        */
} EWM_Type;

/**
 * @} */ /* End group EWM_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'EWM' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

