podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV44F15.h
#define LLWU_PF3_WUF19_MASK                      (0x01UL << LLWU_PF3_WUF19_SHIFT)                    /*!< LLWU_PF3: WUF19 Mask                    */
#define LLWU_PF3_WUF19_SHIFT                     3                                                   /*!< LLWU_PF3: WUF19 Position                */
#define LLWU_PF3_WUF20_MASK                      (0x01UL << LLWU_PF3_WUF20_SHIFT)                    /*!< LLWU_PF3: WUF20 Mask                    */
#define LLWU_PF3_WUF20_SHIFT                     4                                                   /*!< LLWU_PF3: WUF20 Position                */
#define LLWU_PF3_WUF21_MASK                      (0x01UL << LLWU_PF3_WUF21_SHIFT)                    /*!< LLWU_PF3: WUF21 Mask                    */
#define LLWU_PF3_WUF21_SHIFT                     5                                                   /*!< LLWU_PF3: WUF21 Position                */
#define LLWU_PF3_WUF22_MASK                      (0x01UL << LLWU_PF3_WUF22_SHIFT)                    /*!< LLWU_PF3: WUF22 Mask                    */
#define LLWU_PF3_WUF22_SHIFT                     6                                                   /*!< LLWU_PF3: WUF22 Position                */
#define LLWU_PF3_WUF23_MASK                      (0x01UL << LLWU_PF3_WUF23_SHIFT)                    /*!< LLWU_PF3: WUF23 Mask                    */
#define LLWU_PF3_WUF23_SHIFT                     7                                                   /*!< LLWU_PF3: WUF23 Position                */
/* ------- PF4 Bit Fields                           ------ */
#define LLWU_PF4_WUF24_MASK                      (0x01UL << LLWU_PF4_WUF24_SHIFT)                    /*!< LLWU_PF4: WUF24 Mask                    */
#define LLWU_PF4_WUF24_SHIFT                     0                                                   /*!< LLWU_PF4: WUF24 Position                */
#define LLWU_PF4_WUF25_MASK                      (0x01UL << LLWU_PF4_WUF25_SHIFT)                    /*!< LLWU_PF4: WUF25 Mask                    */
#define LLWU_PF4_WUF25_SHIFT                     1                                                   /*!< LLWU_PF4: WUF25 Position                */
#define LLWU_PF4_WUF26_MASK                      (0x01UL << LLWU_PF4_WUF26_SHIFT)                    /*!< LLWU_PF4: WUF26 Mask                    */
#define LLWU_PF4_WUF26_SHIFT                     2                                                   /*!< LLWU_PF4: WUF26 Position                */
#define LLWU_PF4_WUF27_MASK                      (0x01UL << LLWU_PF4_WUF27_SHIFT)                    /*!< LLWU_PF4: WUF27 Mask                    */
#define LLWU_PF4_WUF27_SHIFT                     3                                                   /*!< LLWU_PF4: WUF27 Position                */
#define LLWU_PF4_WUF28_MASK                      (0x01UL << LLWU_PF4_WUF28_SHIFT)                    /*!< LLWU_PF4: WUF28 Mask                    */
#define LLWU_PF4_WUF28_SHIFT                     4                                                   /*!< LLWU_PF4: WUF28 Position                */
#define LLWU_PF4_WUF29_MASK                      (0x01UL << LLWU_PF4_WUF29_SHIFT)                    /*!< LLWU_PF4: WUF29 Mask                    */
#define LLWU_PF4_WUF29_SHIFT                     5                                                   /*!< LLWU_PF4: WUF29 Position                */
#define LLWU_PF4_WUF30_MASK                      (0x01UL << LLWU_PF4_WUF30_SHIFT)                    /*!< LLWU_PF4: WUF30 Mask                    */
#define LLWU_PF4_WUF30_SHIFT                     6                                                   /*!< LLWU_PF4: WUF30 Position                */
#define LLWU_PF4_WUF31_MASK                      (0x01UL << LLWU_PF4_WUF31_SHIFT)                    /*!< LLWU_PF4: WUF31 Mask                    */
#define LLWU_PF4_WUF31_SHIFT                     7                                                   /*!< LLWU_PF4: WUF31 Position                */
/* ------- MF5 Bit Fields                           ------ */
#define LLWU_MF5_MWUF0_MASK                      (0x01UL << LLWU_MF5_MWUF0_SHIFT)                    /*!< LLWU_MF5: MWUF0 Mask                    */
#define LLWU_MF5_MWUF0_SHIFT                     0                                                   /*!< LLWU_MF5: MWUF0 Position                */
#define LLWU_MF5_MWUF1_MASK                      (0x01UL << LLWU_MF5_MWUF1_SHIFT)                    /*!< LLWU_MF5: MWUF1 Mask                    */
#define LLWU_MF5_MWUF1_SHIFT                     1                                                   /*!< LLWU_MF5: MWUF1 Position                */
#define LLWU_MF5_MWUF2_MASK                      (0x01UL << LLWU_MF5_MWUF2_SHIFT)                    /*!< LLWU_MF5: MWUF2 Mask                    */
#define LLWU_MF5_MWUF2_SHIFT                     2                                                   /*!< LLWU_MF5: MWUF2 Position                */
#define LLWU_MF5_MWUF3_MASK                      (0x01UL << LLWU_MF5_MWUF3_SHIFT)                    /*!< LLWU_MF5: MWUF3 Mask                    */
#define LLWU_MF5_MWUF3_SHIFT                     3                                                   /*!< LLWU_MF5: MWUF3 Position                */
#define LLWU_MF5_MWUF4_MASK                      (0x01UL << LLWU_MF5_MWUF4_SHIFT)                    /*!< LLWU_MF5: MWUF4 Mask                    */
#define LLWU_MF5_MWUF4_SHIFT                     4                                                   /*!< LLWU_MF5: MWUF4 Position                */
#define LLWU_MF5_MWUF5_MASK                      (0x01UL << LLWU_MF5_MWUF5_SHIFT)                    /*!< LLWU_MF5: MWUF5 Mask                    */
#define LLWU_MF5_MWUF5_SHIFT                     5                                                   /*!< LLWU_MF5: MWUF5 Position                */
#define LLWU_MF5_MWUF6_MASK                      (0x01UL << LLWU_MF5_MWUF6_SHIFT)                    /*!< LLWU_MF5: MWUF6 Mask                    */
#define LLWU_MF5_MWUF6_SHIFT                     6                                                   /*!< LLWU_MF5: MWUF6 Position                */
#define LLWU_MF5_MWUF7_MASK                      (0x01UL << LLWU_MF5_MWUF7_SHIFT)                    /*!< LLWU_MF5: MWUF7 Mask                    */
#define LLWU_MF5_MWUF7_SHIFT                     7                                                   /*!< LLWU_MF5: MWUF7 Position                */
/* ------- FILT Bit Fields                          ------ */
#define LLWU_FILT_FILTSEL_MASK                   (0x1FUL << LLWU_FILT_FILTSEL_SHIFT)                 /*!< LLWU_FILT: FILTSEL Mask                 */
#define LLWU_FILT_FILTSEL_SHIFT                  0                                                   /*!< LLWU_FILT: FILTSEL Position             */
#define LLWU_FILT_FILTSEL(x)                     (((uint8_t)(((uint8_t)(x))<<LLWU_FILT_FILTSEL_SHIFT))&LLWU_FILT_FILTSEL_MASK) /*!< LLWU_FILT                               */
#define LLWU_FILT_FILTE_MASK                     (0x03UL << LLWU_FILT_FILTE_SHIFT)                   /*!< LLWU_FILT: FILTE Mask                   */
#define LLWU_FILT_FILTE_SHIFT                    5                                                   /*!< LLWU_FILT: FILTE Position               */
#define LLWU_FILT_FILTE(x)                       (((uint8_t)(((uint8_t)(x))<<LLWU_FILT_FILTE_SHIFT))&LLWU_FILT_FILTE_MASK) /*!< LLWU_FILT                               */
#define LLWU_FILT_FILTF_MASK                     (0x01UL << LLWU_FILT_FILTF_SHIFT)                   /*!< LLWU_FILT: FILTF Mask                   */
#define LLWU_FILT_FILTF_SHIFT                    7                                                   /*!< LLWU_FILT: FILTF Position               */
/**
 * @} */ /* End group LLWU_Register_Masks_GROUP 
 */

/* LLWU - Peripheral instance base addresses */
#define LLWU_BasePtr                   0x4007C000UL //!< Peripheral base address
#define LLWU                           ((LLWU_Type *) LLWU_BasePtr) //!< Freescale base pointer
#define LLWU_BASE_PTR                  (LLWU) //!< Freescale style base pointer
/**
 * @} */ /* End group LLWU_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup LPTMR_Peripheral_access_layer_GROUP LPTMR Peripheral Access Layer
* @brief C Struct for LPTMR
* @{
*/

/* ================================================================================ */
/* ================           LPTMR0 (file:LPTMR0_0)               ================ */
/* ================================================================================ */

/**
 * @brief Low Power Timer
 */
/**
* @addtogroup LPTMR_structs_GROUP LPTMR struct
* @brief Struct for LPTMR
* @{
*/
typedef struct {                                /*       LPTMR0 Structure                                             */
   __IO uint32_t  CSR;                          /**< 0000: Control Status Register                                      */
   __IO uint32_t  PSR;                          /**< 0004: Prescale Register                                            */
   __IO uint32_t  CMR;                          /**< 0008: Compare Register                                             */
   __IO uint32_t  CNR;                          /**< 000C: Counter Register                                             */
} LPTMR_Type;

/**
 * @} */ /* End group LPTMR_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'LPTMR0' Position & Mask macros                      ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup LPTMR_Register_Masks_GROUP LPTMR Register Masks
* @brief Register Masks for LPTMR
* @{
*/
/* ------- CSR Bit Fields                           ------ */
#define LPTMR_CSR_TEN_MASK                       (0x01UL << LPTMR_CSR_TEN_SHIFT)                     /*!< LPTMR0_CSR: TEN Mask                    */
#define LPTMR_CSR_TEN_SHIFT                      0                                                   /*!< LPTMR0_CSR: TEN Position                */
#define LPTMR_CSR_TMS_MASK                       (0x01UL << LPTMR_CSR_TMS_SHIFT)                     /*!< LPTMR0_CSR: TMS Mask                    */
#define LPTMR_CSR_TMS_SHIFT                      1                                                   /*!< LPTMR0_CSR: TMS Position                */
#define LPTMR_CSR_TFC_MASK                       (0x01UL << LPTMR_CSR_TFC_SHIFT)                     /*!< LPTMR0_CSR: TFC Mask                    */
#define LPTMR_CSR_TFC_SHIFT                      2                                                   /*!< LPTMR0_CSR: TFC Position                */
#define LPTMR_CSR_TPP_MASK                       (0x01UL << LPTMR_CSR_TPP_SHIFT)                     /*!< LPTMR0_CSR: TPP Mask                    */
#define LPTMR_CSR_TPP_SHIFT                      3                                                   /*!< LPTMR0_CSR: TPP Position                */
#define LPTMR_CSR_TPS_MASK                       (0x03UL << LPTMR_CSR_TPS_SHIFT)                     /*!< LPTMR0_CSR: TPS Mask                    */
#define LPTMR_CSR_TPS_SHIFT                      4                                                   /*!< LPTMR0_CSR: TPS Position                */
#define LPTMR_CSR_TPS(x)                         (((uint32_t)(((uint32_t)(x))<<LPTMR_CSR_TPS_SHIFT))&LPTMR_CSR_TPS_MASK) /*!< LPTMR0_CSR                              */
#define LPTMR_CSR_TIE_MASK                       (0x01UL << LPTMR_CSR_TIE_SHIFT)                     /*!< LPTMR0_CSR: TIE Mask                    */
#define LPTMR_CSR_TIE_SHIFT                      6                                                   /*!< LPTMR0_CSR: TIE Position                */
#define LPTMR_CSR_TCF_MASK                       (0x01UL << LPTMR_CSR_TCF_SHIFT)                     /*!< LPTMR0_CSR: TCF Mask                    */
#define LPTMR_CSR_TCF_SHIFT                      7                                                   /*!< LPTMR0_CSR: TCF Position                */
/* ------- PSR Bit Fields                           ------ */
#define LPTMR_PSR_PCS_MASK                       (0x03UL << LPTMR_PSR_PCS_SHIFT)                     /*!< LPTMR0_PSR: PCS Mask                    */
#define LPTMR_PSR_PCS_SHIFT                      0                                                   /*!< LPTMR0_PSR: PCS Position                */
#define LPTMR_PSR_PCS(x)                         (((uint32_t)(((uint32_t)(x))<<LPTMR_PSR_PCS_SHIFT))&LPTMR_PSR_PCS_MASK) /*!< LPTMR0_PSR                              */
#define LPTMR_PSR_PBYP_MASK                      (0x01UL << LPTMR_PSR_PBYP_SHIFT)                    /*!< LPTMR0_PSR: PBYP Mask                   */
#define LPTMR_PSR_PBYP_SHIFT                     2                                                   /*!< LPTMR0_PSR: PBYP Position               */
#define LPTMR_PSR_PRESCALE_MASK                  (0x0FUL << LPTMR_PSR_PRESCALE_SHIFT)                /*!< LPTMR0_PSR: PRESCALE Mask               */
#define LPTMR_PSR_PRESCALE_SHIFT                 3                                                   /*!< LPTMR0_PSR: PRESCALE Position           */
#define LPTMR_PSR_PRESCALE(x)                    (((uint32_t)(((uint32_t)(x))<<LPTMR_PSR_PRESCALE_SHIFT))&LPTMR_PSR_PRESCALE_MASK) /*!< LPTMR0_PSR                              */
/* ------- CMR Bit Fields                           ------ */
#define LPTMR_CMR_COMPARE_MASK                   (0xFFFFUL << LPTMR_CMR_COMPARE_SHIFT)               /*!< LPTMR0_CMR: COMPARE Mask                */
#define LPTMR_CMR_COMPARE_SHIFT                  0                                                   /*!< LPTMR0_CMR: COMPARE Position            */
#define LPTMR_CMR_COMPARE(x)                     (((uint32_t)(((uint32_t)(x))<<LPTMR_CMR_COMPARE_SHIFT))&LPTMR_CMR_COMPARE_MASK) /*!< LPTMR0_CMR                              */
/* ------- CNR Bit Fields                           ------ */
#define LPTMR_CNR_COUNTER_MASK                   (0xFFFFUL << LPTMR_CNR_COUNTER_SHIFT)               /*!< LPTMR0_CNR: COUNTER Mask                */
#define LPTMR_CNR_COUNTER_SHIFT                  0                                                   /*!< LPTMR0_CNR: COUNTER Position            */
#define LPTMR_CNR_COUNTER(x)                     (((uint32_t)(((uint32_t)(x))<<LPTMR_CNR_COUNTER_SHIFT))&LPTMR_CNR_COUNTER_MASK) /*!< LPTMR0_CNR                              */
/**
 * @} */ /* End group LPTMR_Register_Masks_GROUP 
 */

/* LPTMR0 - Peripheral instance base addresses */
#define LPTMR0_BasePtr                 0x40040000UL //!< Peripheral base address
#define LPTMR0                         ((LPTMR_Type *) LPTMR0_BasePtr) //!< Freescale base pointer
#define LPTMR0_BASE_PTR                (LPTMR0) //!< Freescale style base pointer
/**
 * @} */ /* End group LPTMR_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup MCG_Peripheral_access_layer_GROUP MCG Peripheral Access Layer
* @brief C Struct for MCG
* @{
*/

/* ================================================================================ */
/* ================           MCG (file:MCG_MKV40F15)              ================ */
/* ================================================================================ */

/**
 * @brief Multipurpose Clock Generator module
 */
/**
* @addtogroup MCG_structs_GROUP MCG struct
* @brief Struct for MCG
* @{
*/
typedef struct {                                /*       MCG Structure                                                */
   __IO uint8_t   C1;                           /**< 0000: Control 1 Register                                           */
   __IO uint8_t   C2;                           /**< 0001: Control 2 Register                                           */
   __IO uint8_t   C3;                           /**< 0002: Control 3 Register                                           */
   __IO uint8_t   C4;                           /**< 0003: Control 4 Register                                           */
   __IO uint8_t   C5;                           /**< 0004: Control 5 Register                                           */
   __IO uint8_t   C6;                           /**< 0005: Control 6 Register                                           */
   __IO uint8_t   S;                            /**< 0006: Status Register                                              */
   __I  uint8_t   RESERVED0;                   
   __IO uint8_t   SC;                           /**< 0008: Status and Control Register                                  */
   __I  uint8_t   RESERVED1;                   
   __IO uint8_t   ATCVH;                        /**< 000A: ATM Compare Value High                                       */
   __IO uint8_t   ATCVL;                        /**< 000B: ATM Compare Value Low                                        */
   __I  uint8_t   RESERVED2;                   
   __IO uint8_t   C8;                           /**< 000D: Control 8 Register                                           */
} MCG_Type;

/**
 * @} */ /* End group MCG_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'MCG' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

