podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV44F15.h
/* ================================================================================ */
/* ================           PWMA (file:PWMA_0)                   ================ */
/* ================================================================================ */

/**
 * @brief Pulse Width Modulator with nano edge placement
 */
/**
* @addtogroup PWMA_structs_GROUP PWMA struct
* @brief Struct for PWMA
* @{
*/
typedef struct {                                /*       PWMA Structure                                               */
   __I  uint16_t  SM0CNT;                       /**< 0000: Counter Register                                             */
   __IO uint16_t  SM0INIT;                      /**< 0002: Initial Count Register                                       */
   __IO uint16_t  SM0CTRL2;                     /**< 0004: Control 2 Register                                           */
   __IO uint16_t  SM0CTRL;                      /**< 0006: Control Register                                             */
   __I  uint16_t  RESERVED0;                   
   __IO uint16_t  SM0VAL0;                      /**< 000A: Value Register 0                                             */
   __IO uint16_t  SM0FRACVAL1;                  /**< 000C: Fractional Value Register 1                                  */
   __IO uint16_t  SM0VAL1;                      /**< 000E: Value Register 1                                             */
   __IO uint16_t  SM0FRACVAL2;                  /**< 0010: Fractional Value Register 2                                  */
   __IO uint16_t  SM0VAL2;                      /**< 0012: Value Register 2                                             */
   __IO uint16_t  SM0FRACVAL3;                  /**< 0014: Fractional Value Register 3                                  */
   __IO uint16_t  SM0VAL3;                      /**< 0016: Value Register 3                                             */
   __IO uint16_t  SM0FRACVAL4;                  /**< 0018: Fractional Value Register 4                                  */
   __IO uint16_t  SM0VAL4;                      /**< 001A: Value Register 4                                             */
   __IO uint16_t  SM0FRACVAL5;                  /**< 001C: Fractional Value Register 5                                  */
   __IO uint16_t  SM0VAL5;                      /**< 001E: Value Register 5                                             */
   __IO uint16_t  SM0FRCTRL;                    /**< 0020: Fractional Control Register                                  */
   __IO uint16_t  SM0OCTRL;                     /**< 0022: Output Control Register                                      */
   __IO uint16_t  SM0STS;                       /**< 0024: Status Register                                              */
   __IO uint16_t  SM0INTEN;                     /**< 0026: Interrupt Enable Register                                    */
   __IO uint16_t  SM0DMAEN;                     /**< 0028: DMA Enable Register                                          */
   __IO uint16_t  SM0TCTRL;                     /**< 002A: Output Trigger Control Register                              */
   __IO uint16_t  SM0DISMAP0;                   /**< 002C: Fault Disable Mapping Register 0                             */
   __I  uint16_t  RESERVED1;                   
   __IO uint16_t  SM0DTCNT[2];                  /**< 0030: Deadtime Count Register                                      */
   __IO uint16_t  SM0CAPTCTRLA;                 /**< 0034: Capture Control A Register                                   */
   __IO uint16_t  SM0CAPTCOMPA;                 /**< 0036: Capture Compare A Register                                   */
   __IO uint16_t  SM0CAPTCTRLB;                 /**< 0038: Capture Control B Register                                   */
   __IO uint16_t  SM0CAPTCOMPB;                 /**< 003A: Capture Compare B Register                                   */
   __IO uint16_t  SM0CAPTCTRLX;                 /**< 003C: Capture Control X Register                                   */
   __IO uint16_t  SM0CAPTCOMPX;                 /**< 003E: Capture Compare X Register                                   */
   __I  uint16_t  SM0CVAL0;                     /**< 0040: Capture Value 0 Register                                     */
   __I  uint16_t  SM0CVAL0CYC;                  /**< 0042: Capture Value 0 Cycle Register                               */
   __I  uint16_t  SM0CVAL1;                     /**< 0044: Capture Value 1 Register                                     */
   __I  uint16_t  SM0CVAL1CYC;                  /**< 0046: Capture Value 1 Cycle Register                               */
   __I  uint16_t  SM0CVAL2;                     /**< 0048: Capture Value 2 Register                                     */
   __I  uint16_t  SM0CVAL2CYC;                  /**< 004A: Capture Value 2 Cycle Register                               */
   __I  uint16_t  SM0CVAL3;                     /**< 004C: Capture Value 3 Register                                     */
   __I  uint16_t  SM0CVAL3CYC;                  /**< 004E: Capture Value 3 Cycle Register                               */
   __I  uint16_t  SM0CVAL4;                     /**< 0050: Capture Value 4 Register                                     */
   __I  uint16_t  SM0CVAL4CYC;                  /**< 0052: Capture Value 4 Cycle Register                               */
   __I  uint16_t  SM0CVAL5;                     /**< 0054: Capture Value 5 Register                                     */
   __I  uint16_t  SM0CVAL5CYC;                  /**< 0056: Capture Value 5 Cycle Register                               */
   __I  uint32_t  RESERVED2[2];                
   __I  uint16_t  SM1CNT;                       /**< 0060: Counter Register                                             */
   __IO uint16_t  SM1INIT;                      /**< 0062: Initial Count Register                                       */
   __IO uint16_t  SM1CTRL2;                     /**< 0064: Control 2 Register                                           */
   __IO uint16_t  SM1CTRL;                      /**< 0066: Control Register                                             */
   __I  uint16_t  RESERVED3;                   
   __IO uint16_t  SM1VAL0;                      /**< 006A: Value Register 0                                             */
   __IO uint16_t  SM1FRACVAL1;                  /**< 006C: Fractional Value Register 1                                  */
   __IO uint16_t  SM1VAL1;                      /**< 006E: Value Register 1                                             */
   __IO uint16_t  SM1FRACVAL2;                  /**< 0070: Fractional Value Register 2                                  */
   __IO uint16_t  SM1VAL2;                      /**< 0072: Value Register 2                                             */
   __IO uint16_t  SM1FRACVAL3;                  /**< 0074: Fractional Value Register 3                                  */
   __IO uint16_t  SM1VAL3;                      /**< 0076: Value Register 3                                             */
   __IO uint16_t  SM1FRACVAL4;                  /**< 0078: Fractional Value Register 4                                  */
   __IO uint16_t  SM1VAL4;                      /**< 007A: Value Register 4                                             */
   __IO uint16_t  SM1FRACVAL5;                  /**< 007C: Fractional Value Register 5                                  */
   __IO uint16_t  SM1VAL5;                      /**< 007E: Value Register 5                                             */
   __IO uint16_t  SM1FRCTRL;                    /**< 0080: Fractional Control Register                                  */
   __IO uint16_t  SM1OCTRL;                     /**< 0082: Output Control Register                                      */
   __IO uint16_t  SM1STS;                       /**< 0084: Status Register                                              */
   __IO uint16_t  SM1INTEN;                     /**< 0086: Interrupt Enable Register                                    */
   __IO uint16_t  SM1DMAEN;                     /**< 0088: DMA Enable Register                                          */
   __IO uint16_t  SM1TCTRL;                     /**< 008A: Output Trigger Control Register                              */
   __IO uint16_t  SM1DISMAP0;                   /**< 008C: Fault Disable Mapping Register 0                             */
   __I  uint16_t  RESERVED4;                   
   __IO uint16_t  SM1DTCNT[2];                  /**< 0090: Deadtime Count Register                                      */
   __IO uint16_t  SM1CAPTCTRLA;                 /**< 0094: Capture Control A Register                                   */
   __IO uint16_t  SM1CAPTCOMPA;                 /**< 0096: Capture Compare A Register                                   */
   __IO uint16_t  SM1CAPTCTRLB;                 /**< 0098: Capture Control B Register                                   */
   __IO uint16_t  SM1CAPTCOMPB;                 /**< 009A: Capture Compare B Register                                   */
   __IO uint16_t  SM1CAPTCTRLX;                 /**< 009C: Capture Control X Register                                   */
   __IO uint16_t  SM1CAPTCOMPX;                 /**< 009E: Capture Compare X Register                                   */
   __I  uint16_t  SM1CVAL0;                     /**< 00A0: Capture Value 0 Register                                     */
   __I  uint16_t  SM1CVAL0CYC;                  /**< 00A2: Capture Value 0 Cycle Register                               */
   __I  uint16_t  SM1CVAL1;                     /**< 00A4: Capture Value 1 Register                                     */
   __I  uint16_t  SM1CVAL1CYC;                  /**< 00A6: Capture Value 1 Cycle Register                               */
   __I  uint16_t  SM1CVAL2;                     /**< 00A8: Capture Value 2 Register                                     */
   __I  uint16_t  SM1CVAL2CYC;                  /**< 00AA: Capture Value 2 Cycle Register                               */
   __I  uint16_t  SM1CVAL3;                     /**< 00AC: Capture Value 3 Register                                     */
   __I  uint16_t  SM1CVAL3CYC;                  /**< 00AE: Capture Value 3 Cycle Register                               */
   __I  uint16_t  SM1CVAL4;                     /**< 00B0: Capture Value 4 Register                                     */
   __I  uint16_t  SM1CVAL4CYC;                  /**< 00B2: Capture Value 4 Cycle Register                               */
   __I  uint16_t  SM1CVAL5;                     /**< 00B4: Capture Value 5 Register                                     */
   __I  uint16_t  SM1CVAL5CYC;                  /**< 00B6: Capture Value 5 Cycle Register                               */
   __I  uint32_t  RESERVED5[2];                
   __I  uint16_t  SM2CNT;                       /**< 00C0: Counter Register                                             */
   __IO uint16_t  SM2INIT;                      /**< 00C2: Initial Count Register                                       */
   __IO uint16_t  SM2CTRL2;                     /**< 00C4: Control 2 Register                                           */
   __IO uint16_t  SM2CTRL;                      /**< 00C6: Control Register                                             */
   __I  uint16_t  RESERVED6;                   
   __IO uint16_t  SM2VAL0;                      /**< 00CA: Value Register 0                                             */
   __IO uint16_t  SM2FRACVAL1;                  /**< 00CC: Fractional Value Register 1                                  */
   __IO uint16_t  SM2VAL1;                      /**< 00CE: Value Register 1                                             */
   __IO uint16_t  SM2FRACVAL2;                  /**< 00D0: Fractional Value Register 2                                  */
   __IO uint16_t  SM2VAL2;                      /**< 00D2: Value Register 2                                             */
   __IO uint16_t  SM2FRACVAL3;                  /**< 00D4: Fractional Value Register 3                                  */
   __IO uint16_t  SM2VAL3;                      /**< 00D6: Value Register 3                                             */
   __IO uint16_t  SM2FRACVAL4;                  /**< 00D8: Fractional Value Register 4                                  */
   __IO uint16_t  SM2VAL4;                      /**< 00DA: Value Register 4                                             */
   __IO uint16_t  SM2FRACVAL5;                  /**< 00DC: Fractional Value Register 5                                  */
   __IO uint16_t  SM2VAL5;                      /**< 00DE: Value Register 5                                             */
   __IO uint16_t  SM2FRCTRL;                    /**< 00E0: Fractional Control Register                                  */
   __IO uint16_t  SM2OCTRL;                     /**< 00E2: Output Control Register                                      */
   __IO uint16_t  SM2STS;                       /**< 00E4: Status Register                                              */
   __IO uint16_t  SM2INTEN;                     /**< 00E6: Interrupt Enable Register                                    */
   __IO uint16_t  SM2DMAEN;                     /**< 00E8: DMA Enable Register                                          */
   __IO uint16_t  SM2TCTRL;                     /**< 00EA: Output Trigger Control Register                              */
   __IO uint16_t  SM2DISMAP0;                   /**< 00EC: Fault Disable Mapping Register 0                             */
   __I  uint16_t  RESERVED7;                   
   __IO uint16_t  SM2DTCNT[2];                  /**< 00F0: Deadtime Count Register                                      */
   __IO uint16_t  SM2CAPTCTRLA;                 /**< 00F4: Capture Control A Register                                   */
   __IO uint16_t  SM2CAPTCOMPA;                 /**< 00F6: Capture Compare A Register                                   */
   __IO uint16_t  SM2CAPTCTRLB;                 /**< 00F8: Capture Control B Register                                   */
   __IO uint16_t  SM2CAPTCOMPB;                 /**< 00FA: Capture Compare B Register                                   */
   __IO uint16_t  SM2CAPTCTRLX;                 /**< 00FC: Capture Control X Register                                   */
   __IO uint16_t  SM2CAPTCOMPX;                 /**< 00FE: Capture Compare X Register                                   */
   __I  uint16_t  SM2CVAL0;                     /**< 0100: Capture Value 0 Register                                     */
   __I  uint16_t  SM2CVAL0CYC;                  /**< 0102: Capture Value 0 Cycle Register                               */
   __I  uint16_t  SM2CVAL1;                     /**< 0104: Capture Value 1 Register                                     */
   __I  uint16_t  SM2CVAL1CYC;                  /**< 0106: Capture Value 1 Cycle Register                               */
   __I  uint16_t  SM2CVAL2;                     /**< 0108: Capture Value 2 Register                                     */
   __I  uint16_t  SM2CVAL2CYC;                  /**< 010A: Capture Value 2 Cycle Register                               */
   __I  uint16_t  SM2CVAL3;                     /**< 010C: Capture Value 3 Register                                     */
   __I  uint16_t  SM2CVAL3CYC;                  /**< 010E: Capture Value 3 Cycle Register                               */
   __I  uint16_t  SM2CVAL4;                     /**< 0110: Capture Value 4 Register                                     */
   __I  uint16_t  SM2CVAL4CYC;                  /**< 0112: Capture Value 4 Cycle Register                               */
   __I  uint16_t  SM2CVAL5;                     /**< 0114: Capture Value 5 Register                                     */
   __I  uint16_t  SM2CVAL5CYC;                  /**< 0116: Capture Value 5 Cycle Register                               */
   __I  uint32_t  RESERVED8[2];                
   __I  uint16_t  SM3CNT;                       /**< 0120: Counter Register                                             */
   __IO uint16_t  SM3INIT;                      /**< 0122: Initial Count Register                                       */
   __IO uint16_t  SM3CTRL2;                     /**< 0124: Control 2 Register                                           */
   __IO uint16_t  SM3CTRL;                      /**< 0126: Control Register                                             */
   __I  uint16_t  RESERVED9;                   
   __IO uint16_t  SM3VAL0;                      /**< 012A: Value Register 0                                             */
   __IO uint16_t  SM3FRACVAL1;                  /**< 012C: Fractional Value Register 1                                  */
   __IO uint16_t  SM3VAL1;                      /**< 012E: Value Register 1                                             */
   __IO uint16_t  SM3FRACVAL2;                  /**< 0130: Fractional Value Register 2                                  */
   __IO uint16_t  SM3VAL2;                      /**< 0132: Value Register 2                                             */
   __IO uint16_t  SM3FRACVAL3;                  /**< 0134: Fractional Value Register 3                                  */
   __IO uint16_t  SM3VAL3;                      /**< 0136: Value Register 3                                             */
   __IO uint16_t  SM3FRACVAL4;                  /**< 0138: Fractional Value Register 4                                  */
   __IO uint16_t  SM3VAL4;                      /**< 013A: Value Register 4                                             */
   __IO uint16_t  SM3FRACVAL5;                  /**< 013C: Fractional Value Register 5                                  */
   __IO uint16_t  SM3VAL5;                      /**< 013E: Value Register 5                                             */
   __IO uint16_t  SM3FRCTRL;                    /**< 0140: Fractional Control Register                                  */
   __IO uint16_t  SM3OCTRL;                     /**< 0142: Output Control Register                                      */
   __IO uint16_t  SM3STS;                       /**< 0144: Status Register                                              */
   __IO uint16_t  SM3INTEN;                     /**< 0146: Interrupt Enable Register                                    */
   __IO uint16_t  SM3DMAEN;                     /**< 0148: DMA Enable Register                                          */
   __IO uint16_t  SM3TCTRL;                     /**< 014A: Output Trigger Control Register                              */
   __IO uint16_t  SM3DISMAP0;                   /**< 014C: Fault Disable Mapping Register 0                             */
   __I  uint16_t  RESERVED10;                  
   __IO uint16_t  SM3DTCNT[2];                  /**< 0150: Deadtime Count Register                                      */
   __IO uint16_t  SM3CAPTCTRLA;                 /**< 0154: Capture Control A Register                                   */
   __IO uint16_t  SM3CAPTCOMPA;                 /**< 0156: Capture Compare A Register                                   */
   __IO uint16_t  SM3CAPTCTRLB;                 /**< 0158: Capture Control B Register                                   */
   __IO uint16_t  SM3CAPTCOMPB;                 /**< 015A: Capture Compare B Register                                   */
   __IO uint16_t  SM3CAPTCTRLX;                 /**< 015C: Capture Control X Register                                   */
   __IO uint16_t  SM3CAPTCOMPX;                 /**< 015E: Capture Compare X Register                                   */
   __I  uint16_t  SM3CVAL0;                     /**< 0160: Capture Value 0 Register                                     */
   __I  uint16_t  SM3CVAL0CYC;                  /**< 0162: Capture Value 0 Cycle Register                               */
   __I  uint16_t  SM3CVAL1;                     /**< 0164: Capture Value 1 Register                                     */
   __I  uint16_t  SM3CVAL1CYC;                  /**< 0166: Capture Value 1 Cycle Register                               */
   __I  uint16_t  SM3CVAL2;                     /**< 0168: Capture Value 2 Register                                     */
   __I  uint16_t  SM3CVAL2CYC;                  /**< 016A: Capture Value 2 Cycle Register                               */
   __I  uint16_t  SM3CVAL3;                     /**< 016C: Capture Value 3 Register                                     */
   __I  uint16_t  SM3CVAL3CYC;                  /**< 016E: Capture Value 3 Cycle Register                               */
   __I  uint16_t  SM3CVAL4;                     /**< 0170: Capture Value 4 Register                                     */
   __I  uint16_t  SM3CVAL4CYC;                  /**< 0172: Capture Value 4 Cycle Register                               */
   __I  uint16_t  SM3CVAL5;                     /**< 0174: Capture Value 5 Register                                     */
   __I  uint16_t  SM3CVAL5CYC;                  /**< 0176: Capture Value 5 Cycle Register                               */
   __I  uint32_t  RESERVED11[2];               
   __IO uint16_t  OUTEN;                        /**< 0180: Output Enable Register                                       */
   __IO uint16_t  MASK;                         /**< 0182: Mask Register                                                */
   __IO uint16_t  SWCOUT;                       /**< 0184: Software Controlled Output Register                          */
   __IO uint16_t  DTSRCSEL;                     /**< 0186: PWM Source Select Register                                   */
   __IO uint16_t  MCTRL;                        /**< 0188: Master Control Register                                      */
   __IO uint16_t  MCTRL2;                       /**< 018A: Master Control 2 Register                                    */
   __IO uint16_t  FCTRL;                        /**< 018C: Fault Control Register                                       */
   __IO uint16_t  FSTS;                         /**< 018E: Fault Status Register                                        */
   __IO uint16_t  FFILT;                        /**< 0190: Fault Filter Register                                        */
   __IO uint16_t  FTST;                         /**< 0192: Fault Test Register                                          */
   __IO uint16_t  FCTRL2;                       /**< 0194: Fault Control 2 Register                                     */
} PWMA_Type;

/**
 * @} */ /* End group PWMA_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'PWMA' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

