podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV44F15.h
#define PWMA_SM0INTEN_CB1IE_SHIFT                9                                                   /*!< PWMA_SM0INTEN: CB1IE Position           */
#define PWMA_SM0INTEN_CA0IE_MASK                 (0x01UL << PWMA_SM0INTEN_CA0IE_SHIFT)               /*!< PWMA_SM0INTEN: CA0IE Mask               */
#define PWMA_SM0INTEN_CA0IE_SHIFT                10                                                  /*!< PWMA_SM0INTEN: CA0IE Position           */
#define PWMA_SM0INTEN_CA1IE_MASK                 (0x01UL << PWMA_SM0INTEN_CA1IE_SHIFT)               /*!< PWMA_SM0INTEN: CA1IE Mask               */
#define PWMA_SM0INTEN_CA1IE_SHIFT                11                                                  /*!< PWMA_SM0INTEN: CA1IE Position           */
#define PWMA_SM0INTEN_RIE_MASK                   (0x01UL << PWMA_SM0INTEN_RIE_SHIFT)                 /*!< PWMA_SM0INTEN: RIE Mask                 */
#define PWMA_SM0INTEN_RIE_SHIFT                  12                                                  /*!< PWMA_SM0INTEN: RIE Position             */
#define PWMA_SM0INTEN_REIE_MASK                  (0x01UL << PWMA_SM0INTEN_REIE_SHIFT)                /*!< PWMA_SM0INTEN: REIE Mask                */
#define PWMA_SM0INTEN_REIE_SHIFT                 13                                                  /*!< PWMA_SM0INTEN: REIE Position            */
/* ------- SM0DMAEN Bit Fields                      ------ */
#define PWMA_SM0DMAEN_CX0DE_MASK                 (0x01UL << PWMA_SM0DMAEN_CX0DE_SHIFT)               /*!< PWMA_SM0DMAEN: CX0DE Mask               */
#define PWMA_SM0DMAEN_CX0DE_SHIFT                0                                                   /*!< PWMA_SM0DMAEN: CX0DE Position           */
#define PWMA_SM0DMAEN_CX1DE_MASK                 (0x01UL << PWMA_SM0DMAEN_CX1DE_SHIFT)               /*!< PWMA_SM0DMAEN: CX1DE Mask               */
#define PWMA_SM0DMAEN_CX1DE_SHIFT                1                                                   /*!< PWMA_SM0DMAEN: CX1DE Position           */
#define PWMA_SM0DMAEN_CB0DE_MASK                 (0x01UL << PWMA_SM0DMAEN_CB0DE_SHIFT)               /*!< PWMA_SM0DMAEN: CB0DE Mask               */
#define PWMA_SM0DMAEN_CB0DE_SHIFT                2                                                   /*!< PWMA_SM0DMAEN: CB0DE Position           */
#define PWMA_SM0DMAEN_CB1DE_MASK                 (0x01UL << PWMA_SM0DMAEN_CB1DE_SHIFT)               /*!< PWMA_SM0DMAEN: CB1DE Mask               */
#define PWMA_SM0DMAEN_CB1DE_SHIFT                3                                                   /*!< PWMA_SM0DMAEN: CB1DE Position           */
#define PWMA_SM0DMAEN_CA0DE_MASK                 (0x01UL << PWMA_SM0DMAEN_CA0DE_SHIFT)               /*!< PWMA_SM0DMAEN: CA0DE Mask               */
#define PWMA_SM0DMAEN_CA0DE_SHIFT                4                                                   /*!< PWMA_SM0DMAEN: CA0DE Position           */
#define PWMA_SM0DMAEN_CA1DE_MASK                 (0x01UL << PWMA_SM0DMAEN_CA1DE_SHIFT)               /*!< PWMA_SM0DMAEN: CA1DE Mask               */
#define PWMA_SM0DMAEN_CA1DE_SHIFT                5                                                   /*!< PWMA_SM0DMAEN: CA1DE Position           */
#define PWMA_SM0DMAEN_CAPTDE_MASK                (0x03UL << PWMA_SM0DMAEN_CAPTDE_SHIFT)              /*!< PWMA_SM0DMAEN: CAPTDE Mask              */
#define PWMA_SM0DMAEN_CAPTDE_SHIFT               6                                                   /*!< PWMA_SM0DMAEN: CAPTDE Position          */
#define PWMA_SM0DMAEN_CAPTDE(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM0DMAEN_CAPTDE_SHIFT))&PWMA_SM0DMAEN_CAPTDE_MASK) /*!< PWMA_SM0DMAEN                           */
#define PWMA_SM0DMAEN_FAND_MASK                  (0x01UL << PWMA_SM0DMAEN_FAND_SHIFT)                /*!< PWMA_SM0DMAEN: FAND Mask                */
#define PWMA_SM0DMAEN_FAND_SHIFT                 8                                                   /*!< PWMA_SM0DMAEN: FAND Position            */
#define PWMA_SM0DMAEN_VALDE_MASK                 (0x01UL << PWMA_SM0DMAEN_VALDE_SHIFT)               /*!< PWMA_SM0DMAEN: VALDE Mask               */
#define PWMA_SM0DMAEN_VALDE_SHIFT                9                                                   /*!< PWMA_SM0DMAEN: VALDE Position           */
/* ------- SM0TCTRL Bit Fields                      ------ */
#define PWMA_SM0TCTRL_OUT_TRIG_EN_MASK           (0x3FUL << PWMA_SM0TCTRL_OUT_TRIG_EN_SHIFT)         /*!< PWMA_SM0TCTRL: OUT_TRIG_EN Mask         */
#define PWMA_SM0TCTRL_OUT_TRIG_EN_SHIFT          0                                                   /*!< PWMA_SM0TCTRL: OUT_TRIG_EN Position     */
#define PWMA_SM0TCTRL_OUT_TRIG_EN(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0TCTRL_OUT_TRIG_EN_SHIFT))&PWMA_SM0TCTRL_OUT_TRIG_EN_MASK) /*!< PWMA_SM0TCTRL                           */
#define PWMA_SM0TCTRL_PWBOT1_MASK                (0x01UL << PWMA_SM0TCTRL_PWBOT1_SHIFT)              /*!< PWMA_SM0TCTRL: PWBOT1 Mask              */
#define PWMA_SM0TCTRL_PWBOT1_SHIFT               14                                                  /*!< PWMA_SM0TCTRL: PWBOT1 Position          */
#define PWMA_SM0TCTRL_PWAOT0_MASK                (0x01UL << PWMA_SM0TCTRL_PWAOT0_SHIFT)              /*!< PWMA_SM0TCTRL: PWAOT0 Mask              */
#define PWMA_SM0TCTRL_PWAOT0_SHIFT               15                                                  /*!< PWMA_SM0TCTRL: PWAOT0 Position          */
/* ------- SM0DISMAP0 Bit Fields                    ------ */
#define PWMA_SM0DISMAP0_DIS0A_MASK               (0x0FUL << PWMA_SM0DISMAP0_DIS0A_SHIFT)             /*!< PWMA_SM0DISMAP0: DIS0A Mask             */
#define PWMA_SM0DISMAP0_DIS0A_SHIFT              0                                                   /*!< PWMA_SM0DISMAP0: DIS0A Position         */
#define PWMA_SM0DISMAP0_DIS0A(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM0DISMAP0_DIS0A_SHIFT))&PWMA_SM0DISMAP0_DIS0A_MASK) /*!< PWMA_SM0DISMAP0                         */
#define PWMA_SM0DISMAP0_DIS0B_MASK               (0x0FUL << PWMA_SM0DISMAP0_DIS0B_SHIFT)             /*!< PWMA_SM0DISMAP0: DIS0B Mask             */
#define PWMA_SM0DISMAP0_DIS0B_SHIFT              4                                                   /*!< PWMA_SM0DISMAP0: DIS0B Position         */
#define PWMA_SM0DISMAP0_DIS0B(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM0DISMAP0_DIS0B_SHIFT))&PWMA_SM0DISMAP0_DIS0B_MASK) /*!< PWMA_SM0DISMAP0                         */
#define PWMA_SM0DISMAP0_DIS0X_MASK               (0x0FUL << PWMA_SM0DISMAP0_DIS0X_SHIFT)             /*!< PWMA_SM0DISMAP0: DIS0X Mask             */
#define PWMA_SM0DISMAP0_DIS0X_SHIFT              8                                                   /*!< PWMA_SM0DISMAP0: DIS0X Position         */
#define PWMA_SM0DISMAP0_DIS0X(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM0DISMAP0_DIS0X_SHIFT))&PWMA_SM0DISMAP0_DIS0X_MASK) /*!< PWMA_SM0DISMAP0                         */
/* ------- SM0DTCNT Bit Fields                      ------ */
#define PWMA_SM0DTCNT_DTCNT0_MASK                (0x7FFUL << PWMA_SM0DTCNT_DTCNT0_SHIFT)             /*!< PWMA_SM0DTCNT: DTCNT0 Mask              */
#define PWMA_SM0DTCNT_DTCNT0_SHIFT               0                                                   /*!< PWMA_SM0DTCNT: DTCNT0 Position          */
#define PWMA_SM0DTCNT_DTCNT0(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM0DTCNT_DTCNT0_SHIFT))&PWMA_SM0DTCNT_DTCNT0_MASK) /*!< PWMA_SM0DTCNT                           */
/* ------- SM0CAPTCTRLA Bit Fields                  ------ */
#define PWMA_SM0CAPTCTRLA_ARMA_MASK              (0x01UL << PWMA_SM0CAPTCTRLA_ARMA_SHIFT)            /*!< PWMA_SM0CAPTCTRLA: ARMA Mask            */
#define PWMA_SM0CAPTCTRLA_ARMA_SHIFT             0                                                   /*!< PWMA_SM0CAPTCTRLA: ARMA Position        */
#define PWMA_SM0CAPTCTRLA_ONESHOTA_MASK          (0x01UL << PWMA_SM0CAPTCTRLA_ONESHOTA_SHIFT)        /*!< PWMA_SM0CAPTCTRLA: ONESHOTA Mask        */
#define PWMA_SM0CAPTCTRLA_ONESHOTA_SHIFT         1                                                   /*!< PWMA_SM0CAPTCTRLA: ONESHOTA Position    */
#define PWMA_SM0CAPTCTRLA_EDGA0_MASK             (0x03UL << PWMA_SM0CAPTCTRLA_EDGA0_SHIFT)           /*!< PWMA_SM0CAPTCTRLA: EDGA0 Mask           */
#define PWMA_SM0CAPTCTRLA_EDGA0_SHIFT            2                                                   /*!< PWMA_SM0CAPTCTRLA: EDGA0 Position       */
#define PWMA_SM0CAPTCTRLA_EDGA0(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLA_EDGA0_SHIFT))&PWMA_SM0CAPTCTRLA_EDGA0_MASK) /*!< PWMA_SM0CAPTCTRLA                       */
#define PWMA_SM0CAPTCTRLA_EDGA1_MASK             (0x03UL << PWMA_SM0CAPTCTRLA_EDGA1_SHIFT)           /*!< PWMA_SM0CAPTCTRLA: EDGA1 Mask           */
#define PWMA_SM0CAPTCTRLA_EDGA1_SHIFT            4                                                   /*!< PWMA_SM0CAPTCTRLA: EDGA1 Position       */
#define PWMA_SM0CAPTCTRLA_EDGA1(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLA_EDGA1_SHIFT))&PWMA_SM0CAPTCTRLA_EDGA1_MASK) /*!< PWMA_SM0CAPTCTRLA                       */
#define PWMA_SM0CAPTCTRLA_INP_SELA_MASK          (0x01UL << PWMA_SM0CAPTCTRLA_INP_SELA_SHIFT)        /*!< PWMA_SM0CAPTCTRLA: INP_SELA Mask        */
#define PWMA_SM0CAPTCTRLA_INP_SELA_SHIFT         6                                                   /*!< PWMA_SM0CAPTCTRLA: INP_SELA Position    */
#define PWMA_SM0CAPTCTRLA_EDGCNTA_EN_MASK        (0x01UL << PWMA_SM0CAPTCTRLA_EDGCNTA_EN_SHIFT)      /*!< PWMA_SM0CAPTCTRLA: EDGCNTA_EN Mask      */
#define PWMA_SM0CAPTCTRLA_EDGCNTA_EN_SHIFT       7                                                   /*!< PWMA_SM0CAPTCTRLA: EDGCNTA_EN Position  */
#define PWMA_SM0CAPTCTRLA_CFAWM_MASK             (0x03UL << PWMA_SM0CAPTCTRLA_CFAWM_SHIFT)           /*!< PWMA_SM0CAPTCTRLA: CFAWM Mask           */
#define PWMA_SM0CAPTCTRLA_CFAWM_SHIFT            8                                                   /*!< PWMA_SM0CAPTCTRLA: CFAWM Position       */
#define PWMA_SM0CAPTCTRLA_CFAWM(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLA_CFAWM_SHIFT))&PWMA_SM0CAPTCTRLA_CFAWM_MASK) /*!< PWMA_SM0CAPTCTRLA                       */
#define PWMA_SM0CAPTCTRLA_CA0CNT_MASK            (0x07UL << PWMA_SM0CAPTCTRLA_CA0CNT_SHIFT)          /*!< PWMA_SM0CAPTCTRLA: CA0CNT Mask          */
#define PWMA_SM0CAPTCTRLA_CA0CNT_SHIFT           10                                                  /*!< PWMA_SM0CAPTCTRLA: CA0CNT Position      */
#define PWMA_SM0CAPTCTRLA_CA0CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLA_CA0CNT_SHIFT))&PWMA_SM0CAPTCTRLA_CA0CNT_MASK) /*!< PWMA_SM0CAPTCTRLA                       */
#define PWMA_SM0CAPTCTRLA_CA1CNT_MASK            (0x07UL << PWMA_SM0CAPTCTRLA_CA1CNT_SHIFT)          /*!< PWMA_SM0CAPTCTRLA: CA1CNT Mask          */
#define PWMA_SM0CAPTCTRLA_CA1CNT_SHIFT           13                                                  /*!< PWMA_SM0CAPTCTRLA: CA1CNT Position      */
#define PWMA_SM0CAPTCTRLA_CA1CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLA_CA1CNT_SHIFT))&PWMA_SM0CAPTCTRLA_CA1CNT_MASK) /*!< PWMA_SM0CAPTCTRLA                       */
/* ------- SM0CAPTCOMPA Bit Fields                  ------ */
#define PWMA_SM0CAPTCOMPA_EDGCMPA_MASK           (0xFFUL << PWMA_SM0CAPTCOMPA_EDGCMPA_SHIFT)         /*!< PWMA_SM0CAPTCOMPA: EDGCMPA Mask         */
#define PWMA_SM0CAPTCOMPA_EDGCMPA_SHIFT          0                                                   /*!< PWMA_SM0CAPTCOMPA: EDGCMPA Position     */
#define PWMA_SM0CAPTCOMPA_EDGCMPA(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCOMPA_EDGCMPA_SHIFT))&PWMA_SM0CAPTCOMPA_EDGCMPA_MASK) /*!< PWMA_SM0CAPTCOMPA                       */
#define PWMA_SM0CAPTCOMPA_EDGCNTA_MASK           (0xFFUL << PWMA_SM0CAPTCOMPA_EDGCNTA_SHIFT)         /*!< PWMA_SM0CAPTCOMPA: EDGCNTA Mask         */
#define PWMA_SM0CAPTCOMPA_EDGCNTA_SHIFT          8                                                   /*!< PWMA_SM0CAPTCOMPA: EDGCNTA Position     */
#define PWMA_SM0CAPTCOMPA_EDGCNTA(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCOMPA_EDGCNTA_SHIFT))&PWMA_SM0CAPTCOMPA_EDGCNTA_MASK) /*!< PWMA_SM0CAPTCOMPA                       */
/* ------- SM0CAPTCTRLB Bit Fields                  ------ */
#define PWMA_SM0CAPTCTRLB_ARMB_MASK              (0x01UL << PWMA_SM0CAPTCTRLB_ARMB_SHIFT)            /*!< PWMA_SM0CAPTCTRLB: ARMB Mask            */
#define PWMA_SM0CAPTCTRLB_ARMB_SHIFT             0                                                   /*!< PWMA_SM0CAPTCTRLB: ARMB Position        */
#define PWMA_SM0CAPTCTRLB_ONESHOTB_MASK          (0x01UL << PWMA_SM0CAPTCTRLB_ONESHOTB_SHIFT)        /*!< PWMA_SM0CAPTCTRLB: ONESHOTB Mask        */
#define PWMA_SM0CAPTCTRLB_ONESHOTB_SHIFT         1                                                   /*!< PWMA_SM0CAPTCTRLB: ONESHOTB Position    */
#define PWMA_SM0CAPTCTRLB_EDGB0_MASK             (0x03UL << PWMA_SM0CAPTCTRLB_EDGB0_SHIFT)           /*!< PWMA_SM0CAPTCTRLB: EDGB0 Mask           */
#define PWMA_SM0CAPTCTRLB_EDGB0_SHIFT            2                                                   /*!< PWMA_SM0CAPTCTRLB: EDGB0 Position       */
#define PWMA_SM0CAPTCTRLB_EDGB0(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLB_EDGB0_SHIFT))&PWMA_SM0CAPTCTRLB_EDGB0_MASK) /*!< PWMA_SM0CAPTCTRLB                       */
#define PWMA_SM0CAPTCTRLB_EDGB1_MASK             (0x03UL << PWMA_SM0CAPTCTRLB_EDGB1_SHIFT)           /*!< PWMA_SM0CAPTCTRLB: EDGB1 Mask           */
#define PWMA_SM0CAPTCTRLB_EDGB1_SHIFT            4                                                   /*!< PWMA_SM0CAPTCTRLB: EDGB1 Position       */
#define PWMA_SM0CAPTCTRLB_EDGB1(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLB_EDGB1_SHIFT))&PWMA_SM0CAPTCTRLB_EDGB1_MASK) /*!< PWMA_SM0CAPTCTRLB                       */
#define PWMA_SM0CAPTCTRLB_INP_SELB_MASK          (0x01UL << PWMA_SM0CAPTCTRLB_INP_SELB_SHIFT)        /*!< PWMA_SM0CAPTCTRLB: INP_SELB Mask        */
#define PWMA_SM0CAPTCTRLB_INP_SELB_SHIFT         6                                                   /*!< PWMA_SM0CAPTCTRLB: INP_SELB Position    */
#define PWMA_SM0CAPTCTRLB_EDGCNTB_EN_MASK        (0x01UL << PWMA_SM0CAPTCTRLB_EDGCNTB_EN_SHIFT)      /*!< PWMA_SM0CAPTCTRLB: EDGCNTB_EN Mask      */
#define PWMA_SM0CAPTCTRLB_EDGCNTB_EN_SHIFT       7                                                   /*!< PWMA_SM0CAPTCTRLB: EDGCNTB_EN Position  */
#define PWMA_SM0CAPTCTRLB_CFBWM_MASK             (0x03UL << PWMA_SM0CAPTCTRLB_CFBWM_SHIFT)           /*!< PWMA_SM0CAPTCTRLB: CFBWM Mask           */
#define PWMA_SM0CAPTCTRLB_CFBWM_SHIFT            8                                                   /*!< PWMA_SM0CAPTCTRLB: CFBWM Position       */
#define PWMA_SM0CAPTCTRLB_CFBWM(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLB_CFBWM_SHIFT))&PWMA_SM0CAPTCTRLB_CFBWM_MASK) /*!< PWMA_SM0CAPTCTRLB                       */
#define PWMA_SM0CAPTCTRLB_CB0CNT_MASK            (0x07UL << PWMA_SM0CAPTCTRLB_CB0CNT_SHIFT)          /*!< PWMA_SM0CAPTCTRLB: CB0CNT Mask          */
#define PWMA_SM0CAPTCTRLB_CB0CNT_SHIFT           10                                                  /*!< PWMA_SM0CAPTCTRLB: CB0CNT Position      */
#define PWMA_SM0CAPTCTRLB_CB0CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLB_CB0CNT_SHIFT))&PWMA_SM0CAPTCTRLB_CB0CNT_MASK) /*!< PWMA_SM0CAPTCTRLB                       */
#define PWMA_SM0CAPTCTRLB_CB1CNT_MASK            (0x07UL << PWMA_SM0CAPTCTRLB_CB1CNT_SHIFT)          /*!< PWMA_SM0CAPTCTRLB: CB1CNT Mask          */
#define PWMA_SM0CAPTCTRLB_CB1CNT_SHIFT           13                                                  /*!< PWMA_SM0CAPTCTRLB: CB1CNT Position      */
#define PWMA_SM0CAPTCTRLB_CB1CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLB_CB1CNT_SHIFT))&PWMA_SM0CAPTCTRLB_CB1CNT_MASK) /*!< PWMA_SM0CAPTCTRLB                       */
/* ------- SM0CAPTCOMPB Bit Fields                  ------ */
#define PWMA_SM0CAPTCOMPB_EDGCMPB_MASK           (0xFFUL << PWMA_SM0CAPTCOMPB_EDGCMPB_SHIFT)         /*!< PWMA_SM0CAPTCOMPB: EDGCMPB Mask         */
#define PWMA_SM0CAPTCOMPB_EDGCMPB_SHIFT          0                                                   /*!< PWMA_SM0CAPTCOMPB: EDGCMPB Position     */
#define PWMA_SM0CAPTCOMPB_EDGCMPB(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCOMPB_EDGCMPB_SHIFT))&PWMA_SM0CAPTCOMPB_EDGCMPB_MASK) /*!< PWMA_SM0CAPTCOMPB                       */
#define PWMA_SM0CAPTCOMPB_EDGCNTB_MASK           (0xFFUL << PWMA_SM0CAPTCOMPB_EDGCNTB_SHIFT)         /*!< PWMA_SM0CAPTCOMPB: EDGCNTB Mask         */
#define PWMA_SM0CAPTCOMPB_EDGCNTB_SHIFT          8                                                   /*!< PWMA_SM0CAPTCOMPB: EDGCNTB Position     */
#define PWMA_SM0CAPTCOMPB_EDGCNTB(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCOMPB_EDGCNTB_SHIFT))&PWMA_SM0CAPTCOMPB_EDGCNTB_MASK) /*!< PWMA_SM0CAPTCOMPB                       */
/* ------- SM0CAPTCTRLX Bit Fields                  ------ */
#define PWMA_SM0CAPTCTRLX_ARMX_MASK              (0x01UL << PWMA_SM0CAPTCTRLX_ARMX_SHIFT)            /*!< PWMA_SM0CAPTCTRLX: ARMX Mask            */
#define PWMA_SM0CAPTCTRLX_ARMX_SHIFT             0                                                   /*!< PWMA_SM0CAPTCTRLX: ARMX Position        */
#define PWMA_SM0CAPTCTRLX_ONESHOTX_MASK          (0x01UL << PWMA_SM0CAPTCTRLX_ONESHOTX_SHIFT)        /*!< PWMA_SM0CAPTCTRLX: ONESHOTX Mask        */
#define PWMA_SM0CAPTCTRLX_ONESHOTX_SHIFT         1                                                   /*!< PWMA_SM0CAPTCTRLX: ONESHOTX Position    */
#define PWMA_SM0CAPTCTRLX_EDGX0_MASK             (0x03UL << PWMA_SM0CAPTCTRLX_EDGX0_SHIFT)           /*!< PWMA_SM0CAPTCTRLX: EDGX0 Mask           */
#define PWMA_SM0CAPTCTRLX_EDGX0_SHIFT            2                                                   /*!< PWMA_SM0CAPTCTRLX: EDGX0 Position       */
#define PWMA_SM0CAPTCTRLX_EDGX0(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLX_EDGX0_SHIFT))&PWMA_SM0CAPTCTRLX_EDGX0_MASK) /*!< PWMA_SM0CAPTCTRLX                       */
#define PWMA_SM0CAPTCTRLX_EDGX1_MASK             (0x03UL << PWMA_SM0CAPTCTRLX_EDGX1_SHIFT)           /*!< PWMA_SM0CAPTCTRLX: EDGX1 Mask           */
#define PWMA_SM0CAPTCTRLX_EDGX1_SHIFT            4                                                   /*!< PWMA_SM0CAPTCTRLX: EDGX1 Position       */
#define PWMA_SM0CAPTCTRLX_EDGX1(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLX_EDGX1_SHIFT))&PWMA_SM0CAPTCTRLX_EDGX1_MASK) /*!< PWMA_SM0CAPTCTRLX                       */
#define PWMA_SM0CAPTCTRLX_INP_SELX_MASK          (0x01UL << PWMA_SM0CAPTCTRLX_INP_SELX_SHIFT)        /*!< PWMA_SM0CAPTCTRLX: INP_SELX Mask        */
#define PWMA_SM0CAPTCTRLX_INP_SELX_SHIFT         6                                                   /*!< PWMA_SM0CAPTCTRLX: INP_SELX Position    */
#define PWMA_SM0CAPTCTRLX_EDGCNTX_EN_MASK        (0x01UL << PWMA_SM0CAPTCTRLX_EDGCNTX_EN_SHIFT)      /*!< PWMA_SM0CAPTCTRLX: EDGCNTX_EN Mask      */
#define PWMA_SM0CAPTCTRLX_EDGCNTX_EN_SHIFT       7                                                   /*!< PWMA_SM0CAPTCTRLX: EDGCNTX_EN Position  */
#define PWMA_SM0CAPTCTRLX_CFXWM_MASK             (0x03UL << PWMA_SM0CAPTCTRLX_CFXWM_SHIFT)           /*!< PWMA_SM0CAPTCTRLX: CFXWM Mask           */
#define PWMA_SM0CAPTCTRLX_CFXWM_SHIFT            8                                                   /*!< PWMA_SM0CAPTCTRLX: CFXWM Position       */
#define PWMA_SM0CAPTCTRLX_CFXWM(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLX_CFXWM_SHIFT))&PWMA_SM0CAPTCTRLX_CFXWM_MASK) /*!< PWMA_SM0CAPTCTRLX                       */
#define PWMA_SM0CAPTCTRLX_CX0CNT_MASK            (0x07UL << PWMA_SM0CAPTCTRLX_CX0CNT_SHIFT)          /*!< PWMA_SM0CAPTCTRLX: CX0CNT Mask          */
#define PWMA_SM0CAPTCTRLX_CX0CNT_SHIFT           10                                                  /*!< PWMA_SM0CAPTCTRLX: CX0CNT Position      */
#define PWMA_SM0CAPTCTRLX_CX0CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLX_CX0CNT_SHIFT))&PWMA_SM0CAPTCTRLX_CX0CNT_MASK) /*!< PWMA_SM0CAPTCTRLX                       */
#define PWMA_SM0CAPTCTRLX_CX1CNT_MASK            (0x07UL << PWMA_SM0CAPTCTRLX_CX1CNT_SHIFT)          /*!< PWMA_SM0CAPTCTRLX: CX1CNT Mask          */
#define PWMA_SM0CAPTCTRLX_CX1CNT_SHIFT           13                                                  /*!< PWMA_SM0CAPTCTRLX: CX1CNT Position      */
#define PWMA_SM0CAPTCTRLX_CX1CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLX_CX1CNT_SHIFT))&PWMA_SM0CAPTCTRLX_CX1CNT_MASK) /*!< PWMA_SM0CAPTCTRLX                       */
/* ------- SM0CAPTCOMPX Bit Fields                  ------ */
#define PWMA_SM0CAPTCOMPX_EDGCMPX_MASK           (0xFFUL << PWMA_SM0CAPTCOMPX_EDGCMPX_SHIFT)         /*!< PWMA_SM0CAPTCOMPX: EDGCMPX Mask         */
#define PWMA_SM0CAPTCOMPX_EDGCMPX_SHIFT          0                                                   /*!< PWMA_SM0CAPTCOMPX: EDGCMPX Position     */
#define PWMA_SM0CAPTCOMPX_EDGCMPX(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCOMPX_EDGCMPX_SHIFT))&PWMA_SM0CAPTCOMPX_EDGCMPX_MASK) /*!< PWMA_SM0CAPTCOMPX                       */
#define PWMA_SM0CAPTCOMPX_EDGCNTX_MASK           (0xFFUL << PWMA_SM0CAPTCOMPX_EDGCNTX_SHIFT)         /*!< PWMA_SM0CAPTCOMPX: EDGCNTX Mask         */
#define PWMA_SM0CAPTCOMPX_EDGCNTX_SHIFT          8                                                   /*!< PWMA_SM0CAPTCOMPX: EDGCNTX Position     */
#define PWMA_SM0CAPTCOMPX_EDGCNTX(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCOMPX_EDGCNTX_SHIFT))&PWMA_SM0CAPTCOMPX_EDGCNTX_MASK) /*!< PWMA_SM0CAPTCOMPX                       */
/* ------- SM0CVAL0 Bit Fields                      ------ */
#define PWMA_SM0CVAL0_CAPTVAL0_MASK              (0xFFFFUL << PWMA_SM0CVAL0_CAPTVAL0_SHIFT)          /*!< PWMA_SM0CVAL0: CAPTVAL0 Mask            */
#define PWMA_SM0CVAL0_CAPTVAL0_SHIFT             0                                                   /*!< PWMA_SM0CVAL0: CAPTVAL0 Position        */
#define PWMA_SM0CVAL0_CAPTVAL0(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL0_CAPTVAL0_SHIFT))&PWMA_SM0CVAL0_CAPTVAL0_MASK) /*!< PWMA_SM0CVAL0                           */
/* ------- SM0CVAL0CYC Bit Fields                   ------ */
#define PWMA_SM0CVAL0CYC_CVAL0CYC_MASK           (0x0FUL << PWMA_SM0CVAL0CYC_CVAL0CYC_SHIFT)         /*!< PWMA_SM0CVAL0CYC: CVAL0CYC Mask         */
#define PWMA_SM0CVAL0CYC_CVAL0CYC_SHIFT          0                                                   /*!< PWMA_SM0CVAL0CYC: CVAL0CYC Position     */
#define PWMA_SM0CVAL0CYC_CVAL0CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL0CYC_CVAL0CYC_SHIFT))&PWMA_SM0CVAL0CYC_CVAL0CYC_MASK) /*!< PWMA_SM0CVAL0CYC                        */
/* ------- SM0CVAL1 Bit Fields                      ------ */
#define PWMA_SM0CVAL1_CAPTVAL1_MASK              (0xFFFFUL << PWMA_SM0CVAL1_CAPTVAL1_SHIFT)          /*!< PWMA_SM0CVAL1: CAPTVAL1 Mask            */
#define PWMA_SM0CVAL1_CAPTVAL1_SHIFT             0                                                   /*!< PWMA_SM0CVAL1: CAPTVAL1 Position        */
#define PWMA_SM0CVAL1_CAPTVAL1(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL1_CAPTVAL1_SHIFT))&PWMA_SM0CVAL1_CAPTVAL1_MASK) /*!< PWMA_SM0CVAL1                           */
/* ------- SM0CVAL1CYC Bit Fields                   ------ */
#define PWMA_SM0CVAL1CYC_CVAL1CYC_MASK           (0x0FUL << PWMA_SM0CVAL1CYC_CVAL1CYC_SHIFT)         /*!< PWMA_SM0CVAL1CYC: CVAL1CYC Mask         */
#define PWMA_SM0CVAL1CYC_CVAL1CYC_SHIFT          0                                                   /*!< PWMA_SM0CVAL1CYC: CVAL1CYC Position     */
#define PWMA_SM0CVAL1CYC_CVAL1CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL1CYC_CVAL1CYC_SHIFT))&PWMA_SM0CVAL1CYC_CVAL1CYC_MASK) /*!< PWMA_SM0CVAL1CYC                        */
/* ------- SM0CVAL2 Bit Fields                      ------ */
