podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV44F15.h
#define PWMA_SM0CVAL2_CAPTVAL2_MASK              (0xFFFFUL << PWMA_SM0CVAL2_CAPTVAL2_SHIFT)          /*!< PWMA_SM0CVAL2: CAPTVAL2 Mask            */
#define PWMA_SM0CVAL2_CAPTVAL2_SHIFT             0                                                   /*!< PWMA_SM0CVAL2: CAPTVAL2 Position        */
#define PWMA_SM0CVAL2_CAPTVAL2(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL2_CAPTVAL2_SHIFT))&PWMA_SM0CVAL2_CAPTVAL2_MASK) /*!< PWMA_SM0CVAL2                           */
/* ------- SM0CVAL2CYC Bit Fields                   ------ */
#define PWMA_SM0CVAL2CYC_CVAL2CYC_MASK           (0x0FUL << PWMA_SM0CVAL2CYC_CVAL2CYC_SHIFT)         /*!< PWMA_SM0CVAL2CYC: CVAL2CYC Mask         */
#define PWMA_SM0CVAL2CYC_CVAL2CYC_SHIFT          0                                                   /*!< PWMA_SM0CVAL2CYC: CVAL2CYC Position     */
#define PWMA_SM0CVAL2CYC_CVAL2CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL2CYC_CVAL2CYC_SHIFT))&PWMA_SM0CVAL2CYC_CVAL2CYC_MASK) /*!< PWMA_SM0CVAL2CYC                        */
/* ------- SM0CVAL3 Bit Fields                      ------ */
#define PWMA_SM0CVAL3_CAPTVAL3_MASK              (0xFFFFUL << PWMA_SM0CVAL3_CAPTVAL3_SHIFT)          /*!< PWMA_SM0CVAL3: CAPTVAL3 Mask            */
#define PWMA_SM0CVAL3_CAPTVAL3_SHIFT             0                                                   /*!< PWMA_SM0CVAL3: CAPTVAL3 Position        */
#define PWMA_SM0CVAL3_CAPTVAL3(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL3_CAPTVAL3_SHIFT))&PWMA_SM0CVAL3_CAPTVAL3_MASK) /*!< PWMA_SM0CVAL3                           */
/* ------- SM0CVAL3CYC Bit Fields                   ------ */
#define PWMA_SM0CVAL3CYC_CVAL3CYC_MASK           (0x0FUL << PWMA_SM0CVAL3CYC_CVAL3CYC_SHIFT)         /*!< PWMA_SM0CVAL3CYC: CVAL3CYC Mask         */
#define PWMA_SM0CVAL3CYC_CVAL3CYC_SHIFT          0                                                   /*!< PWMA_SM0CVAL3CYC: CVAL3CYC Position     */
#define PWMA_SM0CVAL3CYC_CVAL3CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL3CYC_CVAL3CYC_SHIFT))&PWMA_SM0CVAL3CYC_CVAL3CYC_MASK) /*!< PWMA_SM0CVAL3CYC                        */
/* ------- SM0CVAL4 Bit Fields                      ------ */
#define PWMA_SM0CVAL4_CAPTVAL4_MASK              (0xFFFFUL << PWMA_SM0CVAL4_CAPTVAL4_SHIFT)          /*!< PWMA_SM0CVAL4: CAPTVAL4 Mask            */
#define PWMA_SM0CVAL4_CAPTVAL4_SHIFT             0                                                   /*!< PWMA_SM0CVAL4: CAPTVAL4 Position        */
#define PWMA_SM0CVAL4_CAPTVAL4(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL4_CAPTVAL4_SHIFT))&PWMA_SM0CVAL4_CAPTVAL4_MASK) /*!< PWMA_SM0CVAL4                           */
/* ------- SM0CVAL4CYC Bit Fields                   ------ */
#define PWMA_SM0CVAL4CYC_CVAL4CYC_MASK           (0x0FUL << PWMA_SM0CVAL4CYC_CVAL4CYC_SHIFT)         /*!< PWMA_SM0CVAL4CYC: CVAL4CYC Mask         */
#define PWMA_SM0CVAL4CYC_CVAL4CYC_SHIFT          0                                                   /*!< PWMA_SM0CVAL4CYC: CVAL4CYC Position     */
#define PWMA_SM0CVAL4CYC_CVAL4CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL4CYC_CVAL4CYC_SHIFT))&PWMA_SM0CVAL4CYC_CVAL4CYC_MASK) /*!< PWMA_SM0CVAL4CYC                        */
/* ------- SM0CVAL5 Bit Fields                      ------ */
#define PWMA_SM0CVAL5_CAPTVAL5_MASK              (0xFFFFUL << PWMA_SM0CVAL5_CAPTVAL5_SHIFT)          /*!< PWMA_SM0CVAL5: CAPTVAL5 Mask            */
#define PWMA_SM0CVAL5_CAPTVAL5_SHIFT             0                                                   /*!< PWMA_SM0CVAL5: CAPTVAL5 Position        */
#define PWMA_SM0CVAL5_CAPTVAL5(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL5_CAPTVAL5_SHIFT))&PWMA_SM0CVAL5_CAPTVAL5_MASK) /*!< PWMA_SM0CVAL5                           */
/* ------- SM0CVAL5CYC Bit Fields                   ------ */
#define PWMA_SM0CVAL5CYC_CVAL5CYC_MASK           (0x0FUL << PWMA_SM0CVAL5CYC_CVAL5CYC_SHIFT)         /*!< PWMA_SM0CVAL5CYC: CVAL5CYC Mask         */
#define PWMA_SM0CVAL5CYC_CVAL5CYC_SHIFT          0                                                   /*!< PWMA_SM0CVAL5CYC: CVAL5CYC Position     */
#define PWMA_SM0CVAL5CYC_CVAL5CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL5CYC_CVAL5CYC_SHIFT))&PWMA_SM0CVAL5CYC_CVAL5CYC_MASK) /*!< PWMA_SM0CVAL5CYC                        */
/* ------- SM1CNT Bit Fields                        ------ */
#define PWMA_SM1CNT_CNT_MASK                     (0xFFFFUL << PWMA_SM1CNT_CNT_SHIFT)                 /*!< PWMA_SM1CNT: CNT Mask                   */
#define PWMA_SM1CNT_CNT_SHIFT                    0                                                   /*!< PWMA_SM1CNT: CNT Position               */
#define PWMA_SM1CNT_CNT(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CNT_CNT_SHIFT))&PWMA_SM1CNT_CNT_MASK) /*!< PWMA_SM1CNT                             */
/* ------- SM1INIT Bit Fields                       ------ */
#define PWMA_SM1INIT_INIT_MASK                   (0xFFFFUL << PWMA_SM1INIT_INIT_SHIFT)               /*!< PWMA_SM1INIT: INIT Mask                 */
#define PWMA_SM1INIT_INIT_SHIFT                  0                                                   /*!< PWMA_SM1INIT: INIT Position             */
#define PWMA_SM1INIT_INIT(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1INIT_INIT_SHIFT))&PWMA_SM1INIT_INIT_MASK) /*!< PWMA_SM1INIT                            */
/* ------- SM1CTRL2 Bit Fields                      ------ */
#define PWMA_SM1CTRL2_CLK_SEL_MASK               (0x03UL << PWMA_SM1CTRL2_CLK_SEL_SHIFT)             /*!< PWMA_SM1CTRL2: CLK_SEL Mask             */
#define PWMA_SM1CTRL2_CLK_SEL_SHIFT              0                                                   /*!< PWMA_SM1CTRL2: CLK_SEL Position         */
#define PWMA_SM1CTRL2_CLK_SEL(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL2_CLK_SEL_SHIFT))&PWMA_SM1CTRL2_CLK_SEL_MASK) /*!< PWMA_SM1CTRL2                           */
#define PWMA_SM1CTRL2_RELOAD_SEL_MASK            (0x01UL << PWMA_SM1CTRL2_RELOAD_SEL_SHIFT)          /*!< PWMA_SM1CTRL2: RELOAD_SEL Mask          */
#define PWMA_SM1CTRL2_RELOAD_SEL_SHIFT           2                                                   /*!< PWMA_SM1CTRL2: RELOAD_SEL Position      */
#define PWMA_SM1CTRL2_FORCE_SEL_MASK             (0x07UL << PWMA_SM1CTRL2_FORCE_SEL_SHIFT)           /*!< PWMA_SM1CTRL2: FORCE_SEL Mask           */
#define PWMA_SM1CTRL2_FORCE_SEL_SHIFT            3                                                   /*!< PWMA_SM1CTRL2: FORCE_SEL Position       */
#define PWMA_SM1CTRL2_FORCE_SEL(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL2_FORCE_SEL_SHIFT))&PWMA_SM1CTRL2_FORCE_SEL_MASK) /*!< PWMA_SM1CTRL2                           */
#define PWMA_SM1CTRL2_FORCE_MASK                 (0x01UL << PWMA_SM1CTRL2_FORCE_SHIFT)               /*!< PWMA_SM1CTRL2: FORCE Mask               */
#define PWMA_SM1CTRL2_FORCE_SHIFT                6                                                   /*!< PWMA_SM1CTRL2: FORCE Position           */
#define PWMA_SM1CTRL2_FRCEN_MASK                 (0x01UL << PWMA_SM1CTRL2_FRCEN_SHIFT)               /*!< PWMA_SM1CTRL2: FRCEN Mask               */
#define PWMA_SM1CTRL2_FRCEN_SHIFT                7                                                   /*!< PWMA_SM1CTRL2: FRCEN Position           */
#define PWMA_SM1CTRL2_INIT_SEL_MASK              (0x03UL << PWMA_SM1CTRL2_INIT_SEL_SHIFT)            /*!< PWMA_SM1CTRL2: INIT_SEL Mask            */
#define PWMA_SM1CTRL2_INIT_SEL_SHIFT             8                                                   /*!< PWMA_SM1CTRL2: INIT_SEL Position        */
#define PWMA_SM1CTRL2_INIT_SEL(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL2_INIT_SEL_SHIFT))&PWMA_SM1CTRL2_INIT_SEL_MASK) /*!< PWMA_SM1CTRL2                           */
#define PWMA_SM1CTRL2_PWMX_INIT_MASK             (0x01UL << PWMA_SM1CTRL2_PWMX_INIT_SHIFT)           /*!< PWMA_SM1CTRL2: PWMX_INIT Mask           */
#define PWMA_SM1CTRL2_PWMX_INIT_SHIFT            10                                                  /*!< PWMA_SM1CTRL2: PWMX_INIT Position       */
#define PWMA_SM1CTRL2_PWM45_INIT_MASK            (0x01UL << PWMA_SM1CTRL2_PWM45_INIT_SHIFT)          /*!< PWMA_SM1CTRL2: PWM45_INIT Mask          */
#define PWMA_SM1CTRL2_PWM45_INIT_SHIFT           11                                                  /*!< PWMA_SM1CTRL2: PWM45_INIT Position      */
#define PWMA_SM1CTRL2_PWM23_INIT_MASK            (0x01UL << PWMA_SM1CTRL2_PWM23_INIT_SHIFT)          /*!< PWMA_SM1CTRL2: PWM23_INIT Mask          */
#define PWMA_SM1CTRL2_PWM23_INIT_SHIFT           12                                                  /*!< PWMA_SM1CTRL2: PWM23_INIT Position      */
#define PWMA_SM1CTRL2_INDEP_MASK                 (0x01UL << PWMA_SM1CTRL2_INDEP_SHIFT)               /*!< PWMA_SM1CTRL2: INDEP Mask               */
#define PWMA_SM1CTRL2_INDEP_SHIFT                13                                                  /*!< PWMA_SM1CTRL2: INDEP Position           */
#define PWMA_SM1CTRL2_WAITEN_MASK                (0x01UL << PWMA_SM1CTRL2_WAITEN_SHIFT)              /*!< PWMA_SM1CTRL2: WAITEN Mask              */
#define PWMA_SM1CTRL2_WAITEN_SHIFT               14                                                  /*!< PWMA_SM1CTRL2: WAITEN Position          */
#define PWMA_SM1CTRL2_DBGEN_MASK                 (0x01UL << PWMA_SM1CTRL2_DBGEN_SHIFT)               /*!< PWMA_SM1CTRL2: DBGEN Mask               */
#define PWMA_SM1CTRL2_DBGEN_SHIFT                15                                                  /*!< PWMA_SM1CTRL2: DBGEN Position           */
/* ------- SM1CTRL Bit Fields                       ------ */
#define PWMA_SM1CTRL_DBLEN_MASK                  (0x01UL << PWMA_SM1CTRL_DBLEN_SHIFT)                /*!< PWMA_SM1CTRL: DBLEN Mask                */
#define PWMA_SM1CTRL_DBLEN_SHIFT                 0                                                   /*!< PWMA_SM1CTRL: DBLEN Position            */
#define PWMA_SM1CTRL_DBLX_MASK                   (0x01UL << PWMA_SM1CTRL_DBLX_SHIFT)                 /*!< PWMA_SM1CTRL: DBLX Mask                 */
#define PWMA_SM1CTRL_DBLX_SHIFT                  1                                                   /*!< PWMA_SM1CTRL: DBLX Position             */
#define PWMA_SM1CTRL_LDMOD_MASK                  (0x01UL << PWMA_SM1CTRL_LDMOD_SHIFT)                /*!< PWMA_SM1CTRL: LDMOD Mask                */
#define PWMA_SM1CTRL_LDMOD_SHIFT                 2                                                   /*!< PWMA_SM1CTRL: LDMOD Position            */
#define PWMA_SM1CTRL_PRSC_MASK                   (0x07UL << PWMA_SM1CTRL_PRSC_SHIFT)                 /*!< PWMA_SM1CTRL: PRSC Mask                 */
#define PWMA_SM1CTRL_PRSC_SHIFT                  4                                                   /*!< PWMA_SM1CTRL: PRSC Position             */
#define PWMA_SM1CTRL_PRSC(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL_PRSC_SHIFT))&PWMA_SM1CTRL_PRSC_MASK) /*!< PWMA_SM1CTRL                            */
#define PWMA_SM1CTRL_DT_MASK                     (0x03UL << PWMA_SM1CTRL_DT_SHIFT)                   /*!< PWMA_SM1CTRL: DT Mask                   */
#define PWMA_SM1CTRL_DT_SHIFT                    8                                                   /*!< PWMA_SM1CTRL: DT Position               */
#define PWMA_SM1CTRL_DT(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL_DT_SHIFT))&PWMA_SM1CTRL_DT_MASK) /*!< PWMA_SM1CTRL                            */
#define PWMA_SM1CTRL_FULL_MASK                   (0x01UL << PWMA_SM1CTRL_FULL_SHIFT)                 /*!< PWMA_SM1CTRL: FULL Mask                 */
#define PWMA_SM1CTRL_FULL_SHIFT                  10                                                  /*!< PWMA_SM1CTRL: FULL Position             */
#define PWMA_SM1CTRL_HALF_MASK                   (0x01UL << PWMA_SM1CTRL_HALF_SHIFT)                 /*!< PWMA_SM1CTRL: HALF Mask                 */
#define PWMA_SM1CTRL_HALF_SHIFT                  11                                                  /*!< PWMA_SM1CTRL: HALF Position             */
#define PWMA_SM1CTRL_LDFQ_MASK                   (0x0FUL << PWMA_SM1CTRL_LDFQ_SHIFT)                 /*!< PWMA_SM1CTRL: LDFQ Mask                 */
#define PWMA_SM1CTRL_LDFQ_SHIFT                  12                                                  /*!< PWMA_SM1CTRL: LDFQ Position             */
#define PWMA_SM1CTRL_LDFQ(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL_LDFQ_SHIFT))&PWMA_SM1CTRL_LDFQ_MASK) /*!< PWMA_SM1CTRL                            */
/* ------- SM1VAL0 Bit Fields                       ------ */
#define PWMA_SM1VAL0_VAL0_MASK                   (0xFFFFUL << PWMA_SM1VAL0_VAL0_SHIFT)               /*!< PWMA_SM1VAL0: VAL0 Mask                 */
#define PWMA_SM1VAL0_VAL0_SHIFT                  0                                                   /*!< PWMA_SM1VAL0: VAL0 Position             */
#define PWMA_SM1VAL0_VAL0(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1VAL0_VAL0_SHIFT))&PWMA_SM1VAL0_VAL0_MASK) /*!< PWMA_SM1VAL0                            */
/* ------- SM1FRACVAL1 Bit Fields                   ------ */
#define PWMA_SM1FRACVAL1_FRACVAL1_MASK           (0x1FUL << PWMA_SM1FRACVAL1_FRACVAL1_SHIFT)         /*!< PWMA_SM1FRACVAL1: FRACVAL1 Mask         */
#define PWMA_SM1FRACVAL1_FRACVAL1_SHIFT          11                                                  /*!< PWMA_SM1FRACVAL1: FRACVAL1 Position     */
#define PWMA_SM1FRACVAL1_FRACVAL1(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1FRACVAL1_FRACVAL1_SHIFT))&PWMA_SM1FRACVAL1_FRACVAL1_MASK) /*!< PWMA_SM1FRACVAL1                        */
/* ------- SM1VAL1 Bit Fields                       ------ */
#define PWMA_SM1VAL1_VAL1_MASK                   (0xFFFFUL << PWMA_SM1VAL1_VAL1_SHIFT)               /*!< PWMA_SM1VAL1: VAL1 Mask                 */
#define PWMA_SM1VAL1_VAL1_SHIFT                  0                                                   /*!< PWMA_SM1VAL1: VAL1 Position             */
#define PWMA_SM1VAL1_VAL1(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1VAL1_VAL1_SHIFT))&PWMA_SM1VAL1_VAL1_MASK) /*!< PWMA_SM1VAL1                            */
/* ------- SM1FRACVAL2 Bit Fields                   ------ */
#define PWMA_SM1FRACVAL2_FRACVAL2_MASK           (0x1FUL << PWMA_SM1FRACVAL2_FRACVAL2_SHIFT)         /*!< PWMA_SM1FRACVAL2: FRACVAL2 Mask         */
#define PWMA_SM1FRACVAL2_FRACVAL2_SHIFT          11                                                  /*!< PWMA_SM1FRACVAL2: FRACVAL2 Position     */
#define PWMA_SM1FRACVAL2_FRACVAL2(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1FRACVAL2_FRACVAL2_SHIFT))&PWMA_SM1FRACVAL2_FRACVAL2_MASK) /*!< PWMA_SM1FRACVAL2                        */
/* ------- SM1VAL2 Bit Fields                       ------ */
#define PWMA_SM1VAL2_VAL2_MASK                   (0xFFFFUL << PWMA_SM1VAL2_VAL2_SHIFT)               /*!< PWMA_SM1VAL2: VAL2 Mask                 */
#define PWMA_SM1VAL2_VAL2_SHIFT                  0                                                   /*!< PWMA_SM1VAL2: VAL2 Position             */
#define PWMA_SM1VAL2_VAL2(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1VAL2_VAL2_SHIFT))&PWMA_SM1VAL2_VAL2_MASK) /*!< PWMA_SM1VAL2                            */
/* ------- SM1FRACVAL3 Bit Fields                   ------ */
#define PWMA_SM1FRACVAL3_FRACVAL3_MASK           (0x1FUL << PWMA_SM1FRACVAL3_FRACVAL3_SHIFT)         /*!< PWMA_SM1FRACVAL3: FRACVAL3 Mask         */
#define PWMA_SM1FRACVAL3_FRACVAL3_SHIFT          11                                                  /*!< PWMA_SM1FRACVAL3: FRACVAL3 Position     */
#define PWMA_SM1FRACVAL3_FRACVAL3(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1FRACVAL3_FRACVAL3_SHIFT))&PWMA_SM1FRACVAL3_FRACVAL3_MASK) /*!< PWMA_SM1FRACVAL3                        */
/* ------- SM1VAL3 Bit Fields                       ------ */
#define PWMA_SM1VAL3_VAL3_MASK                   (0xFFFFUL << PWMA_SM1VAL3_VAL3_SHIFT)               /*!< PWMA_SM1VAL3: VAL3 Mask                 */
#define PWMA_SM1VAL3_VAL3_SHIFT                  0                                                   /*!< PWMA_SM1VAL3: VAL3 Position             */
#define PWMA_SM1VAL3_VAL3(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1VAL3_VAL3_SHIFT))&PWMA_SM1VAL3_VAL3_MASK) /*!< PWMA_SM1VAL3                            */
/* ------- SM1FRACVAL4 Bit Fields                   ------ */
#define PWMA_SM1FRACVAL4_FRACVAL4_MASK           (0x1FUL << PWMA_SM1FRACVAL4_FRACVAL4_SHIFT)         /*!< PWMA_SM1FRACVAL4: FRACVAL4 Mask         */
#define PWMA_SM1FRACVAL4_FRACVAL4_SHIFT          11                                                  /*!< PWMA_SM1FRACVAL4: FRACVAL4 Position     */
#define PWMA_SM1FRACVAL4_FRACVAL4(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1FRACVAL4_FRACVAL4_SHIFT))&PWMA_SM1FRACVAL4_FRACVAL4_MASK) /*!< PWMA_SM1FRACVAL4                        */
/* ------- SM1VAL4 Bit Fields                       ------ */
#define PWMA_SM1VAL4_VAL4_MASK                   (0xFFFFUL << PWMA_SM1VAL4_VAL4_SHIFT)               /*!< PWMA_SM1VAL4: VAL4 Mask                 */
#define PWMA_SM1VAL4_VAL4_SHIFT                  0                                                   /*!< PWMA_SM1VAL4: VAL4 Position             */
#define PWMA_SM1VAL4_VAL4(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1VAL4_VAL4_SHIFT))&PWMA_SM1VAL4_VAL4_MASK) /*!< PWMA_SM1VAL4                            */
/* ------- SM1FRACVAL5 Bit Fields                   ------ */
#define PWMA_SM1FRACVAL5_FRACVAL5_MASK           (0x1FUL << PWMA_SM1FRACVAL5_FRACVAL5_SHIFT)         /*!< PWMA_SM1FRACVAL5: FRACVAL5 Mask         */
#define PWMA_SM1FRACVAL5_FRACVAL5_SHIFT          11                                                  /*!< PWMA_SM1FRACVAL5: FRACVAL5 Position     */
#define PWMA_SM1FRACVAL5_FRACVAL5(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1FRACVAL5_FRACVAL5_SHIFT))&PWMA_SM1FRACVAL5_FRACVAL5_MASK) /*!< PWMA_SM1FRACVAL5                        */
/* ------- SM1VAL5 Bit Fields                       ------ */
#define PWMA_SM1VAL5_VAL5_MASK                   (0xFFFFUL << PWMA_SM1VAL5_VAL5_SHIFT)               /*!< PWMA_SM1VAL5: VAL5 Mask                 */
#define PWMA_SM1VAL5_VAL5_SHIFT                  0                                                   /*!< PWMA_SM1VAL5: VAL5 Position             */
#define PWMA_SM1VAL5_VAL5(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1VAL5_VAL5_SHIFT))&PWMA_SM1VAL5_VAL5_MASK) /*!< PWMA_SM1VAL5                            */
/* ------- SM1FRCTRL Bit Fields                     ------ */
#define PWMA_SM1FRCTRL_FRAC1_EN_MASK             (0x01UL << PWMA_SM1FRCTRL_FRAC1_EN_SHIFT)           /*!< PWMA_SM1FRCTRL: FRAC1_EN Mask           */
#define PWMA_SM1FRCTRL_FRAC1_EN_SHIFT            1                                                   /*!< PWMA_SM1FRCTRL: FRAC1_EN Position       */
#define PWMA_SM1FRCTRL_FRAC23_EN_MASK            (0x01UL << PWMA_SM1FRCTRL_FRAC23_EN_SHIFT)          /*!< PWMA_SM1FRCTRL: FRAC23_EN Mask          */
#define PWMA_SM1FRCTRL_FRAC23_EN_SHIFT           2                                                   /*!< PWMA_SM1FRCTRL: FRAC23_EN Position      */
#define PWMA_SM1FRCTRL_FRAC45_EN_MASK            (0x01UL << PWMA_SM1FRCTRL_FRAC45_EN_SHIFT)          /*!< PWMA_SM1FRCTRL: FRAC45_EN Mask          */
#define PWMA_SM1FRCTRL_FRAC45_EN_SHIFT           4                                                   /*!< PWMA_SM1FRCTRL: FRAC45_EN Position      */
#define PWMA_SM1FRCTRL_FRAC_PU_MASK              (0x01UL << PWMA_SM1FRCTRL_FRAC_PU_SHIFT)            /*!< PWMA_SM1FRCTRL: FRAC_PU Mask            */
#define PWMA_SM1FRCTRL_FRAC_PU_SHIFT             8                                                   /*!< PWMA_SM1FRCTRL: FRAC_PU Position        */
#define PWMA_SM1FRCTRL_TEST_MASK                 (0x01UL << PWMA_SM1FRCTRL_TEST_SHIFT)               /*!< PWMA_SM1FRCTRL: TEST Mask               */
#define PWMA_SM1FRCTRL_TEST_SHIFT                15                                                  /*!< PWMA_SM1FRCTRL: TEST Position           */
/* ------- SM1OCTRL Bit Fields                      ------ */
#define PWMA_SM1OCTRL_PWMXFS_MASK                (0x03UL << PWMA_SM1OCTRL_PWMXFS_SHIFT)              /*!< PWMA_SM1OCTRL: PWMXFS Mask              */
#define PWMA_SM1OCTRL_PWMXFS_SHIFT               0                                                   /*!< PWMA_SM1OCTRL: PWMXFS Position          */
#define PWMA_SM1OCTRL_PWMXFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM1OCTRL_PWMXFS_SHIFT))&PWMA_SM1OCTRL_PWMXFS_MASK) /*!< PWMA_SM1OCTRL                           */
#define PWMA_SM1OCTRL_PWMBFS_MASK                (0x03UL << PWMA_SM1OCTRL_PWMBFS_SHIFT)              /*!< PWMA_SM1OCTRL: PWMBFS Mask              */
#define PWMA_SM1OCTRL_PWMBFS_SHIFT               2                                                   /*!< PWMA_SM1OCTRL: PWMBFS Position          */
#define PWMA_SM1OCTRL_PWMBFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM1OCTRL_PWMBFS_SHIFT))&PWMA_SM1OCTRL_PWMBFS_MASK) /*!< PWMA_SM1OCTRL                           */
#define PWMA_SM1OCTRL_PWMAFS_MASK                (0x03UL << PWMA_SM1OCTRL_PWMAFS_SHIFT)              /*!< PWMA_SM1OCTRL: PWMAFS Mask              */
#define PWMA_SM1OCTRL_PWMAFS_SHIFT               4                                                   /*!< PWMA_SM1OCTRL: PWMAFS Position          */
#define PWMA_SM1OCTRL_PWMAFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM1OCTRL_PWMAFS_SHIFT))&PWMA_SM1OCTRL_PWMAFS_MASK) /*!< PWMA_SM1OCTRL                           */
#define PWMA_SM1OCTRL_POLX_MASK                  (0x01UL << PWMA_SM1OCTRL_POLX_SHIFT)                /*!< PWMA_SM1OCTRL: POLX Mask                */
#define PWMA_SM1OCTRL_POLX_SHIFT                 8                                                   /*!< PWMA_SM1OCTRL: POLX Position            */
#define PWMA_SM1OCTRL_POLB_MASK                  (0x01UL << PWMA_SM1OCTRL_POLB_SHIFT)                /*!< PWMA_SM1OCTRL: POLB Mask                */
#define PWMA_SM1OCTRL_POLB_SHIFT                 9                                                   /*!< PWMA_SM1OCTRL: POLB Position            */
#define PWMA_SM1OCTRL_POLA_MASK                  (0x01UL << PWMA_SM1OCTRL_POLA_SHIFT)                /*!< PWMA_SM1OCTRL: POLA Mask                */
#define PWMA_SM1OCTRL_POLA_SHIFT                 10                                                  /*!< PWMA_SM1OCTRL: POLA Position            */
#define PWMA_SM1OCTRL_PWMX_IN_MASK               (0x01UL << PWMA_SM1OCTRL_PWMX_IN_SHIFT)             /*!< PWMA_SM1OCTRL: PWMX_IN Mask             */
#define PWMA_SM1OCTRL_PWMX_IN_SHIFT              13                                                  /*!< PWMA_SM1OCTRL: PWMX_IN Position         */
#define PWMA_SM1OCTRL_PWMB_IN_MASK               (0x01UL << PWMA_SM1OCTRL_PWMB_IN_SHIFT)             /*!< PWMA_SM1OCTRL: PWMB_IN Mask             */
#define PWMA_SM1OCTRL_PWMB_IN_SHIFT              14                                                  /*!< PWMA_SM1OCTRL: PWMB_IN Position         */
#define PWMA_SM1OCTRL_PWMA_IN_MASK               (0x01UL << PWMA_SM1OCTRL_PWMA_IN_SHIFT)             /*!< PWMA_SM1OCTRL: PWMA_IN Mask             */
#define PWMA_SM1OCTRL_PWMA_IN_SHIFT              15                                                  /*!< PWMA_SM1OCTRL: PWMA_IN Position         */
/* ------- SM1STS Bit Fields                        ------ */
#define PWMA_SM1STS_CMPF_MASK                    (0x3FUL << PWMA_SM1STS_CMPF_SHIFT)                  /*!< PWMA_SM1STS: CMPF Mask                  */
#define PWMA_SM1STS_CMPF_SHIFT                   0                                                   /*!< PWMA_SM1STS: CMPF Position              */
#define PWMA_SM1STS_CMPF(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM1STS_CMPF_SHIFT))&PWMA_SM1STS_CMPF_MASK) /*!< PWMA_SM1STS                             */
