podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV44F15.h
#define PWMA_SM3FRACVAL3_FRACVAL3_MASK           (0x1FUL << PWMA_SM3FRACVAL3_FRACVAL3_SHIFT)         /*!< PWMA_SM3FRACVAL3: FRACVAL3 Mask         */
#define PWMA_SM3FRACVAL3_FRACVAL3_SHIFT          11                                                  /*!< PWMA_SM3FRACVAL3: FRACVAL3 Position     */
#define PWMA_SM3FRACVAL3_FRACVAL3(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3FRACVAL3_FRACVAL3_SHIFT))&PWMA_SM3FRACVAL3_FRACVAL3_MASK) /*!< PWMA_SM3FRACVAL3                        */
/* ------- SM3VAL3 Bit Fields                       ------ */
#define PWMA_SM3VAL3_VAL3_MASK                   (0xFFFFUL << PWMA_SM3VAL3_VAL3_SHIFT)               /*!< PWMA_SM3VAL3: VAL3 Mask                 */
#define PWMA_SM3VAL3_VAL3_SHIFT                  0                                                   /*!< PWMA_SM3VAL3: VAL3 Position             */
#define PWMA_SM3VAL3_VAL3(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3VAL3_VAL3_SHIFT))&PWMA_SM3VAL3_VAL3_MASK) /*!< PWMA_SM3VAL3                            */
/* ------- SM3FRACVAL4 Bit Fields                   ------ */
#define PWMA_SM3FRACVAL4_FRACVAL4_MASK           (0x1FUL << PWMA_SM3FRACVAL4_FRACVAL4_SHIFT)         /*!< PWMA_SM3FRACVAL4: FRACVAL4 Mask         */
#define PWMA_SM3FRACVAL4_FRACVAL4_SHIFT          11                                                  /*!< PWMA_SM3FRACVAL4: FRACVAL4 Position     */
#define PWMA_SM3FRACVAL4_FRACVAL4(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3FRACVAL4_FRACVAL4_SHIFT))&PWMA_SM3FRACVAL4_FRACVAL4_MASK) /*!< PWMA_SM3FRACVAL4                        */
/* ------- SM3VAL4 Bit Fields                       ------ */
#define PWMA_SM3VAL4_VAL4_MASK                   (0xFFFFUL << PWMA_SM3VAL4_VAL4_SHIFT)               /*!< PWMA_SM3VAL4: VAL4 Mask                 */
#define PWMA_SM3VAL4_VAL4_SHIFT                  0                                                   /*!< PWMA_SM3VAL4: VAL4 Position             */
#define PWMA_SM3VAL4_VAL4(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3VAL4_VAL4_SHIFT))&PWMA_SM3VAL4_VAL4_MASK) /*!< PWMA_SM3VAL4                            */
/* ------- SM3FRACVAL5 Bit Fields                   ------ */
#define PWMA_SM3FRACVAL5_FRACVAL5_MASK           (0x1FUL << PWMA_SM3FRACVAL5_FRACVAL5_SHIFT)         /*!< PWMA_SM3FRACVAL5: FRACVAL5 Mask         */
#define PWMA_SM3FRACVAL5_FRACVAL5_SHIFT          11                                                  /*!< PWMA_SM3FRACVAL5: FRACVAL5 Position     */
#define PWMA_SM3FRACVAL5_FRACVAL5(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3FRACVAL5_FRACVAL5_SHIFT))&PWMA_SM3FRACVAL5_FRACVAL5_MASK) /*!< PWMA_SM3FRACVAL5                        */
/* ------- SM3VAL5 Bit Fields                       ------ */
#define PWMA_SM3VAL5_VAL5_MASK                   (0xFFFFUL << PWMA_SM3VAL5_VAL5_SHIFT)               /*!< PWMA_SM3VAL5: VAL5 Mask                 */
#define PWMA_SM3VAL5_VAL5_SHIFT                  0                                                   /*!< PWMA_SM3VAL5: VAL5 Position             */
#define PWMA_SM3VAL5_VAL5(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3VAL5_VAL5_SHIFT))&PWMA_SM3VAL5_VAL5_MASK) /*!< PWMA_SM3VAL5                            */
/* ------- SM3FRCTRL Bit Fields                     ------ */
#define PWMA_SM3FRCTRL_FRAC1_EN_MASK             (0x01UL << PWMA_SM3FRCTRL_FRAC1_EN_SHIFT)           /*!< PWMA_SM3FRCTRL: FRAC1_EN Mask           */
#define PWMA_SM3FRCTRL_FRAC1_EN_SHIFT            1                                                   /*!< PWMA_SM3FRCTRL: FRAC1_EN Position       */
#define PWMA_SM3FRCTRL_FRAC23_EN_MASK            (0x01UL << PWMA_SM3FRCTRL_FRAC23_EN_SHIFT)          /*!< PWMA_SM3FRCTRL: FRAC23_EN Mask          */
#define PWMA_SM3FRCTRL_FRAC23_EN_SHIFT           2                                                   /*!< PWMA_SM3FRCTRL: FRAC23_EN Position      */
#define PWMA_SM3FRCTRL_FRAC45_EN_MASK            (0x01UL << PWMA_SM3FRCTRL_FRAC45_EN_SHIFT)          /*!< PWMA_SM3FRCTRL: FRAC45_EN Mask          */
#define PWMA_SM3FRCTRL_FRAC45_EN_SHIFT           4                                                   /*!< PWMA_SM3FRCTRL: FRAC45_EN Position      */
#define PWMA_SM3FRCTRL_FRAC_PU_MASK              (0x01UL << PWMA_SM3FRCTRL_FRAC_PU_SHIFT)            /*!< PWMA_SM3FRCTRL: FRAC_PU Mask            */
#define PWMA_SM3FRCTRL_FRAC_PU_SHIFT             8                                                   /*!< PWMA_SM3FRCTRL: FRAC_PU Position        */
#define PWMA_SM3FRCTRL_TEST_MASK                 (0x01UL << PWMA_SM3FRCTRL_TEST_SHIFT)               /*!< PWMA_SM3FRCTRL: TEST Mask               */
#define PWMA_SM3FRCTRL_TEST_SHIFT                15                                                  /*!< PWMA_SM3FRCTRL: TEST Position           */
/* ------- SM3OCTRL Bit Fields                      ------ */
#define PWMA_SM3OCTRL_PWMXFS_MASK                (0x03UL << PWMA_SM3OCTRL_PWMXFS_SHIFT)              /*!< PWMA_SM3OCTRL: PWMXFS Mask              */
#define PWMA_SM3OCTRL_PWMXFS_SHIFT               0                                                   /*!< PWMA_SM3OCTRL: PWMXFS Position          */
#define PWMA_SM3OCTRL_PWMXFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM3OCTRL_PWMXFS_SHIFT))&PWMA_SM3OCTRL_PWMXFS_MASK) /*!< PWMA_SM3OCTRL                           */
#define PWMA_SM3OCTRL_PWMBFS_MASK                (0x03UL << PWMA_SM3OCTRL_PWMBFS_SHIFT)              /*!< PWMA_SM3OCTRL: PWMBFS Mask              */
#define PWMA_SM3OCTRL_PWMBFS_SHIFT               2                                                   /*!< PWMA_SM3OCTRL: PWMBFS Position          */
#define PWMA_SM3OCTRL_PWMBFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM3OCTRL_PWMBFS_SHIFT))&PWMA_SM3OCTRL_PWMBFS_MASK) /*!< PWMA_SM3OCTRL                           */
#define PWMA_SM3OCTRL_PWMAFS_MASK                (0x03UL << PWMA_SM3OCTRL_PWMAFS_SHIFT)              /*!< PWMA_SM3OCTRL: PWMAFS Mask              */
#define PWMA_SM3OCTRL_PWMAFS_SHIFT               4                                                   /*!< PWMA_SM3OCTRL: PWMAFS Position          */
#define PWMA_SM3OCTRL_PWMAFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM3OCTRL_PWMAFS_SHIFT))&PWMA_SM3OCTRL_PWMAFS_MASK) /*!< PWMA_SM3OCTRL                           */
#define PWMA_SM3OCTRL_POLX_MASK                  (0x01UL << PWMA_SM3OCTRL_POLX_SHIFT)                /*!< PWMA_SM3OCTRL: POLX Mask                */
#define PWMA_SM3OCTRL_POLX_SHIFT                 8                                                   /*!< PWMA_SM3OCTRL: POLX Position            */
#define PWMA_SM3OCTRL_POLB_MASK                  (0x01UL << PWMA_SM3OCTRL_POLB_SHIFT)                /*!< PWMA_SM3OCTRL: POLB Mask                */
#define PWMA_SM3OCTRL_POLB_SHIFT                 9                                                   /*!< PWMA_SM3OCTRL: POLB Position            */
#define PWMA_SM3OCTRL_POLA_MASK                  (0x01UL << PWMA_SM3OCTRL_POLA_SHIFT)                /*!< PWMA_SM3OCTRL: POLA Mask                */
#define PWMA_SM3OCTRL_POLA_SHIFT                 10                                                  /*!< PWMA_SM3OCTRL: POLA Position            */
#define PWMA_SM3OCTRL_PWMX_IN_MASK               (0x01UL << PWMA_SM3OCTRL_PWMX_IN_SHIFT)             /*!< PWMA_SM3OCTRL: PWMX_IN Mask             */
#define PWMA_SM3OCTRL_PWMX_IN_SHIFT              13                                                  /*!< PWMA_SM3OCTRL: PWMX_IN Position         */
#define PWMA_SM3OCTRL_PWMB_IN_MASK               (0x01UL << PWMA_SM3OCTRL_PWMB_IN_SHIFT)             /*!< PWMA_SM3OCTRL: PWMB_IN Mask             */
#define PWMA_SM3OCTRL_PWMB_IN_SHIFT              14                                                  /*!< PWMA_SM3OCTRL: PWMB_IN Position         */
#define PWMA_SM3OCTRL_PWMA_IN_MASK               (0x01UL << PWMA_SM3OCTRL_PWMA_IN_SHIFT)             /*!< PWMA_SM3OCTRL: PWMA_IN Mask             */
#define PWMA_SM3OCTRL_PWMA_IN_SHIFT              15                                                  /*!< PWMA_SM3OCTRL: PWMA_IN Position         */
/* ------- SM3STS Bit Fields                        ------ */
#define PWMA_SM3STS_CMPF_MASK                    (0x3FUL << PWMA_SM3STS_CMPF_SHIFT)                  /*!< PWMA_SM3STS: CMPF Mask                  */
#define PWMA_SM3STS_CMPF_SHIFT                   0                                                   /*!< PWMA_SM3STS: CMPF Position              */
#define PWMA_SM3STS_CMPF(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM3STS_CMPF_SHIFT))&PWMA_SM3STS_CMPF_MASK) /*!< PWMA_SM3STS                             */
#define PWMA_SM3STS_CFX0_MASK                    (0x01UL << PWMA_SM3STS_CFX0_SHIFT)                  /*!< PWMA_SM3STS: CFX0 Mask                  */
#define PWMA_SM3STS_CFX0_SHIFT                   6                                                   /*!< PWMA_SM3STS: CFX0 Position              */
#define PWMA_SM3STS_CFX1_MASK                    (0x01UL << PWMA_SM3STS_CFX1_SHIFT)                  /*!< PWMA_SM3STS: CFX1 Mask                  */
#define PWMA_SM3STS_CFX1_SHIFT                   7                                                   /*!< PWMA_SM3STS: CFX1 Position              */
#define PWMA_SM3STS_CFB0_MASK                    (0x01UL << PWMA_SM3STS_CFB0_SHIFT)                  /*!< PWMA_SM3STS: CFB0 Mask                  */
#define PWMA_SM3STS_CFB0_SHIFT                   8                                                   /*!< PWMA_SM3STS: CFB0 Position              */
#define PWMA_SM3STS_CFB1_MASK                    (0x01UL << PWMA_SM3STS_CFB1_SHIFT)                  /*!< PWMA_SM3STS: CFB1 Mask                  */
#define PWMA_SM3STS_CFB1_SHIFT                   9                                                   /*!< PWMA_SM3STS: CFB1 Position              */
#define PWMA_SM3STS_CFA0_MASK                    (0x01UL << PWMA_SM3STS_CFA0_SHIFT)                  /*!< PWMA_SM3STS: CFA0 Mask                  */
#define PWMA_SM3STS_CFA0_SHIFT                   10                                                  /*!< PWMA_SM3STS: CFA0 Position              */
#define PWMA_SM3STS_CFA1_MASK                    (0x01UL << PWMA_SM3STS_CFA1_SHIFT)                  /*!< PWMA_SM3STS: CFA1 Mask                  */
#define PWMA_SM3STS_CFA1_SHIFT                   11                                                  /*!< PWMA_SM3STS: CFA1 Position              */
#define PWMA_SM3STS_RF_MASK                      (0x01UL << PWMA_SM3STS_RF_SHIFT)                    /*!< PWMA_SM3STS: RF Mask                    */
#define PWMA_SM3STS_RF_SHIFT                     12                                                  /*!< PWMA_SM3STS: RF Position                */
#define PWMA_SM3STS_REF_MASK                     (0x01UL << PWMA_SM3STS_REF_SHIFT)                   /*!< PWMA_SM3STS: REF Mask                   */
#define PWMA_SM3STS_REF_SHIFT                    13                                                  /*!< PWMA_SM3STS: REF Position               */
#define PWMA_SM3STS_RUF_MASK                     (0x01UL << PWMA_SM3STS_RUF_SHIFT)                   /*!< PWMA_SM3STS: RUF Mask                   */
#define PWMA_SM3STS_RUF_SHIFT                    14                                                  /*!< PWMA_SM3STS: RUF Position               */
/* ------- SM3INTEN Bit Fields                      ------ */
#define PWMA_SM3INTEN_CMPIE_MASK                 (0x3FUL << PWMA_SM3INTEN_CMPIE_SHIFT)               /*!< PWMA_SM3INTEN: CMPIE Mask               */
#define PWMA_SM3INTEN_CMPIE_SHIFT                0                                                   /*!< PWMA_SM3INTEN: CMPIE Position           */
#define PWMA_SM3INTEN_CMPIE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM3INTEN_CMPIE_SHIFT))&PWMA_SM3INTEN_CMPIE_MASK) /*!< PWMA_SM3INTEN                           */
#define PWMA_SM3INTEN_CX0IE_MASK                 (0x01UL << PWMA_SM3INTEN_CX0IE_SHIFT)               /*!< PWMA_SM3INTEN: CX0IE Mask               */
#define PWMA_SM3INTEN_CX0IE_SHIFT                6                                                   /*!< PWMA_SM3INTEN: CX0IE Position           */
#define PWMA_SM3INTEN_CX1IE_MASK                 (0x01UL << PWMA_SM3INTEN_CX1IE_SHIFT)               /*!< PWMA_SM3INTEN: CX1IE Mask               */
#define PWMA_SM3INTEN_CX1IE_SHIFT                7                                                   /*!< PWMA_SM3INTEN: CX1IE Position           */
#define PWMA_SM3INTEN_CB0IE_MASK                 (0x01UL << PWMA_SM3INTEN_CB0IE_SHIFT)               /*!< PWMA_SM3INTEN: CB0IE Mask               */
#define PWMA_SM3INTEN_CB0IE_SHIFT                8                                                   /*!< PWMA_SM3INTEN: CB0IE Position           */
#define PWMA_SM3INTEN_CB1IE_MASK                 (0x01UL << PWMA_SM3INTEN_CB1IE_SHIFT)               /*!< PWMA_SM3INTEN: CB1IE Mask               */
#define PWMA_SM3INTEN_CB1IE_SHIFT                9                                                   /*!< PWMA_SM3INTEN: CB1IE Position           */
#define PWMA_SM3INTEN_CA0IE_MASK                 (0x01UL << PWMA_SM3INTEN_CA0IE_SHIFT)               /*!< PWMA_SM3INTEN: CA0IE Mask               */
#define PWMA_SM3INTEN_CA0IE_SHIFT                10                                                  /*!< PWMA_SM3INTEN: CA0IE Position           */
#define PWMA_SM3INTEN_CA1IE_MASK                 (0x01UL << PWMA_SM3INTEN_CA1IE_SHIFT)               /*!< PWMA_SM3INTEN: CA1IE Mask               */
#define PWMA_SM3INTEN_CA1IE_SHIFT                11                                                  /*!< PWMA_SM3INTEN: CA1IE Position           */
#define PWMA_SM3INTEN_RIE_MASK                   (0x01UL << PWMA_SM3INTEN_RIE_SHIFT)                 /*!< PWMA_SM3INTEN: RIE Mask                 */
#define PWMA_SM3INTEN_RIE_SHIFT                  12                                                  /*!< PWMA_SM3INTEN: RIE Position             */
#define PWMA_SM3INTEN_REIE_MASK                  (0x01UL << PWMA_SM3INTEN_REIE_SHIFT)                /*!< PWMA_SM3INTEN: REIE Mask                */
#define PWMA_SM3INTEN_REIE_SHIFT                 13                                                  /*!< PWMA_SM3INTEN: REIE Position            */
/* ------- SM3DMAEN Bit Fields                      ------ */
#define PWMA_SM3DMAEN_CX0DE_MASK                 (0x01UL << PWMA_SM3DMAEN_CX0DE_SHIFT)               /*!< PWMA_SM3DMAEN: CX0DE Mask               */
#define PWMA_SM3DMAEN_CX0DE_SHIFT                0                                                   /*!< PWMA_SM3DMAEN: CX0DE Position           */
#define PWMA_SM3DMAEN_CX1DE_MASK                 (0x01UL << PWMA_SM3DMAEN_CX1DE_SHIFT)               /*!< PWMA_SM3DMAEN: CX1DE Mask               */
#define PWMA_SM3DMAEN_CX1DE_SHIFT                1                                                   /*!< PWMA_SM3DMAEN: CX1DE Position           */
#define PWMA_SM3DMAEN_CB0DE_MASK                 (0x01UL << PWMA_SM3DMAEN_CB0DE_SHIFT)               /*!< PWMA_SM3DMAEN: CB0DE Mask               */
#define PWMA_SM3DMAEN_CB0DE_SHIFT                2                                                   /*!< PWMA_SM3DMAEN: CB0DE Position           */
#define PWMA_SM3DMAEN_CB1DE_MASK                 (0x01UL << PWMA_SM3DMAEN_CB1DE_SHIFT)               /*!< PWMA_SM3DMAEN: CB1DE Mask               */
#define PWMA_SM3DMAEN_CB1DE_SHIFT                3                                                   /*!< PWMA_SM3DMAEN: CB1DE Position           */
#define PWMA_SM3DMAEN_CA0DE_MASK                 (0x01UL << PWMA_SM3DMAEN_CA0DE_SHIFT)               /*!< PWMA_SM3DMAEN: CA0DE Mask               */
#define PWMA_SM3DMAEN_CA0DE_SHIFT                4                                                   /*!< PWMA_SM3DMAEN: CA0DE Position           */
#define PWMA_SM3DMAEN_CA1DE_MASK                 (0x01UL << PWMA_SM3DMAEN_CA1DE_SHIFT)               /*!< PWMA_SM3DMAEN: CA1DE Mask               */
#define PWMA_SM3DMAEN_CA1DE_SHIFT                5                                                   /*!< PWMA_SM3DMAEN: CA1DE Position           */
#define PWMA_SM3DMAEN_CAPTDE_MASK                (0x03UL << PWMA_SM3DMAEN_CAPTDE_SHIFT)              /*!< PWMA_SM3DMAEN: CAPTDE Mask              */
#define PWMA_SM3DMAEN_CAPTDE_SHIFT               6                                                   /*!< PWMA_SM3DMAEN: CAPTDE Position          */
#define PWMA_SM3DMAEN_CAPTDE(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM3DMAEN_CAPTDE_SHIFT))&PWMA_SM3DMAEN_CAPTDE_MASK) /*!< PWMA_SM3DMAEN                           */
#define PWMA_SM3DMAEN_FAND_MASK                  (0x01UL << PWMA_SM3DMAEN_FAND_SHIFT)                /*!< PWMA_SM3DMAEN: FAND Mask                */
#define PWMA_SM3DMAEN_FAND_SHIFT                 8                                                   /*!< PWMA_SM3DMAEN: FAND Position            */
#define PWMA_SM3DMAEN_VALDE_MASK                 (0x01UL << PWMA_SM3DMAEN_VALDE_SHIFT)               /*!< PWMA_SM3DMAEN: VALDE Mask               */
#define PWMA_SM3DMAEN_VALDE_SHIFT                9                                                   /*!< PWMA_SM3DMAEN: VALDE Position           */
/* ------- SM3TCTRL Bit Fields                      ------ */
#define PWMA_SM3TCTRL_OUT_TRIG_EN_MASK           (0x3FUL << PWMA_SM3TCTRL_OUT_TRIG_EN_SHIFT)         /*!< PWMA_SM3TCTRL: OUT_TRIG_EN Mask         */
#define PWMA_SM3TCTRL_OUT_TRIG_EN_SHIFT          0                                                   /*!< PWMA_SM3TCTRL: OUT_TRIG_EN Position     */
#define PWMA_SM3TCTRL_OUT_TRIG_EN(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3TCTRL_OUT_TRIG_EN_SHIFT))&PWMA_SM3TCTRL_OUT_TRIG_EN_MASK) /*!< PWMA_SM3TCTRL                           */
#define PWMA_SM3TCTRL_PWBOT1_MASK                (0x01UL << PWMA_SM3TCTRL_PWBOT1_SHIFT)              /*!< PWMA_SM3TCTRL: PWBOT1 Mask              */
#define PWMA_SM3TCTRL_PWBOT1_SHIFT               14                                                  /*!< PWMA_SM3TCTRL: PWBOT1 Position          */
#define PWMA_SM3TCTRL_PWAOT0_MASK                (0x01UL << PWMA_SM3TCTRL_PWAOT0_SHIFT)              /*!< PWMA_SM3TCTRL: PWAOT0 Mask              */
#define PWMA_SM3TCTRL_PWAOT0_SHIFT               15                                                  /*!< PWMA_SM3TCTRL: PWAOT0 Position          */
/* ------- SM3DISMAP0 Bit Fields                    ------ */
#define PWMA_SM3DISMAP0_DIS0A_MASK               (0x0FUL << PWMA_SM3DISMAP0_DIS0A_SHIFT)             /*!< PWMA_SM3DISMAP0: DIS0A Mask             */
#define PWMA_SM3DISMAP0_DIS0A_SHIFT              0                                                   /*!< PWMA_SM3DISMAP0: DIS0A Position         */
#define PWMA_SM3DISMAP0_DIS0A(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM3DISMAP0_DIS0A_SHIFT))&PWMA_SM3DISMAP0_DIS0A_MASK) /*!< PWMA_SM3DISMAP0                         */
#define PWMA_SM3DISMAP0_DIS0B_MASK               (0x0FUL << PWMA_SM3DISMAP0_DIS0B_SHIFT)             /*!< PWMA_SM3DISMAP0: DIS0B Mask             */
#define PWMA_SM3DISMAP0_DIS0B_SHIFT              4                                                   /*!< PWMA_SM3DISMAP0: DIS0B Position         */
#define PWMA_SM3DISMAP0_DIS0B(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM3DISMAP0_DIS0B_SHIFT))&PWMA_SM3DISMAP0_DIS0B_MASK) /*!< PWMA_SM3DISMAP0                         */
#define PWMA_SM3DISMAP0_DIS0X_MASK               (0x0FUL << PWMA_SM3DISMAP0_DIS0X_SHIFT)             /*!< PWMA_SM3DISMAP0: DIS0X Mask             */
#define PWMA_SM3DISMAP0_DIS0X_SHIFT              8                                                   /*!< PWMA_SM3DISMAP0: DIS0X Position         */
#define PWMA_SM3DISMAP0_DIS0X(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM3DISMAP0_DIS0X_SHIFT))&PWMA_SM3DISMAP0_DIS0X_MASK) /*!< PWMA_SM3DISMAP0                         */
/* ------- SM3DTCNT Bit Fields                      ------ */
#define PWMA_SM3DTCNT_DTCNT0_MASK                (0x7FFUL << PWMA_SM3DTCNT_DTCNT0_SHIFT)             /*!< PWMA_SM3DTCNT: DTCNT0 Mask              */
#define PWMA_SM3DTCNT_DTCNT0_SHIFT               0                                                   /*!< PWMA_SM3DTCNT: DTCNT0 Position          */
#define PWMA_SM3DTCNT_DTCNT0(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM3DTCNT_DTCNT0_SHIFT))&PWMA_SM3DTCNT_DTCNT0_MASK) /*!< PWMA_SM3DTCNT                           */
/* ------- SM3CAPTCTRLA Bit Fields                  ------ */
#define PWMA_SM3CAPTCTRLA_ARMA_MASK              (0x01UL << PWMA_SM3CAPTCTRLA_ARMA_SHIFT)            /*!< PWMA_SM3CAPTCTRLA: ARMA Mask            */
#define PWMA_SM3CAPTCTRLA_ARMA_SHIFT             0                                                   /*!< PWMA_SM3CAPTCTRLA: ARMA Position        */
#define PWMA_SM3CAPTCTRLA_ONESHOTA_MASK          (0x01UL << PWMA_SM3CAPTCTRLA_ONESHOTA_SHIFT)        /*!< PWMA_SM3CAPTCTRLA: ONESHOTA Mask        */
#define PWMA_SM3CAPTCTRLA_ONESHOTA_SHIFT         1                                                   /*!< PWMA_SM3CAPTCTRLA: ONESHOTA Position    */
#define PWMA_SM3CAPTCTRLA_EDGA0_MASK             (0x03UL << PWMA_SM3CAPTCTRLA_EDGA0_SHIFT)           /*!< PWMA_SM3CAPTCTRLA: EDGA0 Mask           */
#define PWMA_SM3CAPTCTRLA_EDGA0_SHIFT            2                                                   /*!< PWMA_SM3CAPTCTRLA: EDGA0 Position       */
#define PWMA_SM3CAPTCTRLA_EDGA0(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCTRLA_EDGA0_SHIFT))&PWMA_SM3CAPTCTRLA_EDGA0_MASK) /*!< PWMA_SM3CAPTCTRLA                       */
#define PWMA_SM3CAPTCTRLA_EDGA1_MASK             (0x03UL << PWMA_SM3CAPTCTRLA_EDGA1_SHIFT)           /*!< PWMA_SM3CAPTCTRLA: EDGA1 Mask           */
#define PWMA_SM3CAPTCTRLA_EDGA1_SHIFT            4                                                   /*!< PWMA_SM3CAPTCTRLA: EDGA1 Position       */
#define PWMA_SM3CAPTCTRLA_EDGA1(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCTRLA_EDGA1_SHIFT))&PWMA_SM3CAPTCTRLA_EDGA1_MASK) /*!< PWMA_SM3CAPTCTRLA                       */
#define PWMA_SM3CAPTCTRLA_INP_SELA_MASK          (0x01UL << PWMA_SM3CAPTCTRLA_INP_SELA_SHIFT)        /*!< PWMA_SM3CAPTCTRLA: INP_SELA Mask        */
#define PWMA_SM3CAPTCTRLA_INP_SELA_SHIFT         6                                                   /*!< PWMA_SM3CAPTCTRLA: INP_SELA Position    */
#define PWMA_SM3CAPTCTRLA_EDGCNTA_EN_MASK        (0x01UL << PWMA_SM3CAPTCTRLA_EDGCNTA_EN_SHIFT)      /*!< PWMA_SM3CAPTCTRLA: EDGCNTA_EN Mask      */
#define PWMA_SM3CAPTCTRLA_EDGCNTA_EN_SHIFT       7                                                   /*!< PWMA_SM3CAPTCTRLA: EDGCNTA_EN Position  */
#define PWMA_SM3CAPTCTRLA_CFAWM_MASK             (0x03UL << PWMA_SM3CAPTCTRLA_CFAWM_SHIFT)           /*!< PWMA_SM3CAPTCTRLA: CFAWM Mask           */
#define PWMA_SM3CAPTCTRLA_CFAWM_SHIFT            8                                                   /*!< PWMA_SM3CAPTCTRLA: CFAWM Position       */
#define PWMA_SM3CAPTCTRLA_CFAWM(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCTRLA_CFAWM_SHIFT))&PWMA_SM3CAPTCTRLA_CFAWM_MASK) /*!< PWMA_SM3CAPTCTRLA                       */
#define PWMA_SM3CAPTCTRLA_CA0CNT_MASK            (0x07UL << PWMA_SM3CAPTCTRLA_CA0CNT_SHIFT)          /*!< PWMA_SM3CAPTCTRLA: CA0CNT Mask          */
#define PWMA_SM3CAPTCTRLA_CA0CNT_SHIFT           10                                                  /*!< PWMA_SM3CAPTCTRLA: CA0CNT Position      */
#define PWMA_SM3CAPTCTRLA_CA0CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCTRLA_CA0CNT_SHIFT))&PWMA_SM3CAPTCTRLA_CA0CNT_MASK) /*!< PWMA_SM3CAPTCTRLA                       */
#define PWMA_SM3CAPTCTRLA_CA1CNT_MASK            (0x07UL << PWMA_SM3CAPTCTRLA_CA1CNT_SHIFT)          /*!< PWMA_SM3CAPTCTRLA: CA1CNT Mask          */
#define PWMA_SM3CAPTCTRLA_CA1CNT_SHIFT           13                                                  /*!< PWMA_SM3CAPTCTRLA: CA1CNT Position      */
