podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV44F15.h
#define PWMA_DTSRCSEL_SM0SEL23_SHIFT             2                                                   /*!< PWMA_DTSRCSEL: SM0SEL23 Position        */
#define PWMA_DTSRCSEL_SM0SEL23(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_DTSRCSEL_SM0SEL23_SHIFT))&PWMA_DTSRCSEL_SM0SEL23_MASK) /*!< PWMA_DTSRCSEL                           */
#define PWMA_DTSRCSEL_SM1SEL45_MASK              (0x03UL << PWMA_DTSRCSEL_SM1SEL45_SHIFT)            /*!< PWMA_DTSRCSEL: SM1SEL45 Mask            */
#define PWMA_DTSRCSEL_SM1SEL45_SHIFT             4                                                   /*!< PWMA_DTSRCSEL: SM1SEL45 Position        */
#define PWMA_DTSRCSEL_SM1SEL45(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_DTSRCSEL_SM1SEL45_SHIFT))&PWMA_DTSRCSEL_SM1SEL45_MASK) /*!< PWMA_DTSRCSEL                           */
#define PWMA_DTSRCSEL_SM1SEL23_MASK              (0x03UL << PWMA_DTSRCSEL_SM1SEL23_SHIFT)            /*!< PWMA_DTSRCSEL: SM1SEL23 Mask            */
#define PWMA_DTSRCSEL_SM1SEL23_SHIFT             6                                                   /*!< PWMA_DTSRCSEL: SM1SEL23 Position        */
#define PWMA_DTSRCSEL_SM1SEL23(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_DTSRCSEL_SM1SEL23_SHIFT))&PWMA_DTSRCSEL_SM1SEL23_MASK) /*!< PWMA_DTSRCSEL                           */
#define PWMA_DTSRCSEL_SM2SEL45_MASK              (0x03UL << PWMA_DTSRCSEL_SM2SEL45_SHIFT)            /*!< PWMA_DTSRCSEL: SM2SEL45 Mask            */
#define PWMA_DTSRCSEL_SM2SEL45_SHIFT             8                                                   /*!< PWMA_DTSRCSEL: SM2SEL45 Position        */
#define PWMA_DTSRCSEL_SM2SEL45(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_DTSRCSEL_SM2SEL45_SHIFT))&PWMA_DTSRCSEL_SM2SEL45_MASK) /*!< PWMA_DTSRCSEL                           */
#define PWMA_DTSRCSEL_SM2SEL23_MASK              (0x03UL << PWMA_DTSRCSEL_SM2SEL23_SHIFT)            /*!< PWMA_DTSRCSEL: SM2SEL23 Mask            */
#define PWMA_DTSRCSEL_SM2SEL23_SHIFT             10                                                  /*!< PWMA_DTSRCSEL: SM2SEL23 Position        */
#define PWMA_DTSRCSEL_SM2SEL23(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_DTSRCSEL_SM2SEL23_SHIFT))&PWMA_DTSRCSEL_SM2SEL23_MASK) /*!< PWMA_DTSRCSEL                           */
#define PWMA_DTSRCSEL_SM3SEL45_MASK              (0x03UL << PWMA_DTSRCSEL_SM3SEL45_SHIFT)            /*!< PWMA_DTSRCSEL: SM3SEL45 Mask            */
#define PWMA_DTSRCSEL_SM3SEL45_SHIFT             12                                                  /*!< PWMA_DTSRCSEL: SM3SEL45 Position        */
#define PWMA_DTSRCSEL_SM3SEL45(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_DTSRCSEL_SM3SEL45_SHIFT))&PWMA_DTSRCSEL_SM3SEL45_MASK) /*!< PWMA_DTSRCSEL                           */
#define PWMA_DTSRCSEL_SM3SEL23_MASK              (0x03UL << PWMA_DTSRCSEL_SM3SEL23_SHIFT)            /*!< PWMA_DTSRCSEL: SM3SEL23 Mask            */
#define PWMA_DTSRCSEL_SM3SEL23_SHIFT             14                                                  /*!< PWMA_DTSRCSEL: SM3SEL23 Position        */
#define PWMA_DTSRCSEL_SM3SEL23(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_DTSRCSEL_SM3SEL23_SHIFT))&PWMA_DTSRCSEL_SM3SEL23_MASK) /*!< PWMA_DTSRCSEL                           */
/* ------- MCTRL Bit Fields                         ------ */
#define PWMA_MCTRL_LDOK_MASK                     (0x0FUL << PWMA_MCTRL_LDOK_SHIFT)                   /*!< PWMA_MCTRL: LDOK Mask                   */
#define PWMA_MCTRL_LDOK_SHIFT                    0                                                   /*!< PWMA_MCTRL: LDOK Position               */
#define PWMA_MCTRL_LDOK(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_MCTRL_LDOK_SHIFT))&PWMA_MCTRL_LDOK_MASK) /*!< PWMA_MCTRL                              */
#define PWMA_MCTRL_CLDOK_MASK                    (0x0FUL << PWMA_MCTRL_CLDOK_SHIFT)                  /*!< PWMA_MCTRL: CLDOK Mask                  */
#define PWMA_MCTRL_CLDOK_SHIFT                   4                                                   /*!< PWMA_MCTRL: CLDOK Position              */
#define PWMA_MCTRL_CLDOK(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_MCTRL_CLDOK_SHIFT))&PWMA_MCTRL_CLDOK_MASK) /*!< PWMA_MCTRL                              */
#define PWMA_MCTRL_RUN_MASK                      (0x0FUL << PWMA_MCTRL_RUN_SHIFT)                    /*!< PWMA_MCTRL: RUN Mask                    */
#define PWMA_MCTRL_RUN_SHIFT                     8                                                   /*!< PWMA_MCTRL: RUN Position                */
#define PWMA_MCTRL_RUN(x)                        (((uint16_t)(((uint16_t)(x))<<PWMA_MCTRL_RUN_SHIFT))&PWMA_MCTRL_RUN_MASK) /*!< PWMA_MCTRL                              */
#define PWMA_MCTRL_IPOL_MASK                     (0x0FUL << PWMA_MCTRL_IPOL_SHIFT)                   /*!< PWMA_MCTRL: IPOL Mask                   */
#define PWMA_MCTRL_IPOL_SHIFT                    12                                                  /*!< PWMA_MCTRL: IPOL Position               */
#define PWMA_MCTRL_IPOL(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_MCTRL_IPOL_SHIFT))&PWMA_MCTRL_IPOL_MASK) /*!< PWMA_MCTRL                              */
/* ------- MCTRL2 Bit Fields                        ------ */
#define PWMA_MCTRL2_MONPLL_MASK                  (0x03UL << PWMA_MCTRL2_MONPLL_SHIFT)                /*!< PWMA_MCTRL2: MONPLL Mask                */
#define PWMA_MCTRL2_MONPLL_SHIFT                 0                                                   /*!< PWMA_MCTRL2: MONPLL Position            */
#define PWMA_MCTRL2_MONPLL(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_MCTRL2_MONPLL_SHIFT))&PWMA_MCTRL2_MONPLL_MASK) /*!< PWMA_MCTRL2                             */
/* ------- FCTRL Bit Fields                         ------ */
#define PWMA_FCTRL_FIE_MASK                      (0x0FUL << PWMA_FCTRL_FIE_SHIFT)                    /*!< PWMA_FCTRL: FIE Mask                    */
#define PWMA_FCTRL_FIE_SHIFT                     0                                                   /*!< PWMA_FCTRL: FIE Position                */
#define PWMA_FCTRL_FIE(x)                        (((uint16_t)(((uint16_t)(x))<<PWMA_FCTRL_FIE_SHIFT))&PWMA_FCTRL_FIE_MASK) /*!< PWMA_FCTRL                              */
#define PWMA_FCTRL_FSAFE_MASK                    (0x0FUL << PWMA_FCTRL_FSAFE_SHIFT)                  /*!< PWMA_FCTRL: FSAFE Mask                  */
#define PWMA_FCTRL_FSAFE_SHIFT                   4                                                   /*!< PWMA_FCTRL: FSAFE Position              */
#define PWMA_FCTRL_FSAFE(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_FCTRL_FSAFE_SHIFT))&PWMA_FCTRL_FSAFE_MASK) /*!< PWMA_FCTRL                              */
#define PWMA_FCTRL_FAUTO_MASK                    (0x0FUL << PWMA_FCTRL_FAUTO_SHIFT)                  /*!< PWMA_FCTRL: FAUTO Mask                  */
#define PWMA_FCTRL_FAUTO_SHIFT                   8                                                   /*!< PWMA_FCTRL: FAUTO Position              */
#define PWMA_FCTRL_FAUTO(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_FCTRL_FAUTO_SHIFT))&PWMA_FCTRL_FAUTO_MASK) /*!< PWMA_FCTRL                              */
#define PWMA_FCTRL_FLVL_MASK                     (0x0FUL << PWMA_FCTRL_FLVL_SHIFT)                   /*!< PWMA_FCTRL: FLVL Mask                   */
#define PWMA_FCTRL_FLVL_SHIFT                    12                                                  /*!< PWMA_FCTRL: FLVL Position               */
#define PWMA_FCTRL_FLVL(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_FCTRL_FLVL_SHIFT))&PWMA_FCTRL_FLVL_MASK) /*!< PWMA_FCTRL                              */
/* ------- FSTS Bit Fields                          ------ */
#define PWMA_FSTS_FFLAG_MASK                     (0x0FUL << PWMA_FSTS_FFLAG_SHIFT)                   /*!< PWMA_FSTS: FFLAG Mask                   */
#define PWMA_FSTS_FFLAG_SHIFT                    0                                                   /*!< PWMA_FSTS: FFLAG Position               */
#define PWMA_FSTS_FFLAG(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_FSTS_FFLAG_SHIFT))&PWMA_FSTS_FFLAG_MASK) /*!< PWMA_FSTS                               */
#define PWMA_FSTS_FFULL_MASK                     (0x0FUL << PWMA_FSTS_FFULL_SHIFT)                   /*!< PWMA_FSTS: FFULL Mask                   */
#define PWMA_FSTS_FFULL_SHIFT                    4                                                   /*!< PWMA_FSTS: FFULL Position               */
#define PWMA_FSTS_FFULL(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_FSTS_FFULL_SHIFT))&PWMA_FSTS_FFULL_MASK) /*!< PWMA_FSTS                               */
#define PWMA_FSTS_FFPIN_MASK                     (0x0FUL << PWMA_FSTS_FFPIN_SHIFT)                   /*!< PWMA_FSTS: FFPIN Mask                   */
#define PWMA_FSTS_FFPIN_SHIFT                    8                                                   /*!< PWMA_FSTS: FFPIN Position               */
#define PWMA_FSTS_FFPIN(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_FSTS_FFPIN_SHIFT))&PWMA_FSTS_FFPIN_MASK) /*!< PWMA_FSTS                               */
#define PWMA_FSTS_FHALF_MASK                     (0x0FUL << PWMA_FSTS_FHALF_SHIFT)                   /*!< PWMA_FSTS: FHALF Mask                   */
#define PWMA_FSTS_FHALF_SHIFT                    12                                                  /*!< PWMA_FSTS: FHALF Position               */
#define PWMA_FSTS_FHALF(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_FSTS_FHALF_SHIFT))&PWMA_FSTS_FHALF_MASK) /*!< PWMA_FSTS                               */
/* ------- FFILT Bit Fields                         ------ */
#define PWMA_FFILT_FILT_PER_MASK                 (0xFFUL << PWMA_FFILT_FILT_PER_SHIFT)               /*!< PWMA_FFILT: FILT_PER Mask               */
#define PWMA_FFILT_FILT_PER_SHIFT                0                                                   /*!< PWMA_FFILT: FILT_PER Position           */
#define PWMA_FFILT_FILT_PER(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_FFILT_FILT_PER_SHIFT))&PWMA_FFILT_FILT_PER_MASK) /*!< PWMA_FFILT                              */
#define PWMA_FFILT_FILT_CNT_MASK                 (0x07UL << PWMA_FFILT_FILT_CNT_SHIFT)               /*!< PWMA_FFILT: FILT_CNT Mask               */
#define PWMA_FFILT_FILT_CNT_SHIFT                8                                                   /*!< PWMA_FFILT: FILT_CNT Position           */
#define PWMA_FFILT_FILT_CNT(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_FFILT_FILT_CNT_SHIFT))&PWMA_FFILT_FILT_CNT_MASK) /*!< PWMA_FFILT                              */
#define PWMA_FFILT_GSTR_MASK                     (0x01UL << PWMA_FFILT_GSTR_SHIFT)                   /*!< PWMA_FFILT: GSTR Mask                   */
#define PWMA_FFILT_GSTR_SHIFT                    15                                                  /*!< PWMA_FFILT: GSTR Position               */
/* ------- FTST Bit Fields                          ------ */
#define PWMA_FTST_FTEST_MASK                     (0x01UL << PWMA_FTST_FTEST_SHIFT)                   /*!< PWMA_FTST: FTEST Mask                   */
#define PWMA_FTST_FTEST_SHIFT                    0                                                   /*!< PWMA_FTST: FTEST Position               */
/* ------- FCTRL2 Bit Fields                        ------ */
#define PWMA_FCTRL2_NOCOMB_MASK                  (0x0FUL << PWMA_FCTRL2_NOCOMB_SHIFT)                /*!< PWMA_FCTRL2: NOCOMB Mask                */
#define PWMA_FCTRL2_NOCOMB_SHIFT                 0                                                   /*!< PWMA_FCTRL2: NOCOMB Position            */
#define PWMA_FCTRL2_NOCOMB(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_FCTRL2_NOCOMB_SHIFT))&PWMA_FCTRL2_NOCOMB_MASK) /*!< PWMA_FCTRL2                             */
/**
 * @} */ /* End group PWMA_Register_Masks_GROUP 
 */

/* PWMA - Peripheral instance base addresses */
#define PWMA_BasePtr                   0x40033000UL //!< Peripheral base address
#define PWMA                           ((PWMA_Type *) PWMA_BasePtr) //!< Freescale base pointer
#define PWMA_BASE_PTR                  (PWMA) //!< Freescale style base pointer
/**
 * @} */ /* End group PWMA_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup RCM_Peripheral_access_layer_GROUP RCM Peripheral Access Layer
* @brief C Struct for RCM
* @{
*/

/* ================================================================================ */
/* ================           RCM (file:RCM_MKV40F15)              ================ */
/* ================================================================================ */

/**
 * @brief Reset Control Module
 */
/**
* @addtogroup RCM_structs_GROUP RCM struct
* @brief Struct for RCM
* @{
*/
typedef struct {                                /*       RCM Structure                                                */
   __I  uint8_t   SRS0;                         /**< 0000: System Reset Status Register 0                               */
   __I  uint8_t   SRS1;                         /**< 0001: System Reset Status Register 1                               */
   __I  uint16_t  RESERVED0;                   
   __IO uint8_t   RPFC;                         /**< 0004: Reset Pin Filter Control Register                            */
   __IO uint8_t   RPFW;                         /**< 0005: Reset Pin Filter Width Register                              */
   __I  uint16_t  RESERVED1;                   
   __IO uint8_t   SSRS0;                        /**< 0008: Sticky System Reset Status Register 0                        */
   __IO uint8_t   SSRS1;                        /**< 0009: Sticky System Reset Status Register 1                        */
} RCM_Type;

/**
 * @} */ /* End group RCM_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'RCM' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup RCM_Register_Masks_GROUP RCM Register Masks
* @brief Register Masks for RCM
* @{
*/
/* ------- SRS0 Bit Fields                          ------ */
#define RCM_SRS0_WAKEUP_MASK                     (0x01UL << RCM_SRS0_WAKEUP_SHIFT)                   /*!< RCM_SRS0: WAKEUP Mask                   */
#define RCM_SRS0_WAKEUP_SHIFT                    0                                                   /*!< RCM_SRS0: WAKEUP Position               */
#define RCM_SRS0_LVD_MASK                        (0x01UL << RCM_SRS0_LVD_SHIFT)                      /*!< RCM_SRS0: LVD Mask                      */
#define RCM_SRS0_LVD_SHIFT                       1                                                   /*!< RCM_SRS0: LVD Position                  */
#define RCM_SRS0_LOC_MASK                        (0x01UL << RCM_SRS0_LOC_SHIFT)                      /*!< RCM_SRS0: LOC Mask                      */
#define RCM_SRS0_LOC_SHIFT                       2                                                   /*!< RCM_SRS0: LOC Position                  */
#define RCM_SRS0_LOL_MASK                        (0x01UL << RCM_SRS0_LOL_SHIFT)                      /*!< RCM_SRS0: LOL Mask                      */
#define RCM_SRS0_LOL_SHIFT                       3                                                   /*!< RCM_SRS0: LOL Position                  */
#define RCM_SRS0_WDOG_MASK                       (0x01UL << RCM_SRS0_WDOG_SHIFT)                     /*!< RCM_SRS0: WDOG Mask                     */
#define RCM_SRS0_WDOG_SHIFT                      5                                                   /*!< RCM_SRS0: WDOG Position                 */
#define RCM_SRS0_PIN_MASK                        (0x01UL << RCM_SRS0_PIN_SHIFT)                      /*!< RCM_SRS0: PIN Mask                      */
#define RCM_SRS0_PIN_SHIFT                       6                                                   /*!< RCM_SRS0: PIN Position                  */
#define RCM_SRS0_POR_MASK                        (0x01UL << RCM_SRS0_POR_SHIFT)                      /*!< RCM_SRS0: POR Mask                      */
#define RCM_SRS0_POR_SHIFT                       7                                                   /*!< RCM_SRS0: POR Position                  */
/* ------- SRS1 Bit Fields                          ------ */
#define RCM_SRS1_LOCKUP_MASK                     (0x01UL << RCM_SRS1_LOCKUP_SHIFT)                   /*!< RCM_SRS1: LOCKUP Mask                   */
#define RCM_SRS1_LOCKUP_SHIFT                    1                                                   /*!< RCM_SRS1: LOCKUP Position               */
#define RCM_SRS1_SW_MASK                         (0x01UL << RCM_SRS1_SW_SHIFT)                       /*!< RCM_SRS1: SW Mask                       */
#define RCM_SRS1_SW_SHIFT                        2                                                   /*!< RCM_SRS1: SW Position                   */
#define RCM_SRS1_MDM_AP_MASK                     (0x01UL << RCM_SRS1_MDM_AP_SHIFT)                   /*!< RCM_SRS1: MDM_AP Mask                   */
#define RCM_SRS1_MDM_AP_SHIFT                    3                                                   /*!< RCM_SRS1: MDM_AP Position               */
#define RCM_SRS1_SACKERR_MASK                    (0x01UL << RCM_SRS1_SACKERR_SHIFT)                  /*!< RCM_SRS1: SACKERR Mask                  */
#define RCM_SRS1_SACKERR_SHIFT                   5                                                   /*!< RCM_SRS1: SACKERR Position              */
/* ------- RPFC Bit Fields                          ------ */
#define RCM_RPFC_RSTFLTSRW_MASK                  (0x03UL << RCM_RPFC_RSTFLTSRW_SHIFT)                /*!< RCM_RPFC: RSTFLTSRW Mask                */
#define RCM_RPFC_RSTFLTSRW_SHIFT                 0                                                   /*!< RCM_RPFC: RSTFLTSRW Position            */
#define RCM_RPFC_RSTFLTSRW(x)                    (((uint8_t)(((uint8_t)(x))<<RCM_RPFC_RSTFLTSRW_SHIFT))&RCM_RPFC_RSTFLTSRW_MASK) /*!< RCM_RPFC                                */
#define RCM_RPFC_RSTFLTSS_MASK                   (0x01UL << RCM_RPFC_RSTFLTSS_SHIFT)                 /*!< RCM_RPFC: RSTFLTSS Mask                 */
#define RCM_RPFC_RSTFLTSS_SHIFT                  2                                                   /*!< RCM_RPFC: RSTFLTSS Position             */
/* ------- RPFW Bit Fields                          ------ */
#define RCM_RPFW_RSTFLTSEL_MASK                  (0x1FUL << RCM_RPFW_RSTFLTSEL_SHIFT)                /*!< RCM_RPFW: RSTFLTSEL Mask                */
#define RCM_RPFW_RSTFLTSEL_SHIFT                 0                                                   /*!< RCM_RPFW: RSTFLTSEL Position            */
#define RCM_RPFW_RSTFLTSEL(x)                    (((uint8_t)(((uint8_t)(x))<<RCM_RPFW_RSTFLTSEL_SHIFT))&RCM_RPFW_RSTFLTSEL_MASK) /*!< RCM_RPFW                                */
/* ------- SSRS0 Bit Fields                         ------ */
#define RCM_SSRS0_SWAKEUP_MASK                   (0x01UL << RCM_SSRS0_SWAKEUP_SHIFT)                 /*!< RCM_SSRS0: SWAKEUP Mask                 */
#define RCM_SSRS0_SWAKEUP_SHIFT                  0                                                   /*!< RCM_SSRS0: SWAKEUP Position             */
#define RCM_SSRS0_SLVD_MASK                      (0x01UL << RCM_SSRS0_SLVD_SHIFT)                    /*!< RCM_SSRS0: SLVD Mask                    */
#define RCM_SSRS0_SLVD_SHIFT                     1                                                   /*!< RCM_SSRS0: SLVD Position                */
#define RCM_SSRS0_SLOC_MASK                      (0x01UL << RCM_SSRS0_SLOC_SHIFT)                    /*!< RCM_SSRS0: SLOC Mask                    */
#define RCM_SSRS0_SLOC_SHIFT                     2                                                   /*!< RCM_SSRS0: SLOC Position                */
#define RCM_SSRS0_SLOL_MASK                      (0x01UL << RCM_SSRS0_SLOL_SHIFT)                    /*!< RCM_SSRS0: SLOL Mask                    */
#define RCM_SSRS0_SLOL_SHIFT                     3                                                   /*!< RCM_SSRS0: SLOL Position                */
#define RCM_SSRS0_SWDOG_MASK                     (0x01UL << RCM_SSRS0_SWDOG_SHIFT)                   /*!< RCM_SSRS0: SWDOG Mask                   */
#define RCM_SSRS0_SWDOG_SHIFT                    5                                                   /*!< RCM_SSRS0: SWDOG Position               */
#define RCM_SSRS0_SPIN_MASK                      (0x01UL << RCM_SSRS0_SPIN_SHIFT)                    /*!< RCM_SSRS0: SPIN Mask                    */
#define RCM_SSRS0_SPIN_SHIFT                     6                                                   /*!< RCM_SSRS0: SPIN Position                */
#define RCM_SSRS0_SPOR_MASK                      (0x01UL << RCM_SSRS0_SPOR_SHIFT)                    /*!< RCM_SSRS0: SPOR Mask                    */
#define RCM_SSRS0_SPOR_SHIFT                     7                                                   /*!< RCM_SSRS0: SPOR Position                */
/* ------- SSRS1 Bit Fields                         ------ */
#define RCM_SSRS1_SLOCKUP_MASK                   (0x01UL << RCM_SSRS1_SLOCKUP_SHIFT)                 /*!< RCM_SSRS1: SLOCKUP Mask                 */
#define RCM_SSRS1_SLOCKUP_SHIFT                  1                                                   /*!< RCM_SSRS1: SLOCKUP Position             */
#define RCM_SSRS1_SSW_MASK                       (0x01UL << RCM_SSRS1_SSW_SHIFT)                     /*!< RCM_SSRS1: SSW Mask                     */
#define RCM_SSRS1_SSW_SHIFT                      2                                                   /*!< RCM_SSRS1: SSW Position                 */
#define RCM_SSRS1_SMDM_AP_MASK                   (0x01UL << RCM_SSRS1_SMDM_AP_SHIFT)                 /*!< RCM_SSRS1: SMDM_AP Mask                 */
#define RCM_SSRS1_SMDM_AP_SHIFT                  3                                                   /*!< RCM_SSRS1: SMDM_AP Position             */
#define RCM_SSRS1_SSACKERR_MASK                  (0x01UL << RCM_SSRS1_SSACKERR_SHIFT)                /*!< RCM_SSRS1: SSACKERR Mask                */
#define RCM_SSRS1_SSACKERR_SHIFT                 5                                                   /*!< RCM_SSRS1: SSACKERR Position            */
/**
 * @} */ /* End group RCM_Register_Masks_GROUP 
 */

